[
{"date": "July 6, 2021", "title": "Prosecutors Have Had Six Months To Go After The Capitol Mob. Here’s What They Have So Far.", "text": "Trump supporters clash with police and security forces at the US Capitol on Jan. 6, 2021.WASHINGTON — Tuesday marked six months since thousands of Donald Trump supporters toppled and streamed past police barriers onto the grounds of the US Capitol, with hundreds making their way inside the building as lawmakers, staffers, and journalists scrambled to take shelter.The investigation shows no signs of ending any time soon. New arrests have been unsealed in federal court every week since the riots. The FBI continues to solicit tips from the public to identify hundreds of suspects photographed and recorded on video at the scene. And a handful of plea deals made public so far confirm that investigators are working with cooperating defendants to build other cases.", "is_fake": 0},
{"date": "July 1, 2021", "title": "A Former Cop Charged In The Capitol Attack Has Amassed An Arsenal Of Weapons Since Jan. 6", "text": "Jacob Fracker (left) and Thomas Robertson inside the US Capitol on Jan. 6While some people charged in the Jan. 6 attack on the US Capitol have  for their actions and taken ", "is_fake": 0},
{"date": "July 1, 2021", "title": "The Trump Organization And A Longtime Executive Are Charged In A Tax Fraud Scheme", "text": "Allen Weisselberg at the hearing for the case at the criminal court in lower Manhattan in New York on July 1.The Trump Organization — former president Donald Trump’s eponymous business empire — and a longtime senior executive have been charged in what New York state prosecutors alleged was a 16-year tax fraud scheme, marking the first criminal legal exposure that Trump has faced since leaving office.Trump was not personally charged, but the prosecution of his company and its chief financial officer, Allen Weisselberg, signaled a massive escalation by the Manhattan district attorney’s office and New York state attorney general’s office of their investigations into Trump and his financial affairs.", "is_fake": 0},
{"date": "July 1, 2021", "title": "Influencers In Norway Will Legally Have To Disclose Their Photoshopped Images", "text": "Legislators in Norway have announced  that will make it a legal requirement for influencers and advertisers to label images that have been retouched or have filters in a bid to address “body pressure in society.”The new law is an amendment to the 2009 Marketing Act and was passed with overwhelming support, in a 72–15 vote last month by the Norwegian Parliament.", "is_fake": 0},
{"date": "July 1, 2021", "title": "Track The Brutal 2021 Wildfire Season With These Updating Charts And Maps", "text": "The West is a tinderbox this year, with heat waves and high winds through summer and fall expected to create the conditions for yet another brutal fire season.“It’s just scary,” Alexandra Syphard, chief scientist with Vertus Wildfire Insurance Services and an ecologist at San Diego State University, told BuzzFeed News. “We’ve seen these severe fire seasons year after year now. Everybody’s nervous.”The charts and maps below will update to track current wildfires and air quality, compare the 2021 season to previous years, and monitor the weather conditions that make fires more likely to ignite and spread quickly.", "is_fake": 0},
{"date": "July 1, 2021", "title": "Officials Have Paused Rescue Efforts In The Miami Condo Collapse Because The Rest Of The Tower Might Fall", "text": "Search and rescue efforts at the building collapse in Surfside, Florida, resumed Thursday evening after they were halted for most of the day over fears that the rest of the condo complex might topple.\"Finding missing loved ones continues to be at the forefront of our operations,\" Miami-Dade Fire Rescue .", "is_fake": 0},
{"date": "July 1, 2021", "title": "Can Virtual Reality Fix My Fear Of Space?", "text": " I don’t like anything. I travel only when forced to, I experience new things only when obligated, I adapt only when there’s no other choice. I don’t live a completely joyless life — you don’t know pleasure until you’re seated at a restaurant next to a couple having a rippling fight, close enough for you to hear  — but it would be fair to say I take  pleasure from the wonders of the world than the average person.", "is_fake": 0},
{"date": "July 1, 2021", "title": "Trump Hasn’t Been Charged, But The Prosecution Of His Company Isn’t Good News For Him", "text": "WASHINGTON — Former president Donald Trump wasn’t charged in the  accusing his company and a longtime executive of financial crimes, but it doesn’t mean he’s off the hook.The Trump Organization and its chief financial officer Allen Weisselberg were jointly charged with carrying out a tax fraud scheme dating back to March 2005, according to an indictment unsealed on Thursday afternoon. Weisselberg, who has worked for the Trump family since the 1970s, was also charged individually with grand larceny and with falsifying tax records related to $1.76 million in “indirect” compensation he allegedly received from the Trump organization which wasn’t properly reported and wasn’t taxed.", "is_fake": 0},
{"date": "July 1, 2021", "title": "These Poignant Photos Show How Much Diana Loved William And Harry", "text": "Diana, Princess of Wales, stands with her sons, Prince William and Prince Harry, at the piano in Kensington Palace on Oct. 4, 1985.Diana helps William with a jigsaw puzzle in his playroom in Kensington Palace on Oct. 22, 1985.William and Harry stand with their mother, Diana, in the garden of Highgrove House in Gloucestershire on July 18, 1986.", "is_fake": 0},
{"date": "July 1, 2021", "title": "Republicans Are Weaponizing Critical Race Theory To Win Back The House In 2022", "text": "Fox News personality Tucker Carlson in 2019The Republican Party is associating Democrats in close 2022 midterm election races with critical race theory, deploying their latest culture war strategy as part of the right’s bid to regain control of the House of Representatives.The strategy is rooted in what Republican officials believe worked for them in 2020: tying Democrats in swing districts to a hyperemotional and tense local issue, even if it’s not something that Congress has much of a role in. In the last election, it was police funding and Black Lives Matter protests.", "is_fake": 0},
{"date": "July 1, 2021", "title": "A CDC Investigation Says West Virginia Needs Needle Exchanges — Which The State Outlawed — To Stop Its HIV Outbreak", "text": "Volunteers staff a table at SOAR s needle exchange in Charleston, West Virginia, which has since been effectively outlawed by the state.A dangerous HIV outbreak in Charleston, West Virginia, will require “low-barrier” needle exchanges to stop the disease from spreading, according to a preliminary  obtained by BuzzFeed News.", "is_fake": 0},
{"date": "July 1, 2021", "title": "The Company Appointed To Co-Manage Britney Spears' Finances Is Resigning Because Of Her Explosive Court Testimony", "text": "A portrait of Britney Spears looms over supporters and news media outside a court hearing about the pop singer s conservatorship in Los Angeles on June 23.A wealth management firm that was appointed to manage Britney Spears  finances with her father is resigning as a result of the pop star s explosive comments deriding the conservatorship that has controlled her life for more than a decade.In a document filed Thursday in Los Angeles County Superior Court, Bessemer Trust requested to withdraw as co-conservator of Spears  estate because of the 39-year-old singer s objections to the legal arrangement. Last week, Spears ", "is_fake": 0},
{"date": "July 2, 2021", "title": "Julianne Moore Called Out The \"Totally Sexist\" Expectation For Women To \"Age Gracefully\"", "text": "\"We don t have an option, of course,\" she said. \"No one has an option about aging, so it s not a positive or a negative thing. It just is.\"\"It s part of the human condition,\" Julianne added. \"So why are we always talking about it as if it is something that we have control over?\"\"We are given a narrative as children that we keep growing through school, maybe go to college, then after school is finished, the idea of growth is done,\" Julianne reflected. \"But we have all this life left to live.\"", "is_fake": 0},
{"date": "July 2, 2021", "title": "Rapper Cashh Was Deported From The UK Seven Years Ago. Now He's Back With \"Return Of The Man.\"", "text": "Cashh, the 27-year-old rapper from South London, seems to have lived so much more life than the number of years his age would suggest. Although raised in the UK, he was actually born in the Park Lane area of Kingston, Jamaica, and his musical journey arguably started there — right in the home of reggae and dancehall music.Speaking to BuzzFeed News via Zoom, Cashh said he grew up around parties. Some of his earliest musical memories are of laying in bed at night and hearing the music playing from a distance, but being too young to attend. It wasn’t long, though, until he was going out to those dances himself: By his own estimation, the first time he attended a party was somewhere between the ages of 3 and 4 years old.That is, in part, why it seems like he’s lived so much: He’s had confidence and been navigating the world from a young age, surrounding himself with people older than him. These experiences are even documented by one of those elders that used to take him out to the dances on the intro to his 2020 track \"Trench Baby.\"", "is_fake": 0},
{"date": "July 2, 2021", "title": "I Am A Fan Of TikToker LeendaDong. However…", "text": " Please Like Me This newsletter is particularly hard for me to write. It’s personal, and I’m wavering between being sensitive to my own feelings about the issue and being sensitive to a huge TikTok personality whom I’ve been a fan of for the past year.", "is_fake": 0},
{"date": "July 2, 2021", "title": "What The Anger About Influencers Getting PPP Loans Is Really About", "text": " Please Like Me WHO COULD’VE SEEN THIS COMING: It appears Jaclyn Hill took 2 COVID relief loans for her business. One for $160,600 and another for $230,625. Jeffree Star also took a PPP loan for $413,675.", "is_fake": 0},
{"date": "July 2, 2021", "title": "Sprinter Sha’Carri Richardson Tested Positive For Cannabis", "text": "US sprinter Sha’Carri Richardson has broken her silence following the news that the track star tested positive for cannabis, leading to her receiving a one-month ban and disqualifying her from running the 100-meter race at the Tokyo Olympics.Appearing on NBC s  show, the 21-year-old confirmed that she had tested positive for THC, the psychoactive substance in cannabis, which she used after hearing that her mother had died.", "is_fake": 0},
{"date": "June 28, 2021", "title": "Flight Attendants Told Us The Wildest Things They’ve Had To Deal With", "text": " eases in the US, Americans are traveling once more. TSA data shows  went through airport security checkpoints each day in early June, compared to less than 500,000 for the same time last year.But as people take to the sky, reports of bad behavior are also on the rise.", "is_fake": 0},
{"date": "June 28, 2021", "title": "Authorities Said A White Supremacist Fatally Shot Two People Near Boston Because They Were Black", "text": "Massachusetts authorities said a man who gunned down two people outside Boston on Saturday after crashing a stolen truck was a white supremacist who targeted them because they were Black.Now, prosecutors are investigating the case as a hate crime.Ramona Cooper, 60, a staff sergeant in the Air Force, and 68-year-old David Green, a retired state trooper, were shot multiple times Saturday afternoon by Nathan Allen, after he crashed a box truck stolen from a piping and drain company into a home in the city of Winthrop, according to Suffolk District Attorney Rachael Rollins.", "is_fake": 0},
{"date": "June 28, 2021", "title": "Gavin Grimm Won A Huge Battle For Trans Student Rights. He Said It’s A “Nightmare” That A Child Had To Fight It.", "text": "Gavin Grimm in 2019WASHINGTON — In November 2014, Gavin Grimm, then a high school sophomore,  at a meeting of the school board in Gloucester County, Virginia. Standing with his hands in his pockets, he explained that as a transgender teen, being forced to use bathrooms at school besides the one that matched his gender was “alienating” and “humiliating.”", "is_fake": 0},
{"date": "June 28, 2021", "title": "The Wimbledon Crowd Gave A Standing Ovation For A Woman Who Helped Develop A COVID Vaccine", "text": "The Wimbledon crowd stands and applauds for professor Sarah Gilbert, who can be seen wearing a red jacket in the front row.At Monday s opening day of play on Wimbledon s Centre Court in London, the announcer told the crowd of spectators there were some special guests in attendance.People who played critical roles in the UK s response to the ", "is_fake": 0},
{"date": "June 29, 2021", "title": "Kristen Bell Explained Why She And Dax Shepard Go To Therapy Separately To \"Complain\" About Each Other", "text": "Back in 2017, Dax told  that the pair are \"opposites,\" admitting it takes \"a tremendous amount of work and therapy for [them] to coexist.\"And last year, around the beginning of quarantine, they admitted to being \"at each other s throats\" due to the increased amount of free time spent together at home.", "is_fake": 0},
{"date": "June 29, 2021", "title": "These Travel Influencers Pivoted During The Pandemic", "text": "  when she first realized that COVID-19 may have a huge impact on her life.Mello, a 30-year-old whose home base is San Francisco, was used to her life taking unexpected twists and turns. In 2017, she had been dutifully checking off boxes of success, working in marketing at Google, but she found herself feeling restless. After taking a trip to Indonesia, she started her Instagram account, @", "is_fake": 0},
{"date": "June 29, 2021", "title": "Some Parents Had A Total Meltdown When A Virtual Netflix Event For The Show \"Nailed It\" Did Not, In Fact, Nail It", "text": "Wow, thanks @netflix @NailedIt @fever_us for the total bust on the Nailed it at home challenge. Looks to be a Fyre Festival: Kids Edition.#naileditathomeA Netflix virtual event devolved into a social media meltdown when people planning to participate — most of whom were doing so with and for their kids — were given a bad passcode and weren t able to properly log in.The interactive event was held by Netflix and Fever US on Saturday for the show ", "is_fake": 0},
{"date": "June 29, 2021", "title": "A Record-Breaking Heat Wave Sent Hundreds Of People To The Hospital In Washington And Oregon", "text": "People resting at the Oregon Convention Center cooling station in Portland on June 28, 2021.The record-breaking heat wave in the Pacific Northwest is pushing people’s bodies to the limit — sending more than 1,100 people to the hospital for possible heat-related illness in recent days.There’s no question about it, scientists and health experts say: This is the result of climate change, and the future only holds more of the same.", "is_fake": 0},
{"date": "June 29, 2021", "title": "These Photos Show How Los Angeles’s Koreatown Adapted To The Pandemic", "text": "When photographer Emanuel Hahn moved to Los Angeles during the pandemic, he was in a creative rut. He started visiting LA’s Koreatown — the first and most famous in the US, according to  — drawn to the old graphics and signage. The storefronts reminded him of his parents’ hometown of Daegu, South Korea, in the 1990s. After frequenting businesses and striking up conversations with their owners, he learned that like  in the United States, these businesses were being hit extremely hard by the pandemic and gentrification.", "is_fake": 0},
{"date": "June 29, 2021", "title": "These People Of Color Are Anxious About Racist Microaggressions When They Return To The Office", "text": " inside working from her home in Washington, DC, during the pandemic, Linnea expected to feel lonely, isolated, and disconnected. But that wasn’t the case, for a simple reason, she soon realized: “The white people were missing.”Linnea, a Black woman in her mid-thirties who works in public policy and requested partial anonymity to protect her privacy, no longer had to endure white managers at her office discounting her ideas only to praise them when they were repeated by white colleagues. She didn’t have to see white people give their dirty dishes to the catering and janitorial staff, who were usually people of color, without saying a word or otherwise acknowledging their presence. She no longer felt labeled as “that loud, angry, Black woman” and no longer had to deal with “painful and traumatic reminders that I do not necessarily belong here, and these institutions and these workplaces weren’t built for people like myself,” she said. She watched her heart rate drop on her Fitbit.“Working from home has brought me a level of peace that I did not anticipate, that I really didn’t expect, and frankly, that I don’t even think I knew was missing until I was able to be in my home by myself,” she said.", "is_fake": 0},
{"date": "June 29, 2021", "title": "The Number Of Immigrants Jailed By ICE Has Ballooned Under Biden This Year", "text": "Immigrants seeking asylum walk at the ICE South Texas Family Residential Center in Dilley, Texas.The number of immigrants detained by ICE has grown significantly under the Biden administration, including those who have passed their initial asylum screenings, according to an analysis of government data by BuzzFeed News.The number of immigrants held in private prisons and local jails that sat partially empty during the pandemic has risen from 14,000 early this year to nearly 27,000 in June as key White House officials, including Vice President Kamala Harris, have publicly discouraged people from trying to cross the border. But within the administration, there is disagreement over whether ICE should be detaining people at the rate it has been.", "is_fake": 0},
{"date": "June 30, 2021", "title": "Blink-182's Mark Hoppus Shared An Update On Chemotherapy Treatment Following His Cancer Diagnosis", "text": "\"I have cancer,\" Mark wrote. \"It sucks and I m scared, and at the same time I m blessed with incredible doctors and family and friends to get me through this.\"\"I still have months of treatment ahead of me but I m trying to remain hopeful and positive,\" he continued. \"Can t wait to be cancer free and see you all at a concert in the near future.\"\"I feel much better than yesterday,\" Mark said, according to ", "is_fake": 0},
{"date": "June 29, 2021", "title": "The Supreme Court Will Keep The Federal Eviction Moratorium In Place While Legal Fights Go Forward", "text": "WASHINGTON — The federal moratorium on evictions will remain in effect after the US Supreme Court on Tuesday denied a request to abruptly end it. The order leaves intact — for now — a policy that renters nationwide have relied on to ease financial hardships caused by the coronavirus pandemic.The moratorium adopted by the Centers for Disease Control and Prevention was set to expire on June 30; near the end of the month, the CDC announced a . In a ", "is_fake": 0},
{"date": "June 29, 2021", "title": "The Doomsday-Obsessed Mom Charged With Killing Her Children Is Now Accused Of Conspiring To Kill Her Former Husband As Well", "text": "Lori Vallow, the Idaho mother accused of killing her two children, was indicted by a grand jury this week of conspiring with her brother to kill her estranged former husband, Charles Vallow.The indictment, unsealed Tuesday in Maricopa County, Arizona, is the latest in a series of killings believed to be perpetrated by the doomsday-obsessed mother and her new husband, Chad Daybell, shortly before the couple fled to Hawaii.The couple had already been charged in the killings of 8-year-old Joshua Vallow and 17-year-old Tylee Ryan, who were reported missing by relatives in 2019. The couple had told police the children were staying with friends in Arizona, but authorities would go on to find the remains of two children in Daybell s Idaho home.", "is_fake": 0},
{"date": "June 29, 2021", "title": "This Man’s Mother And Grandmother Remain Missing In The Surfside Building Collapse. He’s Grieving And Also Demanding Justice.", "text": "Elena Blasser and Elena Chavez smile with Pablo Rodriguez and his son, John.SURFSIDE, Florida — A water lover, Elena Blasser adored that her two-bedroom condo on the 11th floor of Champlain Towers South in Surfside, Florida, had views of both the ocean and the pool.But the thought of those views now haunts her son.", "is_fake": 0},
{"date": "June 30, 2021", "title": "Serena Williams Said She's \"Heartbroken\" After Retiring From A Match With Injury. Now Wimbledon Is Facing Backlash For Putting Players In Danger.", "text": "In moments that were difficult to watch, the 39-year-old was visibly overcome with emotion as she acknowledged the crowd who d tried to spur her on. After one last wave to fans, she limped off court, the question of whether she d ever be back left unanswered.She added: \"Feeling the extraordinary warmth and support of the crowd today when I walked on – and off – the court meant the world to me.\"After briefly attempting to resume play, Mannarino also retired.", "is_fake": 0},
{"date": "June 23, 2021", "title": "58 Great Books To Read This Summer, Recommended By Our Favorite Indie Booksellers", "text": "\"Max Barry has long been one of my favorite authors. He takes issues in society and tends to blow them up to ridiculous proportions. This is his take on the military-industrial complex. There s alien contact, a questionable AI, and ninja stars. What could possibly go wrong?\" —Melissa Taylor; E. Shaver, Booksellers (.)\"A subtle collection of essays that surprise with their supple brilliance. Oliver meditates on migration and its many forms, drifting from subjects like the Berlin Wall to underground cities, investigating history, displacement, and our own human nature.\" —Mark, Brazos Bookstore (", "is_fake": 0},
{"date": "June 23, 2021", "title": "John McAfee Was Found Dead In A Spanish Jail Hours After A Court Ruled He'd Be Extradited To The US", "text": "US millionaire John McAfee on his yacht anchored at the Marina Hemingway in Havana, on June 26, 2019John McAfee, the eccentric tech mogul who made his fortune developing antivirus software, was found dead in a jail cell near Barcelona on Wednesday, just hours after Spain’s National Court ruled that he was to be extradited to the United States to face tax evasion charges. He was 75.The news of his death was first ", "is_fake": 0},
{"date": "June 23, 2021", "title": "Britney Spears Asked A Judge To End The Conservatorship That Sparked The #FreeBritney Movement", "text": "Britney Spears arrives for the premiere of  in July 2019.LOS ANGELES — In an emotional and explosive court hearing, Britney Spears asked on Wednesday a judge to end her conservatorship, the legal arrangement that has put her father and a cast of lawyers in control of her life and sparked a movement among fans to #FreeBritney.", "is_fake": 0},
{"date": "June 23, 2021", "title": "A Member Of The Oath Keepers Who Stormed The Capitol Has Pleaded Guilty To Conspiring To Block Certification Of The Election", "text": "Graydon Young (center right, wearing a black helmet) inside the US Capitol’s rotunda on Jan. 6In a significant boost for federal prosecutors, a member of the Oath Keepers who helped the group push into the US Capitol on Jan. 6 has agreed to plead guilty to conspiracy charges and cooperate with the government’s ongoing investigation into the militant group’s activities during the insurrection.Graydon Young’s acknowledgment that he had conspired with other members of the Oath Keepers to impede or obstruct certification of the Electoral College by “intimidating and coercing government personnel” could help the prosecution make its case that the defendants had used covert communications to plan and coordinate their actions long before the insurrection. He is the first person charged with conspiracy to agree to plead guilty.", "is_fake": 0},
{"date": "June 23, 2021", "title": "A Scientist Tracked Down Chinese Coronavirus Sequences That Had Disappeared Online", "text": "Medical workers move the body of a person who had died from COVID-19 at a hospital in Wuhan, China, on Feb. 16, 2020.Thirteen genetic sequences — isolated from people with COVID-19 infections in the early days of the pandemic in China — were mysteriously deleted from an online database last year but have now been recovered.Jesse Bloom, a computational biologist and specialist in viral evolution at the Fred Hutchinson Cancer Research Center in Seattle, found that the sequences had been removed from an online database at the request of scientists in Wuhan, China. But with some internet sleuthing, he was able to recover copies of the data stored on Google Cloud.", "is_fake": 0},
{"date": "June 23, 2021", "title": "Here Are All The Shocking Things Britney Spears Revealed In Court", "text": "A portrait of Britney Spears looms over supporters outside a Los Angeles court hearing concerning the pop singer s conservatorship on June 23, 2021.After years of speculation about Britney Spears  well-being, #FreeBritney supporters and fans finally heard from the 39-year-old pop star herself on Wednesday when .", "is_fake": 0},
{"date": "June 23, 2021", "title": "The #FreeBritney Fans Were Right", "text": "#FreeBritney activists and supporters demonstrate at Los Angeles Grand Park during a conservatorship hearing for Britney Spears on June 23.LOS ANGELES — After following every twist and turn in Britney Spears  conservatorship for years, Tess Barker doubted the world would actually get to hear the pop star speak on Wednesday.For 13 years, Spears  father and a cast of lawyers had legally controlled her life, with a previous hearing featuring her remarks closed to the public and transcripts sealed. As Barker sat in a downtown Los Angles courtroom, she prepared for it to happen again when one of Spears  conservators asked the judge to shut it down.", "is_fake": 0},
{"date": "June 19, 2021", "title": "The Bidens' 13-Year-Old German Shepherd, Champ, Has Died", "text": "President Joe Biden s dog Champ, the family s \"loving companion\" of 13 years, died Saturday, the first family announced.\"He was our constant, cherished companion during the last 13 years and was adored by the entire Biden family,\" the president and first lady, Jill Biden, said in a statement.Champ was one of two dogs in the Biden White House. A German shepherd, he came from a breeder in 2008.", "is_fake": 0},
{"date": "June 18, 2021", "title": "The Guy Who Sat Behind Pelosi's Desk In The Capitol Riot Can't Travel To A Car Show, A Judge Ruled", "text": "Richard Barnett sits inside the office of House Speaker Nancy Pelosi during the Jan. 6 Capitol riot.An Arkansas man photographed sitting behind a desk in the office of Speaker of the House Nancy Pelosi after he and other Donald Trump supporters stormed the Capitol on Jan. 6 will not be permitted to travel to an upcoming car show, a federal judge ruled Friday.Richard Barnett, one of the highest-profile Capitol insurrectionists, thanks to the viral photos of him behind the desk, is currently under home confinement after being ", "is_fake": 0},
{"date": "June 18, 2021", "title": "This Guy Had To Spend 24 Hours At A Waffle House After Losing His Fantasy Football League", "text": "The Waffle House where Lee Sanderlin served his punishmentLee Sanderlin is a loser. A fantasy football loser, to be exact. And in Sanderlin s fantasy football league, losers are not let off easy.So, on Thursday afternoon, Sanderlin, a journalist at the Clarion Ledger, reported to a Waffle House in Brandon, Mississippi, where he was to spend 24 hours as punishment for losing. For each waffle he ate, he could take off one hour from his remaining time.", "is_fake": 0},
{"date": "June 18, 2021", "title": "A British Newspaper Deleted A Critical Column About Kate Middleton", "text": "Amid continued scrutiny of how the , the Telegraph newspaper deleted a  about Catherine, the Duchess of Cambridge, on Thursday hours after it went up on the website.", "is_fake": 0},
{"date": "June 18, 2021", "title": "These Republicans Voted Against Juneteenth. They Still Closed Their Offices On Friday.", "text": "Rep. Paul Gosar of Arizona on Tuesday.WASHINGTON — Eight Republican members of the House of Representatives who voted against making  appeared to give their staff Friday off anyway.", "is_fake": 0},
{"date": "June 19, 2021", "title": "Photos Of How People Celebrated Juneteenth 100 Years Ago", "text": "Emancipation Day Celebration band, June 19, 1900On Thursday, President Joe Biden signed a bill designating June 19, also known as Juneteenth, as . Black communities in different parts of the country have recognized Juneteenth for a long time, but more recently it has turned into a national reckoning.", "is_fake": 0},
{"date": "June 19, 2021", "title": "9 Photo Stories That Will Challenge Your View Of The World", "text": "This week, 156 years after the end of the Civil War, Congress voted to recognize Juneteenth as a federal holiday. We took a look back at how the 19th of June has been celebrated in Black communities as the end of slavery for generations and has only recently become widely recognized. Along similar lines, NPR has an insightful piece about how Native identity is being reexamined, 400 years after Europeans arrived in North America.In lighter history, we took a look at how the music scene in the 1980s in New York was a bastion of idea-trading and creativity. Hyperallergic s story on  disco photos is a delight and an inspiration for how the future should look, while CNN counts off at all of the many presidents that the Queen has met in her lifetime, which is low-key mind-blowing. If you have ever wondered about how the fashion industry operates, you can t miss the FeatureShoot story on the leather industry, even if it is hard to take in.", "is_fake": 0},
{"date": "June 19, 2021", "title": "A Man In A Pickup Truck Hit Several Cyclists At A Bike Race And Drove Away Before Being Shot By Police", "text": "A 35-year-old man injured multiple people at a bike race in Arizona on Saturday after striking them with a pickup truck and fleeing before being shot by police.According to the Show Low Police Department, a man in a Super Duty Ford truck hit several bicyclists at Bike the Bluff, an annual event, then drove away. Police shot the driver while attempting to stop him, the department .", "is_fake": 0},
{"date": "June 19, 2021", "title": "How Americans Across The Country Celebrated Juneteenth This Year As A National Holiday For The First Time", "text": "A young girl waves an African American flag during the Broadway Celebrates Juneteenth in Times Square on June 19 in New York City.After years of campaigning for Juneteenth to be recognized as a national holiday,  was officially signed into law by President Joe Biden on Thursday. The holiday honors June 19, 1865, the day in history when Black people in Galveston, Texas, were told they were no longer enslaved, more than two years after President Abraham Lincoln issued the Emancipation Proclamation.", "is_fake": 0},
{"date": "June 19, 2021", "title": "A Truck Drove Into A Pride Parade Near Fort Lauderdale, Killing One Person", "text": "One person was killed and another injured after a 77-year-old man participating in an LGBTQ Pride parade drove into other participants near Fort Lauderdale, Florida, on Saturday night, officials said.The incident occurred at the city of Wilton Manors  Stonewall Pride Parade, where several Democratic politicians were in attendance.The exact cause of the crash remained under investigation on Sunday, but the Fort Lauderdale Gay Men s Chorus described it as an accident. The driver is a member of the group, along with the victims, police said.", "is_fake": 0},
{"date": "June 21, 2021", "title": "The NCAA Lost A Major Supreme Court Case Over How Student-Athletes Are Compensated", "text": "Jonathan Tchamwa Tchatchoua of the Baylor Bears dunks against the Gonzaga Bulldogs in the National Championship game of the 2021 NCAA Men s Basketball Tournament on April 5 in Indianapolis.The NCAA on Monday lost a major Supreme Court fight over how student-athletes are compensated for playing games that make their schools, and the organization, billions of dollars per year.The decision doesn’t mean that NCAA athletes will start drawing salaries for playing, nor will it affect the ongoing battle over whether players can profit off of their own names or likenesses. But it will mean that schools can do a lot more to attract and compensate students who play NCAA Division One basketball and football. Though the decision is narrow, it’s a significant step for advocates who have pushed to compensate NCAA student-athletes.", "is_fake": 0},
{"date": "June 20, 2021", "title": "He Almost Lost His Father To COVID. This Photographer Documented Every Minute.", "text": "The coronavirus pandemic has changed how many of us see our families. Some of us have lost relatives unexpectedly and have had to deal with the particular grief and difficulty of not seeing them one last time. Some of us have become closer to our families as the pandemic pushed us under one roof, while others feel the absence more keenly because they have been living far away from their relatives. For , a Dominican American photographer from New York, photographs have become a lifeline during this strange and devastating time.When the pandemic first hit, Rodriguez’s father became incredibly sick. Rodriguez documented what that period was like for his family and how it changed his relationship with his father in a poignant continuation of a long-term project. “I began taking photos of my father during my college years. I d come home for winter and summer break and follow him around,” he explained. Around this time in 2013, Rodriguez was far from home most of the year at the Savannah College of Art and Design and experiencing the entirely different culture of the American South.", "is_fake": 0},
{"date": "June 20, 2021", "title": "Nine Children And An Adult Were Killed In A Fiery 15-Car Crash In Alabama", "text": "A flooded neighborhood after tropical storm Claudette passed through in Slidell, Louisiana.A multivehicle crash in Alabama left 10 people dead Saturday, including 8 children traveling together in a foster home s bus as tropical depression Claudette tore through the South.The crash was the result of a vehicle hydroplaning on a bridge on Interstate 65, causing a chain reaction that involved at least 15 vehicles, said the Butler County coroner in a statement ", "is_fake": 0},
{"date": "June 21, 2021", "title": "Kendall Jenner Responded To Accusations Her Modeling Career Was Handed To Her Because Of Her Fame", "text": "Speaking about her career, the 25-year-old said her interest in modeling began when she first got a camera and began taking photos of herself and her friends.\"It was like — I know it s kind of corny to say — but almost like destiny,\" she said. \"I think that was what was pushing me that direction.\"\"I presented the cutest little modeling book to my mom when I was, like, 14,\" Kendall recalled. \"And then she did her Kris Jenner thing and made it all come to life.\"", "is_fake": 0},
{"date": "June 21, 2021", "title": "What's The Point Of Comedy Right Now?", "text": "Ava (Hannah Einbinder) stands in front of a wax figure of Deborah Vance (Jean Smart).By the end of the fifth episode of  — considered by a ", "is_fake": 0},
{"date": "June 21, 2021", "title": "Khloé Kardashian Said She's Had A Nose Job After She Was Asked About Comments That She's \"Had Her Third Face Transplant\"", "text": "She added: \"I ve done, sure, injections. Not really Botox. I ve responded horribly to Botox.\"\"When the show first started, I was very secure. Very secure,\" she said. \"And then, during the first couple seasons, I became insecure because of the public opinions of myself.\"The Good American founder continued that, although she d had bouts of confidence since then, she d recently started to feel more insecure. She finished: \"I guess it just goes, you know, up and down.\"", "is_fake": 0},
{"date": "June 15, 2021", "title": "The Shake Shack Manager Falsely Accused Of Poisoning Cops' Milkshakes Is Suing The Police Union", "text": "A Shake Shack location in ManhattanThe manager of a lower Manhattan Shake Shack location is suing two police unions after  last summer, leading to him being arrested, interrogated, and \"taunted\" by police for several hours, he claims.", "is_fake": 0},
{"date": "June 15, 2021", "title": "A Man Got Into An Argument With A Store Cashier About Wearing A Mask, Then Allegedly Shot And Killed Her", "text": "A man shot and killed a supermarket cashier in Georgia on Monday after arguing with her about wearing a mask, authorities said, before shooting an off-duty law enforcement officer who tried to intervene.The cashier, identified by DeKalb County Police as 41-year-old Laquitta Willis, was pronounced dead at Grady Memorial Hospital.The suspect, Victor Lee Tucker Jr., 30, got into a dispute with Willis about a face mask while checking out at the Big Bear Supermarket in Decatur on Monday afternoon, authorities said. He then left the store, came back inside, and walked up to Willis before pulling out a handgun and shooting her, the Georgia Bureau of Investigation ", "is_fake": 0},
{"date": "June 15, 2021", "title": "A Colorado School Shooter Was Convicted Of Murder In The Killing Of His Classmate", "text": "The older of two suspects in the STEM School shooting in a Denver-area suburb that killed one student and injured eight others was convicted Tuesday of first-degree murder and dozens of other charges.A Douglas County jury found Devon Erickson, 20, guilty of all 46 counts he was charged with following several hours of deliberation and a three-week trial that featured testimony from dozens of witnesses, including his accomplice, Alec McKinney, who is  after pleading guilty to first-degree murder and other charges last year.", "is_fake": 0},
{"date": "June 15, 2021", "title": "These Young Asian Americans Felt Helpless, So They Turned to Online Activism", "text": "Growing up, Erin Suh, a 20-year-old Korean American from Manhattan, remembers stressing about whether she was smart and quiet enough to fit into the “model minority” stereotypes she thought were expected of her.Jadenne Radoc Cabahug, an 18-year-old Filipino American from Southern California, remembers wishing she were white.Arin Siriamonthep, an 18-year-old Thai American from Greenvale, New York, remembers believing that the best way to deal with racist slurs or taunts was to “just let it go because there’s no need to cause some sort of argument.”", "is_fake": 0},
{"date": "June 15, 2021", "title": "Biden Is Expanding A Program To Allow More Young Central Americans To Apply To Get Into The US From Their Home Countries", "text": "Asylum-seeking immigrants get sanctuary where they get a place to sleep and eat in Tijuana, Mexico, in 2019.President Joe Biden is expanding a program that allows certain Central American children to seek entry into the US from their home country, officials announced Tuesday.The Central American Minors program, which started during the Obama administration and was later scrapped by former president Donald Trump, allowed parents who were from El Salvador, Guatemala, and Honduras — and who had legal status in the US — to apply for their children to also be allowed in.", "is_fake": 0},
{"date": "June 15, 2021", "title": "Trump Wanted The Justice Department To Copy Texas's Failed Election Case But Add More Conspiracy Theories", "text": "WASHINGTON — Former president Donald Trump pushed the Justice Department last year to bring an election challenge in the US Supreme Court that largely copied Texas’s failed case word for word while amping up the conspiracy theories.House Democrats on Tuesday released a  revealing how senior Trump administration officials urged DOJ to intervene in postelection legal fights on Trump’s behalf. The collection included a draft lawsuit that Trump wanted the Justice Department to file in the Supreme Court challenging President Joe Biden’s wins in Pennsylvania, Georgia, Michigan, Arizona, Nevada, and Wisconsin.", "is_fake": 0},
{"date": "June 15, 2021", "title": "TikTok Is Replacing YouTube As The Title Sponsor Of VidCon This Year", "text": "TikTok announced on Tuesday it has signed on as the lead sponsor of VidCon for 2021, replacing YouTube, which had been in the role and synonymous with the social media conference since 2013.YouTube will stay involved with VidCon this year \"through new and different opportunities,\" a spokesperson told BuzzFeed News. They said the company will be announcing that \"involvement shortly.\"According to a press release provided by TikTok, the company said that \"the deal strengthens TikTok’s commitment to the creator community, leveraging VidCon’s core audience of creators, fans, and industry partners as they gather together at the annual event, which serves as the epicenter of the digital world.\"", "is_fake": 0},
{"date": "June 16, 2021", "title": "Travis Scott Said He Loves \"Wifey\" Kylie Jenner As They Made Their First Public Appearance Since Rumors Claimed They're Back Together", "text": "Other  reported that the rapper said:\"Wifey, I love you so much.\"The couple were said to have broken up in October of that year. However, they remained close, often celebrating holidays together and reportedly quarantining as a family.", "is_fake": 0},
{"date": "June 16, 2021", "title": "Reese Witherspoon Said She Was So Scared To Film \"Wild\" She Had Panic Attacks And Had To Have Hypnosis", "text": "Elaborating on why she was so nervous to begin filming, Reese mentioned \"the nudity, sexuality, and drug-use aspect, but also being alone on camera with no other actors.\"\"I hadn t ever been alone in scenes for days and days,\" Reese explained. \"There were probably 25 days of the shoot where I had no other actor opposite me. It was just me and a camera and a backpack. I was like,  Is this going to be so boring? \"\"Itspoke to me so deeply about how we as women have to save ourselves,\" Reese said. \"I thought it was radical that at the end of the film, she ends up with no family, no money, no job, no partner, and she s happy.\"", "is_fake": 0},
{"date": "June 16, 2021", "title": "Why Bo Burnham, Jenna Marbles, And Shane Dawson All Logged Off", "text": " Bo Burnham’s latest special, , as a “comedy,” which is outrageous because it’s clearly the horror movie of the year. I don’t know whether anything has scared me as much recently as watching all 90 minutes; it felt like peering into my own rotting core, my hand wrapped around a phone with every single social media app open.  has been ", "is_fake": 0},
{"date": "June 16, 2021", "title": "The Nigerian Government Banned Its Citizens From Using Twitter, And The Consequences Are Steep", "text": "On the morning of June 5, 23-year-old Farida Garba* opened her Twitter app to discover that she, like  Twitter users, was unable to access the platform.“Tweets were no longer loading, and it took me an hour to figure 0ut what had happened,” Garba* — who opted to use this pseudonym for her personal safety — told BuzzFeed News.", "is_fake": 0},
{"date": "June 16, 2021", "title": "An Influencer Was Mistaken To Be Anti-Vax When She Responded \"No I'm 23\" To A Question And Now It's Become A Meme", "text": "No I’m 23✌️An influencer and former  cast member is being trolled for responding \"No I m 23 ✌️\" to being asked if she was vaccinated.", "is_fake": 0},
{"date": "June 16, 2021", "title": "The Biden–Putin Summit Ended Without Major Breakthroughs — And The Russian Leader Relishing The Spotlight", "text": "While no major breakthroughs were announced following the highly anticipated summit between the presidents of the US and Russia in Switzerland on Wednesday, there was one clear winner to emerge from it: Vladimir Putin.“In the very first minute of the meeting, [President Joe] Biden granted him a gift,” Andrei Soldatov, a Russian journalist and coauthor of several books on Russia, told BuzzFeed News from London. “[Biden] said Russia and the United States are ‘two great powers.’”It certainly wasn’t the fawning praise that Donald Trump offered of Putin during their disastrous 2018 summit in Helsinki that had one top White House adviser ", "is_fake": 0},
{"date": "June 16, 2021", "title": "Are You A Disney Adult?", "text": "Are you someone who has no shame about your love for the House of Mouse? Have you visited the theme parks a bajillion times? Have you dressed up as any one of the legion of iconic animated characters and superheroes who have come to represent the ubiquitous entertainment brand?If so, I’d like to hear from you. I’m looking to speak to people who truly live and breathe all things Disney. Please , and I may be in touch for a follow-up interview.●", "is_fake": 0},
{"date": "June 16, 2021", "title": "Korean American Rapper Jay Park Addressed Accusations Of Cultural Appropriation After Covering Kendrick Lamar's \"DNA\"", "text": "Korean American rapper Jay Park posted a music video for his remix of Kendrick Lamar s 2017 hit \"DNA\" on Monday, featuring several South Korea–based artists rapping about being proud to be South Korean.But people said it missed the mark and called Park out for cultural appropriation, pointing out some of the rappers had Afros, braids, and dreadlocks. It didn t match up with the lyrics of the song, some people said.\"So DNA remix is about being proud Koreans...yet they re cosplaying as Black American people and are using Black American culture constantly...interesting,\" one person ", "is_fake": 0},
{"date": "June 16, 2021", "title": "The US Can Again Grant Asylum To Domestic Violence Survivors After The Attorney General Tossed Out A Trump Administration Decision", "text": "An immigrant family crosses the border into El Paso, Texas, in Ciudad Juarez, Mexico.The Justice Department on Wednesday threw out a decision by former attorney general Jeff Sessions that made it virtually impossible for immigrants to win asylum because they were fleeing domestic violence in their home countries.The decision was celebrated by immigrant advocates and attorneys across the US, who had often lamented the extremely limited access to asylum that Sessions had instituted through the case.", "is_fake": 0},
{"date": "June 15, 2021", "title": "Gigi Hadid Reflected On Being Made To Feel \"Too White\" To Stand Up For Her Arab Heritage", "text": "\"It s something that s really important to us,\" Gigi said. \"But it s also something that we first experienced ourselves, because both of our parents are their own heritage.\"\"We are that first generation of those mixed races, and then that comes with that first generational experience of being like,  Oh damn, I m the bridge! \" she went on. \"That s not something that my parents experienced or that they can really help me through.\"Gigi s mother, Yolanda Hadid, is Dutch, while her father, Mohamed, is Palestinian. Meanwhile, Zayn s mother is English and Irish and his father is British Pakistani.", "is_fake": 0},
{"date": "June 15, 2021", "title": "An Executive Producer For \"Keeping Up With The Kardashians\" Revealed Why Kendall And Kylie Didn't Appear As Much In The Show As They Got Older", "text": "\"Kendall s always had this rule, which she felt like she had to be with someone for at least a year before she lets them be a part of the show and in the show,\" Farnaz said. \"Because she doesn t always know what people s intentions are. So that s why we kind of kept her personal life out of it, just because she had a rule.\"\"I feel like Kylie became more participatory this last season towards the end, and Kendall has dipped in and out,\" she said. \"But they were at an age...like, if you think about when you re a young adult coming into your adulthood, I think you sometimes care a lot more what the outside world has to say about you.\"She added: \"Kylie did share her relationship withTyga. We showed their relationship quite a bit on", "is_fake": 0},
{"date": "June 15, 2021", "title": "Biden Wants To Beef Up His Ranks Of Prosecutors, Analysts, And Agents To Combat Domestic Terrorism", "text": "The White House on Tuesday released its much-anticipated plan for countering domestic terrorism, what President Joe Biden has called the most urgent threat the United States faces today and a “.”, outlined in a first-of-its-kind strategy report, calls for increasing information sharing with law enforcement agencies and the technology sector; growing the ranks of government analysts, investigators, and prosecutors needed to combat domestic terrorism; and improving employee screening to enhance methods for identifying extremists who might pose insider threats. It also says the government will look more closely at whether foreign extremist entities linked to domestic terrorism can be designated as Foreign Terrorist Organizations and consider ways in which it can stop groups from financing one another’s activities.", "is_fake": 0},
{"date": "June 15, 2021", "title": "This Teen Makes Bonnets With Pockets And Her Creation Has Gone Viral", "text": "Ariel Williams, a 19-year-old from Indianapolis, went viral after a friend of hers posted a video of her ingenious creation: a bonnet with a pocket.Williams told BuzzFeed News she has been selling the bonnets for two years. It started when she came up with the idea of putting a pouch on a hair bonnet to store small items.Williams said she researched and couldn t find anyone who had done this before. So she decided to begin making them.", "is_fake": 0},
{"date": "June 16, 2021", "title": "Three Police Officers Have Been Charged In The Fatal Shooting Of A 16-Year-Old Boy", "text": "A stuffed bear sits with other tributes at a street memorial where police shot and killed 16-year-old Iremamber Sykap.Three Honolulu police officers have been charged in the fatal shooting of a 16-year-old boy after body camera footage contradicted their account of what happened, prosecutors said.Officer Geoffrey Thom, 42, a five-year veteran of the Honolulu Police Department, was charged Tuesday with one count of second-degree murder, while officers Zackary Ah Nee, 26, and Christopher Fredeluces, 40, who have been on the job for three and ten years, respectively, were charged with one count each of second-degree attempted murder, according to documents released by the Honolulu Prosecuting Attorney s office.", "is_fake": 0},
{"date": "June 16, 2021", "title": "The Woman Who Went Viral After Putting Gorilla Glue In Her Hair Is Launching A Haircare Brand", "text": "Tessica Brown, the woman who went viral after applying  adhesive spray to her hair, has announced a new venture: a haircare line. She will take inspiration from her hair woes, which made her famous in February.In her announcement on Instagram, Brown revisited her viral moment before launching her pitch for an $18 growth-stimulating hair oil. She shared that she had been working on the line for months.", "is_fake": 0},
{"date": "June 16, 2021", "title": "Juneteenth Is Officially A National Holiday. Just Don’t Talk About The Legacy Of Slavery.", "text": "In this June 19, 2020 photo, protesters chant as they march after a Juneteenth rally at the Brooklyn Museum.Congress on Wednesday passed a bill recognizing  as a federal holiday, even as a cultural war rages over conservative states’ efforts to ban school lessons around how the country’s history of slavery is integral to understanding systemic racism in the US today.", "is_fake": 0},
{"date": "June 17, 2021", "title": "Paris Jackson And Willow Smith Opened Up About Their Paranoia As A Result Of Growing Up In The Public Eye", "text": "\"I ve been going to therapy for a lot of things, but that included,\" Paris explained. \"I ll hear, like, a trash bag rustling, and I ll flinch and panic.\"\"It s just standard PTSD,\" she added.\"It s primarily if I m out in public during the day,\" she said. \"I don t really go out during the day.\"", "is_fake": 0},
{"date": "June 17, 2021", "title": "7 New TV Shows You'll Binge", "text": "The stars of “I’m gonna kill my sister! She stole my eyeliner! It’s an honor killing, it’s an honor killing,” sings Saira (Sarah Kameela Impey) early on in this half-hour British comedy created by Nida Manzoor about an all-girl, all-Muslim punk rock band. Saira fronts the band Lady Parts, and she’s on the hunt for a lead guitarist. The other bandmates are bassist Bisma (Faith Omole), a Black vegan mom who draws violent comics about periods; drummer Ayesha (Juliette Motamed), who moonlights as an Uber driver; and manager Momtaz (Lucie Shorthouse), who wears a niqab and is fond of smoking marijuana. They’re not so sure a lead guitarist is necessary. But Saira is convinced that Amina (Anjana Vasan), a 26-year-old grad student who secretly shreds on guitar but refuses to perform because she has a “nervy disposition which induces diarrhea and vomiting,” might just be their new star. Both sweet and hilarious,  is an irreverent look at a community that doesn’t get enough screen time. ", "is_fake": 0},
{"date": "June 17, 2021", "title": "There Are No Laws Restricting “Stingray” Use. This New Bill Would Help.", "text": "Democrats Sen. Ron Wyden of Oregon and Rep. Ted Lieu of California are introducing a bill on Thursday that would restrict the use of “stingray” cell site simulators, powerful surveillance devices capable of intercepting  and determining their current location.Dubbed the Cell-Site Simulator Warrant Act of 2021, the bill would require law enforcement agencies to get a warrant ", "is_fake": 0},
{"date": "June 17, 2021", "title": "Regé-Jean Page Hilariously Revealed How \"Overwhelmed\" His Family Were By His Sex Scenes In \"Bridgerton\"", "text": "\"I think people were grateful for the intensity of the romantic aspects of ; I m not sure how grateful I was to watch it for myself,\" he continued. \"It was overwhelming. But I think people were looking to be overwhelmed.\"\"My family doesn t want to be overwhelmed by my backside, specifically, too often,\" he said, \"But they’ll take it on this occasion because everyone seems to be terribly happy.\"", "is_fake": 0},
{"date": "June 17, 2021", "title": "Struggling Hospitals Could Explain Why So Many Black Patients Have Died Of COVID-19", "text": "Brady Bishop recovers from COVID-19 at Roseland Community Hospital in Chicago, Dec. 17, 2020.Of the more than 600,000 Americans who have died of COVID-19, . Growing research suggests that a key to understanding why lies in examining where many of them spent their final days: in the hospital.", "is_fake": 0},
{"date": "June 17, 2021", "title": "The Supreme Court Ruled Against LGBTQ Families In A Big Religious Freedom Case", "text": "WASHINGTON — The US Supreme Court ruled Thursday that the city of Philadelphia violated the First Amendment when it refused to work with a Catholic social services agency that wouldn’t place foster kids with same-sex couples.In a unanimous  written by Chief Justice John Roberts Jr., the court found that Philadelphia had placed too great a burden on Catholic Social Services’ religious exercise rights by forcing the agency to choose between maintaining its contract with the city or certifying same-sex couples as foster parents against its religious beliefs.", "is_fake": 0},
{"date": "June 17, 2021", "title": "The UK's Advertising Regulator Is Naming And Shaming Influencers Who They Say Keep Breaking The Rules", "text": "The UK regulator for advertising has launched a new initiative in a move to make influencers more transparent about what they are paid to promote on their social media.The Advertising Standard Authority (ASA) announced that its website would now host a permanent page dedicated to naming and shaming influencers who they say have repeatedly breached their guidelines.For its launch, the organization named Chloe Ferry, Chloe Khan, Jodie Marsh, and Lucy Mecklenburgh for “routinely failing to clearly disclose when they are advertising to consumers.”", "is_fake": 0},
{"date": "June 17, 2021", "title": "A Man Has Been Charged With Murder After Driving Through Protesters In Minneapolis", "text": "A Minnesota man has been charged with intentional second-degree murder after driving while drunk into a group of people protesting police brutality, according to a  filed Wednesday.Nicholas David Kraus, 35, purposefully accelerated into a barricade that was blocking off the street where the protesters were gathered Sunday night to protest the death of Winston Smith, a Black man ", "is_fake": 0},
{"date": "June 17, 2021", "title": "This Louisiana Town Is A Bleak Forecast Of America's Future Climate Crisis", "text": " know she was saying goodbye to her father last August when an ambulance took him away from her sweltering, hurricane-battered home near Lake Charles, Louisiana. The 72-year-old died alone after medics rushed him from a hospital to nursing homes, trying to find a facility that still had power after Hurricane Laura hit. But Boudreaux’s grief didn’t end there: It took her family another seven months to finally bury her father, as one disaster after another pummeled the riverbank city where she grew up.With its 150-mile-per-hour sustained winds, Laura was the . Then, in October, ", "is_fake": 0},
{"date": "June 17, 2021", "title": "A Second Alleged Capitol Rioter Is Charged With Carrying A Gun That Day", "text": "Still image from video that prosecutors say shows Guy Reffitt on steps in front of the Capitol on Jan. 6, 2021.WASHINGTON — A Texas man this week became the second person charged with carrying a handgun onto the grounds of the US Capitol during the riots on Jan. 6.Guy Reffitt of Wylie, Texas, is charged with traveling to Washington, DC, with a rifle and a handgun to support “civil disorder” and with carrying the semiautomatic handgun onto the Capitol grounds. Both are felony crimes, carrying up to five and 10 years in prison, respectively. Reffitt was originally arrested in mid-January and charged with obstructing Congress, illegally being on Capitol grounds, and threatening witnesses; the latest ", "is_fake": 0},
{"date": "June 17, 2021", "title": "The Couple Who Pointed Guns At Protesters In Front Of Their Mansion Pleaded Guilty To Misdemeanor Charges", "text": "Mark and Patricia McCloskey leave following a court hearing Wednesday, Oct. 14, 2020, in St. Louis.Mark and Patricia McCloskey, the white St. Louis couple who were seen waving guns at Black Lives Matter protesters outside their home, pleaded guilty Thursday to misdemeanor charges.The couple, who are attorneys and have used last year s viral moment to launch themselves into the national political spotlight, were initially facing felony charges. On May 17, however, a judge appointed a special prosecutor to the case. Then, on Thursday, the couple pleaded to the lesser charges as part of a plea agreement, Mark McCloskey confirmed in a statement to BuzzFeed News.", "is_fake": 0},
{"date": "June 17, 2021", "title": "The Supreme Court Saved Obamacare Again By Throwing Out A Republican Lawsuit", "text": "Security is tight around the US Supreme Court in Washington, DC, March 4.The Supreme Court saved the Affordable Care Act yet again on Thursday, tossing out a Republican lawsuit that sought to overturn former president Barack Obama’s signature legislation.The 7–2 decision brought together the court’s liberal wing and several of its more conservative members, including the two newest justices confirmed under former president Donald Trump, Justices Amy Coney Barrett and Brett Kavanaugh.", "is_fake": 0},
{"date": "June 17, 2021", "title": "Extremely Fun Photos From The 1980s Music Scene In New York", "text": "DJ Larry Levan at Paradise Garage, 1979 \"The early ’80s are actually a really interesting time for music in New York because of what had already happened in the ’70s, music-wise. The city was coming out of a fiscal crisis, so it was stable, but it was pre-gentrification. It was affordable for artists to live in the city. And it was pretty wide open in terms of a lot of clubs being open at the time.", "is_fake": 0},
{"date": "June 17, 2021", "title": "Snapchat Removed Its Controversial Speed Filter That Was Linked To Fatal Car Crashes", "text": "Snapchat has begun removing its \"speed filter\" feature after it was blamed for encouraging dangerous speeding by safety advocates and families of car crash victims.It s not clear when Snap Inc. made the decision to remove the feature that records speed in real time, but NPR  the news on Thursday.", "is_fake": 0},
{"date": "June 17, 2021", "title": "A 14-Year-Old With Down Syndrome Was Cut Out Of Her Cheerleading Yearbook Photo", "text": "So @shorelinejrhigh has a young woman with Down syndrome on the cheer squad. They took a team photo with her in it. Sent her away. Then took another photo to use for their publicity. Take a look. Same photo shoot. Same time. Entirely deliberate.The two photos of Utah’s Shoreline Junior High cheerleading team were nearly identical — a group of girls in blue-and-white uniforms, matching pom-poms in hand, all smiling at the camera.But there is a crucial difference between the images, and it has sparked widespread backlash in the school community and online: In one of the photos, the team manager, a 14-year-old with Down syndrome, is included. In the other photo — the one that made it into the yearbook — she is not.", "is_fake": 0},
{"date": "June 18, 2021", "title": "Kylie Jenner Explained Why She Didn't Talk About Her Pregnancy At The Time", "text": "\"This is obviously a theory — I ve never been pregnant, and I m sure there s studies on this — but I think that the more at peace you are when you are pregnant, that goes into your child,\" Kendall said. \"I think it s a reflection of even her daughter today, and how amazing and beautiful she is, is just because Kylie was so at peace in her pregnancy. I really do think it was the best decision.\"\"There were times when we would be driving and pregnant, and paparazzi would almost crash into our cars because they just wanted a picture,\" Kim said. \"Kylie really wanted to, I think, protect her safety, the baby, and have that just be a private moment.\"\"I stayed in my house and around my neighborhood,\" she revealed. \"Then, towards the end, there would be helicopters every day — I couldn t even go outside because they d be shooting all my deliveries.\"", "is_fake": 0},
{"date": "June 21, 2021", "title": "Here’s A Timeline Of How Britney Spears Got To This Point In Her Conservatorship", "text": ", Britney Spears’ life has been completely controlled by her father and a cast of lawyers after a public mental health crisis that was gleefully documented by the paparazzi. Placed in a rare court-appointed conservatorship, the pop star lost power over her vast fortune and business dealings, a move her father, Jamie Spears, and others argued was necessary to protect her from grifters and other potential pitfalls while she focused on her health.Since then, Spears has largely stayed silent, even as her fans have grown more restless over a legal situation they think has entrapped a beloved star and enriched her conservators. But on June 23, , saying, \"I just want my life back.\"", "is_fake": 0},
{"date": "June 18, 2021", "title": "What Would You Do If Your Best Friend Told You They're Starting A Cult?", "text": "   ", "is_fake": 0},
{"date": "June 18, 2021", "title": "\"The Atmospherians\" Is The BuzzFeed Book Club July Pick. Enter For A Chance To Win A Signed Copy And Swag Bag.", "text": "In the slightly off-kilter universe of the novel, Sasha Marcus, founder of a beloved women s wellness brand, is dealing with the aftermath of a dark scandal: After one of her trolls livestreams his suicide and blames her for it, she becomes the subject of op-eds and death threats, while crowds of angry men station themselves outside of her apartment. She’s lost her job, friends, followers, and all hope, until her eccentric childhood friend Dyson shows up with a once-in-a-lifetime opportunity: Together, they re going to start a cult. It s a brilliant send-up of a society run ragged by disingenuous influencers, toxic masculinity, commodified self-care, weaponized positivity, and performative \"wokeness.”", "is_fake": 0},
{"date": "June 17, 2021", "title": "And Just Like That, Tati Westbrook Is Back On YouTube", "text": "Makeup YouTube veteran Tati Westbrook is back on the platform following a cascade of drama and legal matters over the last year.With a video aptly titled  Westbrook announced she will be getting \"back to the makeup\" and \"back to the reviews.\" However, she spent the majority of the video addressing the myriad issues that led her to sign off for a year and \"work on myself,\" as she put it.", "is_fake": 0},
{"date": "June 18, 2021", "title": "What VidCon Could Become If TikTok Continues To Take It Over", "text": " Please Like Me TikTok ", "is_fake": 0},
{"date": "June 18, 2021", "title": "Demi Lovato Opened Up About How Their Friends And Family Are Adjusting To Their New Pronouns", "text": "\"I ve used this time to really explore what feels right to me,\" Demi explained. \"And after a year and a half of exploration, I realized it was time to let the world know.\"It feels weird to me when I get called a  she  or a  her, \" they went on. \"I understand that people might have a hard time adjusting to it, because it is something new, but I want to encourage people to keep trying. I understand that it s a process to get used to. Sometimes I still mess up myself, but it s OK.\"Demi added, \"I m still, every day, stepping more and more into the identity that feels right to me. Which is my pronouns being  they / them. \"", "is_fake": 0},
{"date": "June 21, 2021", "title": "Why Everyone Started Juuling", "text": " and fall of 2015, Juul marketers traveled up and down the East and West Coasts, handing out tens of thousands of free samples at parties hosted in a pop-up Juul Vapor Lounge. Some of the lounges were built inside a twenty-by-eight-foot steel shipping container finished in gleaming white paint, decorated with the brand’s fluorescent-colored geometric patterns, and topped off with pink lounge furniture and a bar with brightly lit jewel boxes displaying the nicotine gadgets. After guests were handed a free Juul kit, they were invited to step in front of the Bosco animated “GIF booth” to have their pictures snapped and turned into silly moving videos designed to go viral on social media with an assortment of hashtags—#juulmoment. #juullife. #juulpod. #juulvapor.As the sampling tour descended on yachts, raves, art shows, movie screenings, and wine tastings, Juul easily distributed hundreds of thousands of Juul pods. Company documents showed that the so-called Container Tour was expected to “get JUUL into the hands of over 12,500 influencers subsequently introducing JUUL to over 1.5M people.” Additionally, the marketing crew was encouraged to sign up people with their email addresses to help them spread brand awareness and to make them more likely to enlist in Juul’s “auto-ship” program that delivered the product straight to the person’s doorstep without their lifting a finger.Juul was following a well-worn formula that had come to define new tech start-ups. Rather than plow a bunch of money into a traditional, expensive Madison Avenue ad campaign on television and radio, it had become more effective to deploy the boundless reach of social media with the help of influencers. So-called user-generated content, which relied on real people posting about the product on Twitter or Instagram, had become the go-to tactic for start-ups to give a brand an air of authenticity and generate an x-factor that money couldn’t buy. It had been done masterfully by insurgent brands. Juul’s chief marketing officer, Richard Mumby, had previously worked at Bonobos, an upstart men’s apparel brand that ran contests like the #Pantsformation challenge that had customers upload photos of themselves on Instagram for a chance to win a trip to New York City. Warby Parker, the trendy eyewear start-up, used #warbyparkerhometryon as a way to get people to share photos of themselves sporting the brand’s eyewear.", "is_fake": 0},
{"date": "June 21, 2021", "title": "Eight Climate Change Demonstrators Were Arrested After They Protested On Ted Cruz's Lawn", "text": "Sen. Ted CruzHouston police on Monday arrested eight people for trespassing at Texas Sen. Ted Cruz s residence while  amid the state s ongoing power crisis.", "is_fake": 0},
{"date": "June 21, 2021", "title": "Trump Can’t Be Sued Over The Violent Clearing Of Lafayette Square Last Summer, A Judge Ruled", "text": "WASHINGTON — Donald Trump and a cadre of current and former federal officials can’t be sued over the violent clearing of peaceful protesters from a park in Washington, DC, last summer shortly before , a federal judge ruled Monday.Black Lives Matter DC and individual protesters who were forcibly removed from Lafayette Square on June 1, 2020, ", "is_fake": 0},
{"date": "June 21, 2021", "title": "The Raiders' Carl Nassib Came Out, Becoming The First Openly Gay Active Player In The NFL", "text": "Carl Nassib, the 28-year-old defensive end with the Las Vegas Raiders, came out Monday afternoon as the first active openly gay player in NFL history.Nassib, who joined the league in 2016, made the announcement in an , telling fans he d intended to come out some time ago but had only recently felt \"comfortable enough to get it off my chest.\"", "is_fake": 0},
{"date": "June 22, 2021", "title": "New York City's Mayoral Election Could Take A While To Sort Out", "text": "Mayoral candidate Eric Adams laughs as he listens to speakers during a Get Out the Vote rally on June 21, 2021, in Prospect Lefferts Gardens.New York City’s mayoral primary has been chaotic, and it may not end after polls close Tuesday night.Former presidential candidate Andrew Yang was ", "is_fake": 0},
{"date": "June 22, 2021", "title": "The Media Pays Attention When Trans People Die, But The Living Are Struggling With Grief", "text": "Rell Lowery at the Midtown Neighborhood Park in Charlotte, North Carolina, on June 18, 2021. was getting ready for  in which he planned to talk about being an openly trans man in Charlotte, North Carolina.", "is_fake": 0},
{"date": "June 22, 2021", "title": "Alex Rodriguez Was Seen Hanging Out With Ben Affleck's Ex, Lindsay Shookus", "text": "In a joint statement, the pair said they were \"better as friends\" and would continue to support each other.\"We wish the best for each other and one another s children,\" the statement added. \"Out of respect for them, the only other comment we have to say is thank you to everyone who has sent kind words and support.\"A source told", "is_fake": 0},
{"date": "June 22, 2021", "title": "9 Great Places To Get Affordable And Free Books Online", "text": "  has been positioned as  in book e-commerce, allowing independent bookstores to sell and fulfill through an account on Bookshop as opposed to managing their own online orders. Customers can search for independent bookstore partners to support, so that the full profits from any purchases they make will go directly to that bookstore. Proceeds from purchases made independent of any specific bookstore are divided among independent bookstores, regardless of if they re partnered with the site. (BuzzFeed is currently an affiliate partner of Bookshop.)", "is_fake": 0},
{"date": "June 22, 2021", "title": "Biden Is Expanding A Plan To Bring Back Asylum-Seekers Who Were Forced To Wait In Dangerous Mexican Border Towns", "text": "An immigrant family crosses the border into El Paso, Texas, in Ciudad Juarez, Mexico, on Feb. 26, 2021.The Biden administration will allow immigrants who were forced to remain in Mexico for their US asylum cases to be heard, only to be ordered deported back to their home country without being present in court, to get another chance, according to a notice sent to congressional officials on Tuesday.Nearly 28,000 immigrants were forced under former president Donald Trump into the Migrant Protection Protocols (MPP) and ordered deported without being present at their last hearing or “in absentia.” In addition to conditions being too dangerous to travel to the US–Mexico border, some immigrants missed their hearings because they were kidnapped by cartels. Others were too sick or denied entry because they were pregnant.", "is_fake": 0},
{"date": "June 22, 2021", "title": "The US Will Look For Unmarked Graves At Former Native American Boarding Schools", "text": "Signs are pictured at a memorial outside the former Kamloops Indian Residential School in British Columbia.The US will search old federal boarding schools for the unmarked graves of Native American children, Secretary of Interior Deb Haaland said Tuesday, a project that will officially acknowledge the loss of life that has haunted tribal communities for more than 100 years.The announcement came at the National Congress of American Indians 2021 Mid Year Conference, where Haaland said the Department of Interior will prepare a detailed report using historical government records to identify possible burial sites. Between 1869 and the 1960s, more than 350 federal boarding schools ", "is_fake": 0},
{"date": "June 23, 2021", "title": "ICE Force-Fed Immigrants Who Went On Hunger Strikes To Protest Poor Conditions, A New Report Says", "text": "John Otieno at a friend s home in PhiladelphiaAs the plastic feeding tube forced its way into John Otieno s nose, down his throat, and finally into his stomach, the East African asylum-seeker felt a wave of humiliation come over him.The 28-year-old said he did his best to fight back against the six officers and three nurses who surrounded him, but he was sedated and handcuffed to a stretcher with his chest, arms, and legs in restraints.", "is_fake": 0},
{"date": "June 23, 2021", "title": "Sharon Stone Had A Sharp Response When Asked About Working With Meryl Streep And Opened Up About Women In Hollywood Being Compared To Her", "text": "The question began: \"So when you finally got to work with Meryl Streep, you realized –\"\"Because that s the way her life went, she got built up to be,  Everyone wants to work with Meryl, \" the 63-year-old went on. \"I wonder if she likes that?\"\"The way you structured the question is very much the answer to the question,\" she added. \"The business was set up that we should all envy and admire Meryl because only Meryl got to be the good one. And everyone should compete against Meryl.\"", "is_fake": 0},
{"date": "June 23, 2021", "title": "The Supreme Court Ruled In Favor Of A Girl Who Said “Fuck Cheer” On Snapchat", "text": "Brandi Levy was dismissed from her cheerleading team after she vented her frustration over not making the varsity squad on social media.The Supreme Court ruled Wednesday that a Pennsylvania high school violated a cheerleader s First Amendment rights when they disciplined her for writing \"fuck cheer\" on Snapchat while off campus and after school hours.In an ", "is_fake": 0},
{"date": "June 22, 2021", "title": "Live Results: The New York City Mayoral Primaries", "text": "New York City is finishing voting in one of its most consequential mayoral primary elections in decades, with the winner of the Democratic primary very likely responsible for guiding the city out of the pandemic. But : The city’s new ranked-choice voting system, where voters can rank up to five candidates, and a surge in absentee voting could mean the results aren’t clear for weeks.", "is_fake": 0},
{"date": "June 23, 2021", "title": "How New York City Crushed Andrew Yang’s Campaign Of Personality", "text": "Andrew Yang campaigns with supporters in Flushing, Queens, on June 19, 2021.NEW YORK CITY — Andrew Yang spent part of the Saturday before New York City’s mayoral primary in Morningside Park, where people were out grilling and kids were running and blowing bubbles around the park’s Juneteenth festival. Fred Scott, a Harlem resident, was still weighing exactly how he would vote. I asked him if people wanted a personality candidate — someone like Yang, who may not know much about how the city is technically run but can be an ambassador for its brand.Scott shook his head no. “Too much at stake here.”", "is_fake": 0},
{"date": "June 23, 2021", "title": "Michael B. Jordan Is Renaming His Rum Brand Amid Cultural Appropriation Criticism", "text": "\"Derived from the Antellian Creole French term meaning  daybreak,  J Ouvert originated in the pre-dawn streets of Trinidad, as celebrations of emancipation combined with Carnival season to serve as the festival s informal commencements,\" reads the rum s box.\"Crafted on those same islands, J Ouvert Rum is a tribute to the  party start. \"What’s next? A free doubles with every #JouvertRum purchase?! 🥴😭 someone point out Michael B Jordan’s Trini roots fast for me please!!! Cuz I’m not understanding this shit. Is it his grandma who makes the rum cakes???", "is_fake": 0},
{"date": "June 23, 2021", "title": "A Parkland Victim's Dad Tricked A Former NRA President Into Speaking At A Fake Graduation", "text": "3,044 chairs placed in a stadium in Las Vegas to represent those seniors who didn t graduate because they were killed by gun violenceIn a speech to the James Madison Academy 2021 graduating class, David Keene, a former NRA president and current board member of the gun rights group, called on the teens to fight those looking to implement tighter gun restrictions.\"I’d be willing to bet that many of you will be among those who stand up and prevent those from proceeding,\" he said, to a Las Vegas stadium of thousands of socially distanced chairs on June 4.", "is_fake": 0},
{"date": "June 23, 2021", "title": "Spider-Man Paid A Visit To The Vatican And Gifted The Pope His Own Special Mask", "text": "After his encounter with the Pope, Villardita told  Agency that the experience made him “very happy” as a Catholic and shared that the pope had told him to “take a lot of selfies with the kids in the square.”Villardita shared that he felt an urge to be a symbol of hope for young people in hospitals and so he began dressing like his childhood hero.", "is_fake": 0},
{"date": "June 23, 2021", "title": "A Man Was Arrested After A School Board Meeting Erupted In Protests Against Critical Race Theory", "text": "Authorities arrest a man after a fight broke out during the Loudoun County School Board meeting over protests against critical race theory and transgender students  rights.One man was arrested and another detained for trespassing after a fight broke out during a raucous school board meeting in Virginia that was disrupted by parents protesting against critical race theory and a proposed policy for transgender students  rights.The Loudoun County School Board was forced to end the public comment section of its meeting on Tuesday evening after \"loud public demonstrations violated the decorum of the meeting,\" the board said in a ", "is_fake": 0},
{"date": "June 24, 2021", "title": "Jennifer Aniston Opened Up About Her Current Relationship With Brad Pitt And Explained That There's \"No Oddness At All\"", "text": "awww. my heart. 💗Jennifer Aniston and Brad Pitt 2020 reunion. 😘💗It’s Jennifer Aniston and Brad Pitt reuniting during the “Fast Times at Ridgemont High” table read during this scene ✨for me✨ #FastTimesLive\"It was absolutely fun,\" the ", "is_fake": 0},
{"date": "June 23, 2021", "title": "These Gorgeous Photos Capture The Diversity Of New Queer Photography", "text": "Photos help shape our perceptions of people, history, and the world around us. Years ago, , an editor and art director living in Berlin, saw images on social media of a young queer community. The photos were open and honest, critical and self-exploratory. They strongly contrasted with Wolbergs  experiences growing up in a small city in southern Germany; his first interaction with the queer community didn’t happen until he was an adult moving to Berlin in 2001.Wolbergs wanted to put these queer images — so different from what he saw in the attempts of representation in the media — together in an anthology that would serve as a window into queer photography and life in our time. With Hollywood offering sometimes dubious representations of LGBTQ people (", "is_fake": 0},
{"date": "June 23, 2021", "title": "People Just Can't Get Enough Of Watching This Woman Shear Sheep", "text": "There s something about listening to Katie McRose speak that makes you want to give up whatever life you have, start roaming the countryside, and shear farm animals.McRose, 26, has , where she shares videos of herself and her wife, Darian, giving fresh haircuts to sheep, goats, llamas, and alpacas.", "is_fake": 0},
{"date": "June 23, 2021", "title": "Drake Bell Has Pleaded Guilty To Felony Child Endangerment", "text": "Jared \"Drake\" Bell, who starred in Nickelodeon s  pleaded guilty Wednesday to endangering a child in Ohio after initially entering a  earlier this month.", "is_fake": 0},
{"date": "June 23, 2021", "title": "The First Capitol Rioter Was Sentenced And Won’t Get Any Jail Time", "text": "WASHINGTON — Anna Morgan-Lloyd, a 49-year-old Indiana woman charged in the Jan. 6 insurrection who described it as the “best day ever” on Facebook, was sentenced on Wednesday to probation and no jail time after pleading guilty to a single misdemeanor.In announcing the sentence, US District Judge Royce Lamberth said Morgan-Lloyd had made it an \"easy case\" by cutting a deal early with prosecutors and accepting responsibility but acknowledged that some members of the public upset by the events of Jan. 6 might not agree with him \"giving you the break that I’m going to give you.\" He warned that other defendants charged with participating in the insurrection should not take away \"that probation is the automatic outcome here.\"Lamberth also had harsh words for Republican lawmakers who have tried to downplay the seriousness of the attack on the Capitol, which the judge described as a \"disgrace to our country.\"", "is_fake": 0},
{"date": "June 24, 2021", "title": "751 Unmarked Graves Were Found At A Former Boarding School For Indigenous Children", "text": "A memorial outside the former Kamloops Indian Residential School, where 215 Indigenous children s bodies were found in a mass grave less than a month agoAt least 751 unmarked graves were found at a former boarding school for Indigenous children in Canada, officials said Thursday.The brutal discovery took place at the site of the Marieval Indian Residential School in Saskatchewan, a Catholic school that opened in 1899 and closed in 1997.", "is_fake": 0},
{"date": "June 24, 2021", "title": "Travis Barker And Tom DeLonge Sent Messages Of Support To Blink-182 Bandmate Mark Hoppus Following His Cancer Diagnosis", "text": "\"I have cancer,\" Mark wrote. \"It sucks and I m scared, and at the same time I m blessed with incredible doctors and family and friends to get me through this.\"\"I still have months of treatment ahead of me but I m trying to remain hopeful and positive,\" he went on. \"Can t wait to be cancer free and see you all at a concert in the near future.\"\"Mark is my brother and I love and support him,\" Travis said.", "is_fake": 0},
{"date": "June 24, 2021", "title": "There's A Massive Search And Rescue Operation Happening After A Condo Partially Collapsed, Killing At Least One", "text": "At least one person is dead and dozens more are still missing as search and rescue teams sifted — slowly and carefully — through the rubble of a condominium building that partially collapsed in Surfside, Florida.As of Thursday night, 37 people had been pulled from the building after it collapsed suddenly around 1:30 a.m. Thursday, including two people who were dug out from the smoking rubble.  a side of the building suddenly falling, leaving behind only a rising plume of smoke in the dark. Another part of the building suddenly gives way seconds later, collapsing with no apparent warning and ", "is_fake": 0},
{"date": "June 24, 2021", "title": "Rudy Giuliani Has Been Suspended From Practicing Law In New York", "text": "Rudy Giuliani at a news conference about lawsuits contesting the results of the presidential election on Nov. 19, 2020.Rudy Giuliani, former New York City mayor, has been suspended from practicing law in New York state for spreading lies about the election as a lawyer for former president Donald Trump.In an ", "is_fake": 0},
{"date": "June 24, 2021", "title": "The Pacific Northwest’s Upcoming Heat Wave Could Be Especially Deadly", "text": "A brutal heat wave is forecasted to hit the Pacific Northwest and Northern California this weekend, expected to break temperature records and even hospitalize or kill people.The heat wave comes as a dramatic drought grips the West, exacerbating the area’s already high fire risk. The National Weather Service has issued excessive heat watches and warnings for much of the region, starting Friday through Wednesday.Temperatures may reach upwards of 109 degrees Fahrenheit in Portland, Oregon, near 103 degrees in Seattle, and ", "is_fake": 0},
{"date": "June 24, 2021", "title": "An Immigrant Died In ICE Custody After Staff Didn't Send Him To A Hospital, An Inspector Found", "text": "Detainees walk toward a fenced recreation area at an ICE facility in 2019.An immigrant in ICE custody in rural Mississippi died of a heart attack after staff did not send him to the hospital for urgent medical care, according to a draft inspector general’s report obtained by BuzzFeed News.Department of Homeland Security investigators found that Anthony Jones, a 51-year-old Bahamian man who had been in ICE custody for more than a year, was in need of urgent medical attention on the morning of Dec. 17, 2020. When he went to the jail clinic for chest and arm pain, medical staffers gave him medication and testing but did not send him to the hospital, according to the report. Jones was not named in the report, but the details directly correspond to information on his death previously released by ICE.", "is_fake": 0},
{"date": "June 24, 2021", "title": "“You Are Not Losing The US Capitol!”: What An Hour Looked Like For Police On Jan. 6", "text": "A man identified by the government as Thomas Webster screams as he and others approach police on Jan. 6 after breaking through a bike rack barrier.WASHINGTON — The video begins with a view from the back of a moving van. It’s timestamped in the corner Jan. 6, 2021, 1:53 p.m. There are at least three police officers seated up front; two are wearing helmets. There’s no sound. From the vantage point of a camera attached to the uniform of an officer in the back, the viewer can see his hands as he adjusts his gear and straps on gloves.Two minutes in, after the officers have exited the van at a trot and clustered with other police on the street with the Capitol in the background, the sound suddenly turns on. Another officer is yelling at the group to make sure their cameras are working. The camera picks up the sound of sirens and the low roar of a crowd in the distance.", "is_fake": 0},
{"date": "June 24, 2021", "title": "Sidney Powell And Mike Lindell Are Using Dominion’s Defamation Suit To Boost The Election Fraud Claims That Got Them Sued", "text": "Sidney Powell (front) speaks at a news conference with Rudy Giuliani (left) on Nov. 19, 2020.WASHINGTON — Donald Trump allies Sidney Powell and Mike Lindell used a court hearing Thursday to make clear they aren’t backing off baseless election fraud conspiracy theories — even as they argued for a judge to dismiss billion-dollar lawsuits that accuse them of defamation for pushing those very same claims.Powell, Lindell, and former Trump lawyer and adviser Rudy Giuliani were all sued earlier this year by Dominion Voting Systems Inc, a private company that contracts with local governments to provide election software and equipment. The trio had spent the weeks after the November election promoting baseless theories that Dominion had been part of a scheme to rig the contest for President Joe Biden. The company took them to court.", "is_fake": 0},
{"date": "June 25, 2021", "title": "The EPA Just Announced A $50 Million Push To Help Underserved Communities Tackle Pollution And Get Jobs", "text": "EPA Administrator Michael Regan testifies in front of Congress on June 9, 2021.The Environmental Protection Agency unveiled $50 million in new funding on Friday to help low-income and communities of color most impacted by pollution, the climate crisis, and the COVID-19 pandemic.This is the Biden administration’s first big spending blitz on environmental justice, which has formed a cornerstone of his climate policy. And it represents a dramatic increase in funding on an issue largely ignored by the Trump administration.", "is_fake": 0},
{"date": "June 25, 2021", "title": "Paris Hilton Liked A Bunch Of Tweets Explaining Why She's Not Taking Britney Spears' Comments About Not Believing Her Abuse Claims Personally", "text": "\"It s embarrassing and demoralizing what I ve been through,\" the 39-year-old said. \"And that s the main reason I ve never said it openly. And mainly, I didn t want to say it openly, because I honestly don t think anyone would believe me.\"In her documentary , released last September, Hilton alleged that she d been subjected to the worst abuse while attendingProvo Canyon School in Utah, ", "is_fake": 0},
{"date": "June 25, 2021", "title": "The Latest Protest By Black Creators On TikTok Just Might Be The Most Important One Yet", "text": " Please Like Me Omg. Black TikTok creators are refusing to make a dance to Thot S*it (meg s new jawn) &amp; the way these white creators are FLAILING. I live. 🤣🤣🤣🤣🤣", "is_fake": 0},
{"date": "June 25, 2021", "title": "The Justice Department Is Taking Georgia To Court Over The State’s New Voting Restrictions", "text": "WASHINGTON — The Biden administration is suing Georgia over a spate of new voting restrictions Gov. Brian Kemp  that impose voter ID requirements on absentee voting, make it illegal to give people water and food while they wait in line to vote, and limit remote drop box sites.Attorney General Merrick Garland announced the lawsuit on Friday morning along with Kristen Clarke, the newly confirmed head of the Civil Rights Division. \"The rights of all eligible citizens to vote are the central pillars of our democracy. They are the rights from which all other rights ultimately flow,” Garland said.", "is_fake": 0},
{"date": "June 25, 2021", "title": "4 People Are Dead And 159 Are Still Missing In The Miami Building Collapse", "text": "An intense search and rescue effort continued overnight in the rubble of a  as the death toll reached four and 159 people remain unaccounted for, officials said Friday.First responders are still racing to locate survivors more than 31 hours after Champlain Towers South, a beachfront condominium building in the town of Surfside, partially collapsed. ", "is_fake": 0},
{"date": "June 25, 2021", "title": "Photos Show The Horrific Extent Of The Miami Building Collapse", "text": "Police tape blocks access to a partially collapsed building in Surfside north of Miami Beach on June 24, 2021.Search and rescue personnel work in the rubble of the 12-story condo tower that crumbled to the ground after a partial collapse of the building on June 24, 2021 in Surfside, Florida.Search and rescue personnel with a K9 unit work in the rubble of a 12-story residential tower that partially collapsed on June 24, 2021, in Surfside, Florida.", "is_fake": 0},
{"date": "June 25, 2021", "title": "The New Ghislaine Maxwell Documentary Is Damning", "text": "Ghislaine Maxwell walking out of her Manhattan townhouse in 2015After Jeffrey Epstein’s highly publicized  for sex trafficking, questions lingered about how his pattern of abuse had remained hidden in plain sight. The friendships with rich and powerful men — ", "is_fake": 0},
{"date": "June 25, 2021", "title": "Becoming A “Bachelor” Cast Member Is A Direct Pipeline To Becoming An Influencer, But What Is So Wrong With That?", "text": " Please Like Me A great staple of ", "is_fake": 0},
{"date": "June 25, 2021", "title": "How Doja Cat Keeps Dodging Cancellation", "text": " Awards stage in October, Doja Cat stood in front of a Broadway sign displaying the word “Juicy,” the title of her 2019 hit single. As the sparkly intro to the song built, Doja spoke directly to the camera, her bedazzled silver leotard winking. “Forget what you’ve seen and forget what you’ve heard because tonight I’m going to keep it real,” she said before sauntering into a medley: “Juicy,” then other recent triumphs “Say So” and “Like That,” all reimagined as a .It was hard not to read into Doja Cat’s impressive homage to ", "is_fake": 0},
{"date": "June 25, 2021", "title": "I Can’t Stop Thinking About Britney Spears’ Speech", "text": " with you: I haven’t been back to court in a long time because I don’t think I was heard on any level when I came to court the last time,” Britney Spears said in a surprisingly low voice that echoed through  spread by fans across the internet Wednesday.But she is being heard now. Dozens of fans in #FreeBritney T-shirts gathered outside the courthouse in Los Angeles, listening to her testimony on a loudspeaker as Spears contested the conservatorship that has given her father and management team full control over her life for the past 13 years.", "is_fake": 0},
{"date": "June 25, 2021", "title": "These Veterans Have Endured Not Having Their Gender-Affirming Surgeries Covered. That’s About To Change.", "text": "Prior to the announcement last week that the Department of Veterans Affairs would start covering the costs of gender-affirming surgeries, Alix Wells felt trapped in a sort of limbo as he tried to complete his transition.A disabled veteran who is transgender, Wells had accepted the fact he would need to save about $9,000 for surgeries that would relieve complications caused by hormone replacement therapy, which he started in 2015.Wells already had one gender-affirming surgery covered by the US government. After over five years of service as an aircraft engine mechanic with the US Air Force and two deployments, Wells had top surgery in 2018 just six months before his exit from active duty. The operation addresses distress caused by gender dysphoria by removing the breast tissue and masculinizing the chest. If Wells had paid out of pocket for the procedure, the top surgery could have cost upwards of $10,000. But because he was on active duty at the time, the government covered the operation.", "is_fake": 0},
{"date": "June 26, 2021", "title": "7 Photo Stories That Will Challenge Your View Of The World", "text": "This week, Britney Spears dominated the headlines as she shared shocking details of her 13-year conservatorship. We also watched as a search and rescue mission got underway after the horrific collapse of an apartment building in Miami.We looked back at the scale of the building collapse in photos and at a devastating year of COVID-19 through the lens of . Photographer ", "is_fake": 0},
{"date": "June 25, 2021", "title": "George Floyd's Daughter Told The Judge Sentencing Derek Chauvin How Much She Misses Her Dad", "text": "Gianna Floyd gives a victim impact statement over video.The sentencing of former police officer Derek Chauvin on Friday began with a heartbreaking surprise guest: George Floyd s 7-year-old daughter Gianna talking about how she misses her daddy.\"I ask about him all the time,” said Gianna in a victim impact statement delivered to the Minneapolis court via video testimony. “I want to play with him.\"", "is_fake": 0},
{"date": "June 25, 2021", "title": "Derek Chauvin Gets 22 And A Half Years In Prison For George Floyd’s Murder", "text": "Derek Chauvin addresses the court before his sentencing on June 25, 2021, at the Hennepin County Courthouse in Minneapolis.Derek Chauvin, the former Minneapolis cop convicted for the murder of George Floyd, was sentenced to 22 and a half years in prison on Friday — a capstone to one of the most significant and closely watched police trials in modern history.Chauvin’s sentence over Floyd’s murder — a death seen by millions around the world in viral footage that prompted widespread outcry in the United States — comes as the country continues to grapple with the legacy of slavery and systemic racism.", "is_fake": 0},
{"date": "June 25, 2021", "title": "Police Killed A \"Good Samaritan\" Who Fatally Shot A Gunman Who Had Killed A Cop", "text": "About 30 police cars line up for a procession on June 21 in honor of an officer who was fatally shot in Arvada, Colorado.A \"good Samaritan\" shot a man who ambushed and killed a Colorado police officer, likely saving other lives, only to be fatally shot himself by responding officers, officials confirmed Friday.Johnny Hurley", "is_fake": 0},
{"date": "June 25, 2021", "title": "Canada Has Added More US Far-Right Extremists To Its List Of Banned Terrorists", "text": "Supporters of former president Donald Trump hold a \"We the People\" banner, a Three Percenters flag, and a 13-star Betsy Ross US flag, in front of the Capitol Building on Jan. 6, 2021.Canada’s government on Friday added more American neo-Nazis to its list of banned terrorist groups, yet another sign that the country is going further than the United States when it comes to recognizing such white supremacist extremists as threats.The additions follow ", "is_fake": 0},
{"date": "June 26, 2021", "title": "Five People Are Dead After A Hot-Air Balloon Crashed Into A Power Line", "text": "Albuquerque Fire Rescue crews treat victims after the hot-air balloon crash.Five people are dead in Albuquerque, New Mexico, after a hot-air balloon crashed into a power line and caught fire Saturday morning, police said.Four of the victims, two men and two women, were declared dead at the scene, Albuquerque Police Department spokesperson Gilbert Gallegos told BuzzFeed News. A fifth victim, a man, was taken to the hospital in \"critical and unstable condition\" but later died of his injuries.", "is_fake": 0},
{"date": "June 27, 2021", "title": "The People Still Going To Trump Rallies Are Committed To Trump’s Fantasy: “He’s Our True President”", "text": "A supporter of former president Donald Trump at Trump s first post-presidency campaign rally at the Lorain County Fairgrounds in Wellington, Ohio, on June 26.WELLINGTON, Ohio — When Rep. Jim Jordan took the stage at Donald Trump’s first post-presidential rally, he trumpeted the former president’s possible 2024 election bid. And then someone screamed, “2021!”The fantasy that Trump could reclaim the White House later this year (some named August 2021 as the time) was a common theme among the droves of attendees at the “Save America” rally Saturday at the Lorain County Fairgrounds in Wellington, Ohio.", "is_fake": 0},
{"date": "June 27, 2021", "title": "Serena Williams Said \"There's A Lot Of Reasons\" She Won't Play In The Tokyo Olympics", "text": "Serena Williams attends a press conference on June 27.Tennis star Serena Williams won t be competing next month in the Tokyo Olympic Games.The 39-year-old, who has already won four Olympic gold medals, made the announcement in response to a question during a pre-Wimbledon press conference Sunday.", "is_fake": 0},
{"date": "June 28, 2021", "title": "Demi Lovato Opened Up About The \"Reality\" Of Coming Out As Nonbinary", "text": "\"Today is a day I m so happy to share more of my life with you all,\" the 28-year-old said. \"I am proud to let you know that I identify as nonbinary and will officially be changing my pronouns to they/them moving forward.\"\"I m still learning and coming into myself, and I don t claim to be an expert or a spokesperson,\" they added. \"Sharing this with you now opens another level of vulnerability for me.\"\"It feels weird to me when I get called a  she  or a  her, \" they explained. \"I understand that people might have a hard time adjusting to it, because it is something new, but I want to encourage people to keep trying. I understand that it s a process to get used to. Sometimes I still mess up myself, but it s OK.\"", "is_fake": 0},
{"date": "June 28, 2021", "title": "How TXT Made Magic In The Midst Of Chaos", "text": "From left: Hueningkai, Beomgyu, Yeonjun, Soobin, and Taehyun in \"World\" concept photos for  sings  s youngest member, Hueningkai, on \"Anti-Romantic,\" the first track of the group s second full studio album, ", "is_fake": 0},
{"date": "June 26, 2021", "title": "US Intelligence Agencies Are Trying To Solve Scientific Mysteries And Failing Badly", "text": ". Space aliens are roaming overhead. Russian spies are zapping American diplomats with microwave weapons. And the commies are covering up a viral bioweapon.This is the year shaky science and government intelligence reports have collided, turning the news into the stuff of a bad thriller — three bad thrillers, actually.  ", "is_fake": 0},
{"date": "June 27, 2021", "title": "Fearless, Unfiltered Photos Of The Latin American Diaspora Across The United States", "text": "Dos Mujeres (Two Women), Douglas, Arizona, 1979Elizabeth Ferrer is chief curator at BRIC, a nonprofit arts and media organization in Brooklyn. She’s also the author of . Ferrer’s family is Mexican American, and she was born and raised in Los Angeles. She loved art as a kid, and growing up during the rise of the ", "is_fake": 0},
{"date": "June 27, 2021", "title": "The Search Of The Miami Condo Collapse Site Has Become Agonizing As More Than 150 People Remain Missing", "text": "Members of the South Florida Urban Search and Rescue team look for possible survivors in the partially collapsed 12-story Champlain Towers South condo building on June 26 in Surfside, Florida.A 12th victim was found dead in the rubble of  Tuesday, and with nearly 150 people still unaccounted for, the death toll is expected to drastically increase.", "is_fake": 0},
{"date": "June 30, 2021", "title": "Wisconsin Republicans Said They'd Hire Three Former Cops To Investigate The 2020 Election. It’s Not At All Clear What They Are Doing.", "text": "Wisconsin Assembly Speaker Robin Vos speaks at the Wisconsin State Capitol in Madison on Jan. 12, 2021.Republican leaders in states across the country have spent the first half of 2021 pushing to relitigate the 2020 election, amping up false conspiracies that the presidency was stolen and in some cases pushing for “audits” to prove the case. But what’s happening now in Wisconsin is unique — a secretive effort run by one of the state’s most powerful Republicans to undermine faith in elections.The investigation is unlike anything else happening in the country, even as it has a similar aim: giving semiofficial cover to false and misleading claims of 2020 election fraud as a way to justify severe new voting restrictions.", "is_fake": 0},
{"date": "June 30, 2021", "title": "An Oath Keeper Admitted His Group Stashed Guns Outside DC For Jan. 6", "text": "Members of the Oath Keepers outside the Capitol on Jan. 6, 2021.WASHINGTON — A member of the  who cut a deal with prosecutors admit he stashed guns at a Virginia hotel as part of preparations for demonstrations at the Capitol on Jan. 6.", "is_fake": 0},
{"date": "June 30, 2021", "title": "“Zola” Is This Summer's Best Movie", "text": " plays the titular role in  — the new dark comedy out this week that’s based on an infamous 2015 Twitter thread by A’Ziah “Zola” King — actor Taylour Paige admitted earlier this month that she had missed out on the tweetstorm when it happened. “I was a grandma on Twitter,” she joked. Both she and her  costar Riley Keough were doing Zoom interviews from adjacent rooms at the London West Hollywood hotel. Paige’s two rescue dogs — Aretha and Juice — could be seen lounging behind her. “I only would tweet positive shit and log out,” said Paige.", "is_fake": 0},
{"date": "June 30, 2021", "title": "Former “Smallville” Actor Allison Mack Has Been Sentenced To Three Years In Prison For Aiding The Secret Sex Cult NXIVM", "text": "Allison Mack (center) arrives at federal court on June 30, 2021, in New York to be sentenced.Former  actor Allison Mack was sentenced to three years in prison on Wednesday after she ", "is_fake": 0},
{"date": "June 30, 2021", "title": "Why Amusement Parks Can’t Hire Enough Employees", "text": " things Ethan Lindenberger didn’t like about his part-time job. Working in the arcade at an amusement park in Ohio, the college student played virtual reality games on his breaks and bonded with coworkers, some of whom are now his closest friends. He excelled at communicating with customers, selling passes, and repairing the machines, especially when they ran out of tickets.Once, he said, the park introduced a friendly competition among employees to encourage guests to post Facebook reviews of the arcade — workers were offered a small monetary reward for each review they prompted — and so many of the reviews could be attributed to him that management limited his payout, which would have totaled $800. Within a few months of starting the job in fall 2019, Lindenberger, 20, was promoted and began training other new hires. “I was really, really good at my job,” he told BuzzFeed News, “and really enjoyed it.”But in late March 2020, as Ohio Gov. Mike DeWine issued a stay-at-home order to curb the spread of COVID-19, the park, along with all other nonessential businesses in the state, was forced to close. Lindenberger was ", "is_fake": 0},
{"date": "June 30, 2021", "title": "Is It Time For Twitch To Ban Gambling On Stream?", "text": "At any given time on Twitch, you can watch someone spin online slots for hours on end, winning and losing thousands of dollars at a time.The flashy symbols roll by over and over, with the streamers hoping for just the right combination to bring their total back up. Often, thousands of people are watching as it happens.Online slots are a big enough draw to warrant their own category on Twitch, but some big names are calling for the platform to ban them, concerned that they promote reckless behavior. Gambling addiction experts have taken notice, too.", "is_fake": 0},
{"date": "June 30, 2021", "title": "Bill Cosby Has Been Released From Prison After His Rape Conviction Was Overturned", "text": "Bill Cosby, center, listens to members of his team speak with the media outside his home in Elkins Park, Pennsylvania on June 30, 2021, after his sexual assault conviction was overturned.Pennsylvania s Supreme Court on Wednesday overturned Bill Cosby s sexual assault conviction after finding that his agreement with a previous prosecutor should have prevented charges from ever being filed.After a jury was unable to reach a verdict in his first trial in 2017, Cosby, now 83, ", "is_fake": 0},
{"date": "June 30, 2021", "title": "18 People Have Been Found Dead In The Miami Building Collapse So Far, And 145 Are Still Missing", "text": "Family members hold a vigil for the missing victims of the Surfside condo collapse on June 29, 2021.Another six victims have been found in the condominium building collapse in Surfside, Florida, officials said Wednesday, bringing the death toll to 18 as search and rescue teams enter the seventh day of the harrowing operation.Daniella Levine Cava, the mayor of Miami-Dade County, announced the increased death toll as crews worked around the clock to sift through the rubble. Another 145 people are still missing.", "is_fake": 0},
{"date": "June 30, 2021", "title": "A Government Watchdog May Have Missed Clearview AI Use By Five Federal Agencies In A New Report", "text": "A  into federal agencies’ deployment of facial recognition may have overlooked some organizations’ use of popular biometric identification software Clearview AI, calling into question whether authorities can understand the extent to which the emerging technology has been used by taxpayer-funded entities.In a 92-page report published by the Government Accountability Office on Tuesday, five agencies — the US Capitol Police, the US Probation Office, the Pentagon Force Protection Agency, Transportation Security Administration, and the Criminal Investigation Division at the Internal Revenue Service — said they didn’t use Clearview AI between April 2018 and March 2020. This, however, contradicts internal Clearview data previously reviewed by BuzzFeed News.", "is_fake": 0},
{"date": "June 30, 2021", "title": "A Photographer Called Out Quavo For Not Crediting Her In An Instagram Repost And Other Photographers Are Relating", "text": "I wonder how many bookings I would have got if homie had tagged me 🥲A photographer is getting a lot of sympathy from her industry peers after she tweeted about a time in 2019 that Quavo reposted her photo without a credit on his Instagram account.Breanna Seward, 25, is a multimedia artist and licensed aesthetician. Although the incident happened nearly two years ago, Seward tweeted about it this week and her tweet quickly went viral.", "is_fake": 0},
{"date": "June 30, 2021", "title": "James Franco Will Pay $2.2 Million To Settle A Fraud And Sexual Harassment Lawsuit", "text": "James Franco and partners at his production company have agreed to pay $2.2 million to settle fraud and sexual harassment claims brought by his former acting students, according to court records made public Wednesday.As part of the settlement agreement, which has not yet been approved by a judge, Franco, his partners, and Rabbit Bandini Productions denied breaking any laws and are maintaining that they \"made no false representation to students and that they provided students with all services and benefits promised to them.\"They also denied all of the sexual harassment and exploitation claims made in the 2019 lawsuit.", "is_fake": 0},
{"date": "June 30, 2021", "title": "This Is Why Bill Cosby’s Rape Conviction Was Overturned", "text": "Bill Cosby reacts outside his home on June 30, 2021, after being released from prison.Bill Cosby walked out of prison on Wednesday afternoon, two years into what was supposed to be a sentence of three to 10 years after he was found guilty of raping Andrea Constand at his home in 2004. Hours earlier, the Pennsylvania Supreme Court had tossed out the conviction.What happened?", "is_fake": 0},
{"date": "June 30, 2021", "title": "A House Select Committee Will Officially Investigate The Jan. 6 Insurrection", "text": "Congress voted to establish a select committee to investigate the Jan. 6 attack on the US Capitol Wednesday.The vote passed with a slim margin of 222–190 after only two Republicans voted for the resolution, including ousted Republican conference chair Liz Cheney and anti-Trump firebrand Adam Kinzinger.The select committee will have subpoena power over documents and testimony.", "is_fake": 0},
{"date": "June 30, 2021", "title": "“It Could Happen To Anyone”: Here’s How People In Surfside Are Coping With The Building Collapse", "text": "SURFSIDE, Florida — The day after the devastating condo collapse near Miami Beach, Kymany Roberts lent a woman his parking spot. She told him she had three family members among the missing. Her car sat in the spot without moving for days.“The very next day, I saw her on the news crying,” he told BuzzFeed News on Tuesday as he walked his dog near his home, blocks away from where it happened. “It just touches you because ... there’s nothing you really can do. There’s nothing nobody possibly can do to help.” He plans to keep reaching out to check up on how she’s doing.This is what it has been, is, and will continue to be like for the tight-knit community of Surfside. A search and rescue operation continues around the clock, through the rain, through the heat, as hurricanes threaten, and as more and more debris is removed from the rubble. But the painful and slow release of information about the people who were inside has left the community suspended in a limbo, half hopeful, half mourning. Eighteen are dead, among them children, and 145 remain unaccounted for nearly a full week since the building fell on June 24.", "is_fake": 0},
{"date": "June 30, 2021", "title": "These Photos Show How Intense The Dangerous Heat Wave Is In The Pacific Northwest", "text": "An unprecedented heat wave across the Pacific Northwest this week has broken records in Washington, Oregon, and the Canadian town of Lytton — which hit a new high of 118 degrees Fahrenheit on June 28. People are trying to cope with temperatures that can turn dangerous in an area that usually doesn t experience such extreme heat, even in the summer. The high temperatures have  and created massive problems for businesses and infrastructure. Since last Friday, Washington state hospitals had reported 676 emergency department visits for suspected heat-related illnesses.Here are just some of the ways that people are beating the heat.", "is_fake": 0},
{"date": "June 30, 2021", "title": "The Overturning Of Bill Cosby's Conviction Is Being Met With An Outpouring Of Shock And Disappointment", "text": "Bill Cosby was released from prison on Wednesday hours after the Pennsylvania Supreme Court  his 2018 sexual assault conviction, finding that his agreement with a previous prosecutor should have prevented charges from ever being filed.The sudden reversal of what was seen as one of the biggest milestones in the #MeToo movement was met with shock and disbelief from the public.", "is_fake": 0},
{"date": "June 30, 2021", "title": "Britney Spears' Father Is Shifting The Blame In New Court Filings After The Singer's Explosive Testimony", "text": "Jamie Spears in 2012Britney Spears  father, who along with an array of lawyers has legally controlled the pop star s money and life for 13 years under a court-mandated conservatorship, denied being involved in her care after she shared a series of shocking revelations about her treatment under the arrangement.In documents filed late Tuesday in Los Angeles County Superior Court, an attorney for Jamie Spears said he was concerned about \"the management and care\" of his 39-year-old daughter. He asked the court to investigate the claims she made last week, when she ", "is_fake": 0},
{"date": "July 1, 2021", "title": "Alyson Stoner Said Her Conversion Therapy Experience Is \"Legitimately Difficult\" To Talk About", "text": ", Alyson wrote that she had gone to therapy after falling in love with a woman in order to \"identify the source of [her] attraction.\"\"Like many, I had internalized some of the harmful beliefs and misconceptions aboutLGBTQpeople and identities,\" she said.\"My faith at that time played a large role in every aspect of my life, and my worldview neither supported nor accepted same-sex relationships,\" she continued. \"I prayed in turmoil nightly, begging to be healed from these desires. Certain pastors and community memberstried to reverse and eliminate my attraction to her.\"", "is_fake": 0},
{"date": "July 1, 2021", "title": "13 New Paperbacks You Won't Want To Put Down", "text": "Nothing in Elizabeth’s life is quite as she’d hoped it would be: She’s using her PhD and love of books to teach English at a New York City charter school more interested in the idea of disciplining “underserved” (i.e., working class, Black) students than educating them; she and her husband live in a too-small apartment, sleeping in a loft bed in a closet so their daughters can benefit from a well-funded school zone; they’re broke and declaring bankruptcy; and lately, she finds herself preoccupied with thoughts of her ex–best friend Sasha. Strong breaks up the present timeline with flashbacks to Elizabeth and Sasha’s high school and early-twenties friendship, a relationship that involved Elizabeth’s complete enthrallment with her beautiful and magnetic best friend, whose interactions with the world revealed both the blessings and perils of being a woman universally desired. And through Elizabeth’s reconnection with Sasha at this moment of crisis, Strong astutely explores the complexities of wanting within biased systems — as a woman, whose desires are so often quashed, but also as a  woman raised with wealth and the message that anything desired can be attained. —Arianna Rebolini (from )", "is_fake": 0},
{"date": "July 1, 2021", "title": "Prince Harry Revealed Some Cute Details About His Newborn Daughter Lilibet Diana And Opened Up About Raising Two Children", "text": "The baby was born on June 4 at Santa Barbara Cottage Hospital in California at 11:40 a.m. and weighed 7 pounds, 11 ounces.It is with great joy that Prince Harry and Meghan, the Duke and Duchess of Sussex, welcome their daughter, Lilibet  Lili  Diana Mountbatten-Windsor, to the world,\" a spokesperson said in a statement to BuzzFeed News. \"The duke and duchess thank you for your warm wishes and prayers as they enjoy this special time as a family.\"The statement went on to ", "is_fake": 0},
{"date": "July 1, 2021", "title": "“Sex/Life” Is The Worst Show I Have Ever Seen, And I Have Watched All Of Television", "text": "Brad (Adam Demos) and Billie (Sarah Shahi) having sex about shows like , which is currently the third-most-watched show in the US on Netflix. The trouble is that engaging with this kind of television — and then writing about it — all but forces me to offer small tidbits about my own marriage, which I’m not really interested in doing. For example: I suspect your enjoyment of a show like ", "is_fake": 0},
{"date": "July 1, 2021", "title": "Prince William And Prince Harry Reunited To Unveil A Statue Of Princess Diana", "text": " and Prince Harry presented a united front as they unveiled a statue of their mother, Princess Diana, at Kensington Palace on Thursday, on what would have been her 60th birthday.The statue was created to reflect Diana s \"warmth, elegance and energy\" and depicts her with children \"who represent the universality and generational impact of the Princess  work,\" Kensington Palace said in an official statement.\"The portrait and style of dress was based on the final period of her life as she gained confidence in her role as an ambassador for humanitarian causes and aims to convey her character and compassion,\" the statement continued.", "is_fake": 0},
{"date": "July 1, 2021", "title": "The Supreme Court Again Made It Harder To Challenge State Laws That Restrict How People Can Vote", "text": "WASHINGTON — The US Supreme Court on Thursday upheld two Arizona voting laws that the challengers had argued discriminated against Native American, Latino, and Black voters, and in doing so applied legal reasoning that will generally make it harder to challenge state voting restrictions going forward.The  was written by Justice Samuel Alito Jr. and joined by the rest of the court’s conservative wing. Although Alito made a point of saying that the court was not adopting a strict “test” for how to apply the federal Voting Rights Act to similar cases in the future, he presented a series of “guideposts” that directed courts to consider a variety of factors in deciding whether a voting practice unlawfully discriminated on the basis of race. Those include the relative “size” of any burdens on voting access or racial disparities, as well as the state’s interests, such as preventing election fraud.", "is_fake": 0},
{"date": "July 1, 2021", "title": "Howard University Disavowed Phylicia Rashad's Tweet Supporting Bill Cosby", "text": "After Phylicia Rashad tweeted in support of  on Wednesday, Howard University — where Rashad was recently  as fine arts dean — ", "is_fake": 0},
{"date": "July 2, 2021", "title": "Fans Of K-Pop Group Enhypen Are Speaking Up Against Fandom Racism After A Member Allegedly Sang The N-Word", "text": "Reply to @rapllneLast week, a member of the K-pop group Enhypen was accused of saying the N-word while singing along to SZA s \"Love Galore\" in the background of a video published on the group s Now, the controversy is dividing fans and led to a spike of racist abuse within the fandom. BuzzFeed News spoke to a group of fans of the group — also known as Engenes — who have come together to denounce the racism in their fandom after the incident. Neither representatives of Enhypen and Weverse, the app on which racist posts were made, returned a request for comment on the incident or the rise of abuse online.", "is_fake": 0},
{"date": "July 2, 2021", "title": "Netflix’s Newest True Crime Show Wrestles With The Allure Of The Dead White Woman", "text": "Sophie Toscan du Plantier true crime offerings from streamers have tended to fall into two traps. On the one hand, there are just-the-gore rehashings of serial killer sprees and police chases — like  — that presume murder cases are interesting mainly because of their extreme violence.", "is_fake": 0},
{"date": "July 2, 2021", "title": "A Gas Leak Caused A Fire In The Gulf Of Mexico And The Videos Are Unreal", "text": "A fire broke out in the southern waters of the Gulf of Mexico Friday after an underwater pipeline leaked, sending the internet ablaze with horror as videos of flames spewing out of the ocean went viral.🚨 Sobre el incendio registrado en aguas del Golfo de México, en la Sonda de Campeche, a unos metros de la plataforma Ku-Charly (dentro del Activo Integral de Producción Ku Maloob Zaap)Tres barcos han apoyado para sofocar las llamasMexican-state-owned petroleum company Petróleos Mexicanos, also known as Pemex, said a gas leak was discovered in the 12-inch submarine pipeline near a platform in the Ku-Maloob-Zaap oil field. Firefighting crews were able to snuff out the swirling, fiery mass of water by about 10:45 a.m., the company said. No injuries were reported.", "is_fake": 0},
{"date": "July 2, 2021", "title": "The Mega Heat Dome Over The Pacific Northwest Has Brought Death, Fire, And Misery", "text": "Kais Bothe seeks relief from searing temperatures in Edmonton, Alberta, on June 30, 2021.Across the Pacific Northwest and into Canada, a  has pushed death tolls into staggering territory. In British Columbia alone, at least 500 heat-related deaths have been recorded since last Friday. In Oregon, 95 deaths have been attributed to scorching temperatures, as well as about 20 in Washington.", "is_fake": 0},
{"date": "July 3, 2021", "title": "One Man Made It His Mission To Save Incredible Photos Of Queer Life in The 1950s", "text": "The Hot House, 1958.As queer men were ostracized from society in the early 20th century, some came together to form a community on a secluded strip of beach just off the coast of Long Island. One such community was Cherry Grove, which is the subject of an exhibition at the New-York Historical Society titled  ", "is_fake": 0},
{"date": "July 2, 2021", "title": "How Sleeping On A Stranger’s Couch Became A Moral Dilemma For Travelers", "text": " 56, started traveling after the death of her twin sister in 2002. “That’s what changed the course of my life,” she told BuzzFeed News. “I said, ‘I’m going,’ because you don’t know what’s going to happen.” For the last 12 years, she has blogged about her travels as she visited places as disparate as a village in Myanmar to a Romanian monastery. On March 19, 2020, after four months in London, she was supposed to head to a friend’s home in Greece. That day, Hill’s flight was canceled due to the coronavirus. Four months later, she was using the last of her funds on a monthlong stay in a bed-and-breakfast near Gatwick Airport, and she didn’t have a plan for where to go next. Years of writing about her itinerant lifestyle had helped her grow a network to find accommodations, but she was running out of options.That’s when Hill found out about Host a Sister, a private Facebook group that allows members to find and accommodate one another for free. Immediately she found a place to stay; she likened her luck to an act of divine intervention. But stories like Hill’s would exemplify the tensions between people like her, who continued to travel during the pandemic, and those who thought it was dangerous.The pandemic’s effects on hospitality exchange (also known as homestay or couch surfing) are hard to grasp because the lifestyle is largely organized by word of mouth. Figuring out how big the community is in relation to mainstream travel is just as elusive because, as noted in a July 2020 ", "is_fake": 0},
{"date": "July 3, 2021", "title": "10 Photo Stories That Will Challenge Your View Of The World", "text": "For this week s photo review, heat waves brought the reality of climate change to the forefront of our minds as we looked at how the Pacific Northwest handled the extreme temperatures. For the BBC, teenagers looked back at life in lockdown in photographs.  is a metalhead photographer with a love for hip-hop who photographed some of the greats.  has photographed a concurrent pandemic of fatal drug overdoses in the Black community in St. Louis. Photographer Elliot Ross photographed Los Angeles s \"shady divide\" between neighborhoods. We also took a look at how Miami is holding vigil for the missing.", "is_fake": 0},
{"date": "July 4, 2021", "title": "Red, White, And Blue All Over: Some Amazing Flag-Themed Outfits To Celebrate The 4th Of July", "text": "Two patriotic older motorcyclists in Pine Island, FloridaDogs dressed in patriotic costumes are seen at the Haute Dog Howl oween Parade in Long Beach, California.Caroline Sherman at the 21st Annual 4th of July Bike Parade", "is_fake": 0},
{"date": "July 5, 2021", "title": "Florence Pugh Believes Her Relationship With Zach Braff \"Bugs\" People Because It's Not What They Expect From Her", "text": "Florence  she received at the time in a video on Instagram.\"About 70% of the comments were hurling abuse, being horrid, and basically bullying someone on my page,\" Florence said in the video. \"I will not allow that behavior on my page.", "is_fake": 0},
{"date": "July 6, 2021", "title": "TikTok Is Testing Letting You Pay For A Video From Creators", "text": "TikTok appears to be testing a Cameo competitor that allows people to request and pay for custom videos from their favorite creators.Called \"Shoutouts,\" users can request a video using the same in-app currency that can be used to tip creators during live videos. Right now, it appears creators are able to set their own rate for a custom video.The feature is only available in select markets. So far, creators in Turkey and at least one in Dubai appear to have access. The app also prevents users in some regions from even requesting a video.", "is_fake": 0},
{"date": "July 5, 2021", "title": "An NHL Player Has Died After Being Hit By Fireworks On The 4th Of July", "text": "Matiss Kivlenieks of the Columbus Blue Jackets during a game against the Detroit Red Wings at Nationwide Arena in Columbus, Ohio, on May 8.A hockey player with the NHL s Columbus Blue Jackets died Sunday night after being apparently struck in the chest by fireworks, authorities said.Matiss Kivlenieks, a 24-year-old Latvian goaltender, had been sitting in a hot tub at a private home in Novi, Michigan, when a nearby firework tilted and headed toward him and a group of several other people, Lt. Jason Meier of the Novi Police Department told BuzzFeed News.", "is_fake": 0},
{"date": "July 6, 2021", "title": "Journalist Nikole Hannah-Jones Has Declined UNC's Tenure Offer After A Drawn-Out Dispute Over Her Tenure", "text": "Nikole Hannah-Jones speaks on stage during the 137th Commencement at Morehouse College on May 16, 2021, in Atlanta.Journalist Nikole Hannah-Jones has turned down a tenure offer from the University of North Carolina following a contentious tenure dispute and will instead join Howard University s faculty, she announced Tuesday.Amid the ", "is_fake": 0},
{"date": "July 6, 2021", "title": "Gwen Stefani Shared The First Photos From Her Wedding To Blake Shelton", "text": "According to, the  judges got married on Saturday at an intimate ceremony held in a purpose-built chapel on the grounds of Blake s ranch in Oklahoma.", "is_fake": 0},
{"date": "July 6, 2021", "title": "How Americans Around The Country Celebrated Independence Day", "text": "Fireworks on the driveway with family and neighbors in Springfield, MissouriThe long 4th of July weekend can be a time to see family and friends, enjoy a day off, and celebrate with a barbecue and some fireworks.But for many Americans, celebrating a country that has done so much harm since its inception can feel complicated and even painful. \"I don t feel connected to the 4th of July,\" said photographer ", "is_fake": 0},
{"date": "July 6, 2021", "title": "Jennifer Lopez Revealed She's \"Super Happy\" And \"Never Been Better\" After She Was Pictured On A Cute Date With Ben Affleck", "text": "\"I love what I m doing, I love where I m at, I love the person that I m continually evolving into and becoming,\" she continued. \"And that kind of joy, that kind of happiness, that kind of love always inspires me.\"Going on to discuss how her current happiness had impacted her new music, the 51-year-old explained that she often produces her best stuff when she s in a positive place. \"I think some people really get inspired when they re heartbroken to write music, when they re in pain,\" she said. \"For me it s the opposite — when I feel really good it s when I really feel like I do my best music.\"\"I know people are always wondering,  How are you? What s going on? Are you OK?  I ve never been better, and I want my people who care about me, because I care about them so much, to know that,\" she said. \"I ve really gotten to a place in my life where I m great on my own and I think once you get to that place, then amazing things happen to you that you would never imagine in your life happening again.\"", "is_fake": 0},
{"date": "July 6, 2021", "title": "How Autistic People Are Showing The Limitations Of Person-First Language", "text": "While speaking at an event, autistic advocate Lydia X. Z. Brown referred to themself as “an autistic person” — and someone interrupted to “correct” them: “You mean you’re a ; you need to separate yourself from the condition.”The interaction was emblematic of how person-first language has been so “indoctrinated” in people, Brown said, and it’s not the best way to describe themself at all.", "is_fake": 0},
{"date": "July 6, 2021", "title": "Eric Adams Has Won New York City's Democratic Mayoral Primary", "text": "Brooklyn Borough president and mayoral candidate Eric Adams.Eric Adams won the Democratic primary for mayor of New York City on Tuesday, becoming the next person who will likely lead the country’s largest city.For the first time, New York City used ranked-choice voting to decide the mayoral primaries. This allowed voters to rank up to five candidates. When the city tabulates the votes, the least-ranked candidate is eliminated and their votes are reapportioned to each ballot’s next choice. That process is repeated until one candidate exceeds 50%.", "is_fake": 0},
{"date": "July 6, 2021", "title": "They’re Vaccinated, But They Still Can’t Travel To See Their Loved Ones", "text": "Left: Nadja De Maeseneer and her husband Julius. Right: Nane Mertens and her boyfriend, Brian Fountain., Emily Quiros, 38, and her fiancé, Ryon Jay Parker, 37, were looking forward to starting a family together. Parker, an American, planned to join Quiros in the Philippines, where she lives, before the birth of their son in the summer of 2020. Due to newly imposed COVID lockdown restrictions, however, Quiros had to give birth alone in the Philippines while Parker stayed home in Idaho. Devastated that her fiancé wasn’t yet able to hold his newborn child, Quiros took out her frustrations on social media, where she found the : a vast network of people from all over the world attempting to gain exemptions to various pandemic travel bans for their families.", "is_fake": 0},
{"date": "July 6, 2021", "title": "Britney Spears' Court-Appointed Attorney Is Resigning From Her Conservatorship", "text": "The court-appointed attorney who has represented Britney Spears in her conservatorship since it began is resigning in the wake of the pop star s explosive comments about the legal arrangement that has put her father and lawyers in control of her life for more than a decade.In a new filing Tuesday in Los Angeles County Superior Court, Samuel Ingham informed the judge of his resignation and that of co-counsel Loeb & Loeb LLP. He also requested that their departures take effect \"upon the appointment of new court-appointed counsel.\"Ingham did not provide a reason for his resignation or indicate whether the 39-year-old singer had chosen a new attorney, as she told the judge that she d like to do. Ingham did not immediately respond to BuzzFeed News  questions.", "is_fake": 0}
]