[
{"date": "December 18, 2020", "title": "‘Brilliant Move’ By Founding Fathers Could Become Joe Biden’s Worst Nightmare", "text": "According to recent polls, many Americans believe the Democrats are trying to steal the election, and we can say “are trying” because of the brilliance of the framers of the Constitution. The constitutional process of electing the president is not over yet. You don’t want to miss how this could become the worst nightmare for Joe Biden and his supporters.In his splendid book , Charles Murray reminds us that it was foreigners who took the lead in claiming Americans are different:", "is_fake": 1},
{"date": "December 18, 2020", "title": "Bombshell: Defense Secretary Orders Halt To Cooperation With Biden Transition Team", "text": "According to officials across the Defense Department were shocked at the directive and uncertain of what prompted the move. Apparently, a top Biden official was also stunned by the directive.Administration officials told the news outlet that cooperation with Biden’s transition team could possibly resume after a holiday pause:", "is_fake": 1},
{"date": "December 16, 2020", "title": "General Calls To Invoke ‘Insurrection Act’; Trump Advisor Makes Cryptic Facebook Post", "text": "Retired Air Force Lt. Gen. Thomas McInerney is making it known he believes President Donald Trump has no choice but to invoke the Insurrection Act. That was echoed by a Republican state senator in North Carolina. Also, the White House Deputy Chief of Staff for Communications and Director of Social Media for the White House made a cryptic post on Facebook. Don’t miss this.Sen. Ron Johnson, R-Wis, chaired the hearing on Wednesday on “election irregularities.” He mentioned that in 2016, one poll showed 32 percent of Americans believed “Russia interfered in our election.” He then noted in 2020, “47 percent of American voters the election was stolen.”", "is_fake": 1},
{"date": "December 16, 2020", "title": "Democrats Freak Out, Theory For Trump’s ‘Paths To Victory’ Explained In Viral Video", "text": "Rep. Maxine Waters and Hillary Clinton are two of the Democrats who are freaking out after GOP electors voted for President Donald Trump. In fact, there’s a video going viral that theorizes “several paths to victory” available to President Trump. You don’t want to miss this.On Wednesday, the United States Senate Committee on Homeland Security and Governmental Affairs held a  on irregularities in the 2020 election. Trump Attorney Jesse Binall gave testimony on the Nevada cases of alleged fraud that caused many of the Democrat senators to get upset.", "is_fake": 1},
{"date": "December 15, 2020", "title": "MI Election Officials Slam Dominion Forensic Report, Doesn’t End Well", "text": "Michigan election officials are slamming the forensic report on Dominion Voting Systems, the election technology used by Antrim County and elsewhere. However, this didn’t end well for those officials. Don’t miss this.On Monday morning, Circuit Court Judge Kevin Elsenheimer allowed supporters of President Donald Trump to publicly release and discuss information they’ve collected through a forensic analysis of tabulators and data in the 23,000-person Northern Michigan county.The fact that Trump supporters had to go to court to fight the Democrats to release information on these Dominion voting machines says it all.", "is_fake": 1},
{"date": "December 18, 2020", "title": "Staffer Alleges Roberts Exploded While Talking To Other Justices Over Texas Lawsuit", "text": "Texas Congressman Matt Patrick (CD-32) spoke at the Texas presidential electors legislative session and made bombshell allegations against Chief Justice John Roberts. Patrick claimed a SCOTUS staffer’s damning testimony alleges Roberts’ “moral cowardice” lead to a massive fight in chambers over the Texas election lawsuit. Some are now calling for Roberts to step down immediately. Don’t miss this.To be fair, it should be noted that the claim comes with no specific citation for further review or analysis, and considering the heightened sense of concern over the election, more details should be requested before making assumptions about the described incident.“This was written by a current staffer of one of the Supreme Court justices,” Patrick said. “And I’ll just describe the report that I read and you can make of it what you will.”", "is_fake": 1},
{"date": "December 16, 2020", "title": "Special Counsel Investigation Of Hunter Biden Could Be Democrats’ Dream Come True", "text": "President Donald Trump is reported to be pushing for a Special Counsel to investigate Hunter Biden. This could lead to a much bigger crisis than we have witnessed in 2020 and be the Democrats’ dream come true. You don’t want to miss this.If the reports about President Donald Trump are right, then Hunter Biden and all of his dirty deeds will become the topic of a Special Counsel. is", "is_fake": 1},
{"date": "January 6, 2021", "title": "Showdown At Airport Doesn’t End Well For Romney: Trump Supporters Torch Him", "text": "Utah Senator Mitt Romney was waiting for his flight to Washington, D.C. late Tuesday night when Trump supporters questioned his support of Joe Biden and desertion of his own party’s president, Donald Trump. Romney made the mistake of making excuses, and that’s when he got torched. Don’t miss this.“Supporters of President Trump mocked Sen. Mitt Romney at a Utah airport for not supporting the president ahead of Congress certifying the Electoral College results,”  reports.", "is_fake": 1},
{"date": "January 6, 2021", "title": "Kamala Harris Accused Of Lying & Plagiarism In Latest ‘Toddler Freedom Story’", "text": "Kamala Harris is once again embroiled in a huge controversy. This time Joe Biden’s running mate is being accused of lying and plagiarizing Martin Luther King, Jr.’s own testimony about a little girl attending a freedom march in the 1960s. You don’t want to miss this.Kamla Harris is so desperate to be seen as a Civil Rights icon. Her own handlers must think conservatives are too stupid to research the stories she is peddling.“The story of Harris, ostensibly plucked from her childhood memories, opens a ", "is_fake": 1},
{"date": "January 6, 2021", "title": "‘Revolution In Process’: Trump Supporters Storm Capitol Hill, Shots Fired", "text": "Following the “Million Man MAGA Rally” held in Washington, D.C., the Electoral College count started on Capitol Hill. Vice-President Mike Pence issued a statement minutes before the certification process, and many say that it caused Trump supporters to storm Capitol Hill. Then, shots were fired inside the building. Don’t miss this.Total mayhem broke out on Capitol Hill. January 6th is the date millions of patriots were hoping that their voices would be heard. Reports say that half a million to a million Trump supporters trekked to converge on Washington, D.C. as the vice-president presided over the Electoral College count.Many were already in D.C. on Tuesday night. One Twitter user posted a video of patriots singing the national anthem spontaneously in a D.C. eatery.", "is_fake": 1},
{"date": "January 3, 2018", "title": "Neighbor Furious After Glancing Out Window To Make Chilling Find In Doghouse Next Door", "text": "No one likes being known as a nosy neighbor, but sometimes, it’s a good trait to have. When one resident in Connecticut glanced out their window one freezing afternoon, they were left stunned by what they saw. In fact, fury immediately took over, and they quickly called the police when they realized what they had spotted inside the doghouse next door.It all began when the resident of a home, who has remained unidentified, was arrested on drug charges and ended up being away from home for a few months. Unfortunately, in that time, the weather not only got colder but neighbors grew more and more curious about the empty home next door. However, when one particular neighbor looked out their window one frigid afternoon, they made quite the disturbing discovery – a dog was in the doghouse next door.Considering the weather has been extremely cold for quite a while, the neighbor called the police after making the discovery on New Year’s Day, concerned about the dog’s well-being. Officers responded, but unfortunately, they discovered that the dog was already dead.", "is_fake": 1},
{"date": "January 9, 2018", "title": "Thug Does The Unimaginable While Walking Down Road, Not Laughing When Police Get Involved", "text": "A horrifying video is making its rounds on social media after a Louisiana thug decided to do the unimaginable while walking down the road — and it was all caught on video. Too bad for him, things would quickly take a turn as local police not only learned but also saw what he had done – and let’s just say he’s not laughing now that they’re involved.The incident took place in Baton Rouge, Louisiana, while a man was taking two dogs for a walk. In a horrific twist, the thug’s friend decided to whip out his phone and began recording, presumably after the two had discussed what was about to happen moments before the clip began.The punk decided to carry out what people can only describe as the unimaginable while walking some innocent dogs. Clearly seen in the clip that has since been shared by ", "is_fake": 1},
{"date": "January 15, 2018", "title": "Cop Spotted In Middle Of Road, Onlookers Freak When They See What’s In His Bare Hands", "text": "An officer with the Pembroke Police Department in Florida was dispatched to an emergency call after someone spotted something terrifying in the middle of the road. However, once he arrived, onlookers were left freaking out after they saw exactly what he was holding in his bare hands.Officer Joseph Cabrera of the Pembroke Police Department responded to an emergency call on Thursday that would change how everyone looked at him. Luckily for us, the incident was captured on camera, allowing viewers to see exactly what the few witnesses to the incident had seen, and what Officer Cabrera was doing is something few people would have the courage to do themselves.In the short clip, it immediately becomes clear what Officer Cabrera was doing – wrestling with a large snake. It was a 12.5-foot Burmese python, according to ", "is_fake": 1},
{"date": "August 21, 2020", "title": "Delta Airlines Bans Navy Seal Who Killed Bin Laden Over Tweet, He Fights Back", "text": "O’Neill is the SEAL Team Six member who fired three shots into the head of Osama bin Laden during a top-secret May 2011 raid on his hideout in Abbottabad, Pakistan. O’Neill keeps a relatively low profile when in public, so when he posted a tweet from a Delta Airlines, he had no way of knowing leftwing cancel culture would come for him.The Democrat National Convention has fueled the leftists with COVID tales of gloom and doom, and it’s “the end of the world.” GOP pundits joke that Joe Biden’s real running mate is the coronavirus. The Democrat nominee himself has promised one of his first acts as president would be to institute a nationwide mask-wearing.That’s the context surrounding O’Neill’s tweet, and it’s the reason these Biden supporters went nuts after they saw it. Also, many of O’Neill’s Twitter followers are active and retired military, and he loves to banter back and forth with them on social media. Sometimes, the language gets salty.", "is_fake": 1},
{"date": "August 25, 2020", "title": "Patriot Makes BLM Regret Invading His Neighborhood: ‘He’s Shooting at Us!’", "text": "Black Lives Matter protesters invaded a quiet Pennsylvania neighborhood following the police shooting of a black man in Kenosha, Wisconsin. Carloads of BLM supporters descended upon the rural community which caused one patriot to take action. “Get back in the car!” one BLM activist yelled. “He’s shooting at us!” Don’t miss the video which shows BLM fleeing in terror.We saw what can happen when Black Lives Matter activists invade a quiet neighborhood and threaten the homeowners. Mark and Patricia McCloskey, the St. Louis couple who confronted BLM with guns, were making their speech at the RNC convention at the same time Black Lives Matter was descending on a neighborhood in Bedford County, Pennslyvania.This was all part of the riots and protests that erupted Monday night in Kenosha following an officer-involved shooting Sunday, and the “protests” began to spread to other cities.", "is_fake": 1},
{"date": "August 31, 2020", "title": "BLM Founder Demands Hollywood Strike Over Blake Shooting, Gets Epic Smackdown", "text": "Black Lives Matter (BLM) co-founder Patrisse Cullors has demanded that the entertainment industry goes on strike in response to the shooting of Jacob Blake, arguing that “Hollywood can really show up in this moment.” Well, that’s when Cullors got an epic smackdown she never saw coming. You’ll love this.Back in 2015, Patrisse Cullors was  on video saying that she and her fellow BLM organizers are “trained Marxists” – making clear their movement’s ideological foundation.", "is_fake": 1},
{"date": "September 25, 2020", "title": "John Legend: If Trump Wins, Americans Must Consider Leaving US — Gets Torched", "text": "Musician John Legend and his ex-model wife Chrissy Teigen have announced a new spin to the celebrity class vow from 2016 to leave America if Donald Trump won. Now, Legend has upped the ante by saying all Americans must consider leaving the United States if Trump wins in 2020. Well, that’s when they got torched by patriotic Americans. You’ll love this.It looks like singer John Legend and his wife Chrissy Teigen got their feelings hurt by President Donald Trump, and now they are urging Americans to leave the United States if he wins re-election.Legend and his wife Chrissy Teigen recently gave ", "is_fake": 1},
{"date": "September 28, 2020", "title": "Bette Midler Tells Biden ‘Kick Trump In The Nuts’ At 1st Debate, Gets Torched", "text": "Bette Midler is feeling really good about Joe Biden’s upcoming debate on Tuesday night. In fact, the 74-year-old leftwing actress gave the former vice president some advice. “You will be going toe to toe with a stupid, but wily street fighter,” Midler said. “My advice is kick him in the nuts! And then do it again for the 200,000 people he murdered!” Well, that’s when poor Bette got torched by patriotic Americans. You’ll love this.Far-left actress Bette Midler has urged Democratic nominee Joe Biden to kick President Donald Trump “in the nuts” during the first presidential debate, and Midler says Biden should pummel the president on behalf of the 200,000 people she says he “murdered.”“I have to say this to #VicePresidentBiden, who is much more conservative than I ‘Sir, on Tuesday night you will be going toe to toe with a stupid, but wily street fighter, ” Midler wrote on Twitter. “My advice is ‘KICK HIM IN THE NUTS!’ And then do it again for the 200,000 people he murdered!”", "is_fake": 1},
{"date": "October 12, 2020", "title": "Stevie Nicks Talks Leaving Earth For Space If Trump Wins, Patriots Torch Her", "text": "Rocker Stevie Nicks, who was the lead singer of Fleetwood Mac, is contemplating leaving the United States if President Donald Trump wins re-election, saying that she is considering an extraterrestrial existence. “And I’m thinking: Oh, space. Maybe I can talk Elon Musk into giving us a jet,” she said. Nicks sees America as “undeniably racist.” She is a huge supporter of Black Lives Matter. Well, poor Stevie got torched by patriotic Americans. You’ll love this.Stevie Nicks is considering leaving the United States if President Donald Trump wins re-election, believing America is much more racist now than four years ago.“And I’m thinking: Oh, space. Maybe I can talk Elon Musk into giving us a jet and letting me pick 50 people,” she ", "is_fake": 1},
{"date": "December 10, 2020", "title": "4 GOP Senators Will Attend Soros-Linked Open Borders Summit, They Get Torched", "text": "If there is one thing that this election has done, it has exposed the “traitors” to the MAGA agenda. Steve Cortes, who is one of President Donald Trump’s senior advisers, is alerting Americans to the danger these four GOP senators pose who are rushing to enable open borders policies by attending a pro-amnesty summit. You don’t want to miss this.If by some nefarious means Joe Biden makes it to the Oval Office, he has already shown his cards on immigration. At the presidential debate in Nashville on October 22, Biden claimed that “we owe them,” referring to illegal immigrants.“The only debt owed by elected leaders is to the citizens of this great republic: the people who consent to being governed,” Cortes", "is_fake": 1},
{"date": "December 10, 2020", "title": "Hillary: Trump Hurting Our Democracy, No Evidence Of Fraud – Americans Destroy Her", "text": "Hillary Clinton appeared to be in meltdown mode as she lashed out at President Donald Trump. “The election was not close. There was no evidence of fraud,” Clinton stated. “Yet Trump continues to try to overturn the election at the expense of our democracy. The emperor has no clothes. Republican electeds who continue to humor him have no spines.” Well, that’s when Americans destroyed her. Don’t miss this.The irony of Hillary Clinton making these accusations about the 2020 election is about as good as it gets. Everyone in the free world can’t forget that it was the failed Democrat candidate who claimed Trump was an “illegitimate” president and Russia had helped get him elected.“If I had been elected president under the same circumstances … and evidence came up that the Russians for whatever reason were trying to help me, I would have said on the first day in office, ‘We’re going to launch the most thorough investigation, ” Clinton", "is_fake": 1},
{"date": "December 11, 2020", "title": "Rep. Cynthia Johnson Drops Bombshell: ‘Biden & Harris Owes The City Of Detroit’", "text": "Democratic State Rep. Cynthia Johnson (MI) is infamous for threatening “Trumpers” a few days ago, but she is the gift that just keeps on giving. Even though Johnson was publicly chastised and “stripped of all her committees,” she refuses to stop making videos. Johnson directed her latest tirade to the “Biden-Harris administration,” claiming they “owe the city of Detroit.” Owe them for what? Well, you don’t want to miss her entire statement.Last week Michigan Democrat lawmaker Cynthia Johnson harassed and intimidated Michigan witnesses who testified about alleged voter fraud in the 2020 election.She attacked IT specialist Hima Kolanagireddy as a “liar,” after the Michigan poll watcher gave testimony about the Dominion tabulators and backed up the testimony of Melissa Carone, another IT specialist that was contracted by Dominion to work at the TCF Arena in Detroit.", "is_fake": 1},
{"date": "December 11, 2020", "title": "WI Nursing Home Resident Tried To Vote Trump, Staffer Allegedly Made Sure She Didn’t", "text": "On Friday, Wisconsin held a hearing on its election irregularities. Witnesses testified that very disturbing things happened in nursing homes. One elderly resident named “Susan” tried to vote for President Donald Trump, and that’s when a staffer allegedly “made sure she didn’t.” You don’t want to miss what this nursing home staffer did to the poor woman, and it was just one of many allegations involving Wisconsin nursing homes.One investigator looking into alleged election crimes in Wisconsin nursing homes was one of the most compelling witnesses at Friday’s hearing. This goes to the very heart of the election integrity issues facing Americans.This brings us to the testimony of the election investigator.", "is_fake": 1},
{"date": "December 14, 2020", "title": "Americans Torch Hillary For Saying: ‘Her Name Is Dr. Jill Biden, Get Used To It!’", "text": "Hillary Clinton tried to come to Jill Biden’s rescue over the weekend after a  article suggested she stop calling herself “Dr. Jill Biden.” They claimed she isn’t a medical doctor but just a Ph.D. “‘Dr. Jill Biden’ sounds and feels fraudulent, not to say a touch comic,” it read. Well, that’s when Hillary came out guns a-blazing and said: “Her name is Dr. Jill Biden. Get used to it.” Americans torched her. You’ll love this.God help us if Joe and Jill Biden make it to the Oval Office. The 69-year-old former second lady is to blame for allowing the Democrats to push her allegedly cognitively impaired husband to be the “front man” for what many conservatives believe is a third term for Barack Obama.", "is_fake": 1},
{"date": "December 11, 2020", "title": "Chris Wallace Blocked Trump From Asking Joe Biden About Hunter, Now He’s Torched", "text": "We all remember Chris Wallace moderating the first debate and his disdain for President Donald Trump. The president tried to press Joe Biden about his son Hunter’s foreign entanglements which could become a national security disaster if Biden won. However, Wallace cut the president off and stated the Hunter allegations were unproven nonsense. Now, poor Chris is getting utterly torched for jeopardizing our nation.One of the worst things a journalist can be accused of doing is performing their job so badly that it leads to a potential national security crisis. Well, that sums up Chris Wallace.We can’t solely blame Wallace for backing the leftwing narrative that buried the Hunter Biden accusations, but we can solely blame him for being the one man who stopped the president from alerting millions of Americans to the allegations on national TV.", "is_fake": 1},
{"date": "December 14, 2020", "title": "MI Judge Emergency Order Releases Forensic Findings Of Dominion Voting Machines", "text": "On Monday morning, Michigan Circuit Court Judge Kevin A Elsenheimer granted an emergency order to release the forensic findings of 16 Dominion voting machines. Lawyers affiliated with the Democratic Party had attempted to block the order. The “bombshell” forensic findings are going viral and causing many Americans to demand action in states where the Dominion machines were used.This morning, during an emergency hearing, MI 13th Circuit Court Judge Kevin A Elsenheimer granted permission to Attorney Matthew DePerno to release the from their forensic examination of 16 Dominion Voting machines in Antrim County, MI, where thousands of votes flipped from President Trump to Joe Biden on November 3, 2020.", "is_fake": 1},
{"date": "December 14, 2020", "title": "WI Supreme Says ‘Election Officials Were Wrong,’ Ruling Not Good For Team Biden", "text": "The mainstream media were quick to report that one of the cases before the Wisconsin Supreme Court did not end in favor of President Donald Trump and his supporters. However, there was another case before the Wisconsin Supreme Court, and the court said the election officials were wrong. You don’t want to miss this.The Wisconsin Supreme Court , which was released Monday morning, says local elections officials were wrong to suggest that voters could claim the status of “indefinitely confined” based on COVID-19.", "is_fake": 1},
{"date": "December 15, 2020", "title": "Whitmer Sent State Troopers Who Blocked MI GOP Electors, Gets Rude Awakening", "text": "Michigan Gov. Gretchen Whitmer sent state troopers who blocked the GOP electors from entering the state capital building to cast their votes for President Donald Trump. The showdown was caught on video. It didn’t end well for Whitmer as she got a rude awakening. Don’t miss this.Republicans in Pennsylvania, Arizona, Georgia, Wisconsin, New Mexico, and Nevada entered competing slates of electors for President Donald Trump on Monday as Electoral College members in six contested battleground states officially cast their ballots for Democrat Joe Biden.“By casting conditional votes for Trump, the GOP electors have set up an epic showdown in a joint session of Congress next month when lawmakers convene to count the electoral votes and officially declare the winner,” ", "is_fake": 1},
{"date": "December 15, 2020", "title": "Mo Brooks: Trump Won Electoral College, Time To Do Right Thing — Democrats Freak", "text": "Rep. Mo Brooks (R-AL) is leading the charge “to do the right thing” when the electors meet on Capitol Hill on January 6. Brooks appeared on Fox Business’ “Lou Dobbs Tonight” to outline the steps he will be taking, claiming: “Trump won the Electoral College. I can either sit back and surrender and be a part of the surrender caucus, or I can fight for our country.” Well, that caused the Democrats to freak out. Don’t miss this.Monday during an appearance on “Lou Dobbs Tonight,” Rep. Mo Brooks (R-AL) vowed not to go down without a fight. Electors certified their states for Joe Biden on December 14.However, GOP electors also certified the election for President Donald Trump in Pennslyvania, Georgia, Michigan, Arizona, New Mexico, Wisconsin, and Nevada.", "is_fake": 1},
{"date": "July 28, 2020", "title": "Teacher Reveals Union-Backed BLM Curriculum For All Students, Parents Step In", "text": "School boards are ready to implement the Black Lives Matter curriculum for students starting at kindergarten all the way through high school. One teacher was so disgusted by what she saw, she revealed the plans to parents. Well, that’s when parents of all political backgrounds decided they needed to “step in.” Don’t miss this.A few weeks ago,  Laura Ingraham exposed a Virginia school board attempting to implement the BLM curriculum. Now, on the west coast, we are finding the same thing. ", "is_fake": 1},
{"date": "August 4, 2020", "title": "Oprah: ‘Whiteness Gives You An Advantage No Matter What’ – Americans Torch Her", "text": "Oprah Winfrey, who made billions as an African-American director and producer, made the wild accusation during a live-stream session on Monday that being “white gives you an advantage no matter what.” The mega-rich media mogul claimed: “[Whites have a] leg up. You still have your whiteness. That’s what the term ‘white privilege’ is.” Well, poor Oprah immediately got torched by patriotic Americans. You’ll love this.Billionaire media mogul Oprah Winfrey declared in an episode of her eponymous series, The Oprah Conversation, that “whiteness” and “white privilege” afford unspecified benefits to white people in the “caste system” of America.In an episode entitled “Uncomfortable Conversations with a Black Man: Part 1” — featuring former NFL linebacker Emmanuel Acho and drawing its name from Acho’s YouTube series of the same name — Oprah Winfrey invited several white people to discuss “racism,” “white privilege,” and “whiteness.” Oprah praised her white guests for accusing themselves of being “racist.”", "is_fake": 1},
{"date": "July 29, 2020", "title": "‘Hope You All Die!’: Unhinged Shopper Wishes Death On Un-Masked Kids, Regrets It", "text": "A video is going viral of an unhinged Walmart shopper screaming at a mom and her kids. The shopper went nuts when she saw that the kids were not wearing masks. “I hope you all die!” she yelled at the little girls. Well, she was quickly made to regret it. You’ll love this.An unhinged masked woman at a Walmart in Georgia was filmed screaming at a mother and telling her children she “hopes” they “all die” because they weren’t wearing masks.The woman, who has been whipped into a frenzy by the leftwing media, believed the kids were going to “kill” her by not wearing masks.", "is_fake": 1},
{"date": "August 4, 2020", "title": "BLM Uses ‘Mafia Tactics’ On Cuban-American Business Owners… Who Fight Back", "text": "Black Lives Matter has been caught using “mafia tactics” on Cuban-American business owners who are true patriots. BLM has threatened their establishments if they don’t agree to their ridiculous demands. Well, those business owners immediately fought back, making them regret it. You’ll love this.The Louisville cadre of Black Lives Matter activists sent a letter to many downtown businesses demanding they “diversify” their employees. But at least one Cuban-American business owner objected to the threatening tone of the letter and posted his displeasure on Facebook.Fernando Martinez owns a restaurant group with several Hispanic eateries. He accused BLM of using “mafia tactics” and explained his position.", "is_fake": 1},
{"date": "August 5, 2020", "title": "Oprah: White People Get ‘Woke’ To Your ‘Unconscious’ Racism, Gets Reality Check", "text": "Oprah Winfrey held part two to her live-stream Apple TV series on Tuesday night. The billionaire media mogul advised “white people” to get “woke” to their own “unconscious racism.” In other words, white Americans might think they are not racists, but deep-down they are. She also claimed that “first-degree racism” is still happening in America. Well, that’s when poor Oprah got a big reality check she never saw coming. You’ll love this.Ever since Black Lives Matter got a huge boost in support following the death of George Floyd, the Marxist organization is pushing celebrities, professional sports teams, and big-named companies to spew their propaganda.One billionaire celebrity who is spewing BLM’s talking points is Oprah Winfrey. Using made-up terms like “white privilege” and “unconscious racism,” the African-American media mogul sees herself as a confessor to help white Americans accept they are all racists.", "is_fake": 1},
{"date": "August 10, 2020", "title": "Oprah: ‘Whiteness Gives You Advantage No Matter What’ — NY POST Trashes Her", "text": "Oprah Winfrey isn’t accustomed to getting bad publicity. This is why the billionaire media mogul must be freaking out after the New York Post took her to task for claiming that “whiteness” and “white privilege” afford unspecified benefits to white people in the “caste system” of America. Oprah’s racist accusations got trashed badly and it exposed her blatant hypocrisy. You’ll love this.Billionaire media mogul Oprah Winfrey declared in an episode of her eponymous series, , that “whiteness” and “white privilege” afford unspecified benefits to white people in the “caste system” of America.", "is_fake": 1},
{"date": "August 11, 2020", "title": "VIDEO: Antifa Attempts Mayhem In Quiet Neighborhood, Residents Give Rude Awakening", "text": "Antifa has broadened its horizons when it comes to bringing riots and mayhem. When a pack of Antifa showed up in a quiet suburban neighborhood over the weekend, the residents gave them a rude awakening they won’t ever forget, and it was all captured on video. You’ll love this.Residents of Fort Collins, Colorado planned a “Back the Blue” rally in their own neighborhood over the weekend. Just as the rally was getting started, a pack of Antifa activists showed up to start mayhem.Several dozen pro-police protesters were walking alongside the veteran in the wheelchair, who was carrying an American flag, as they then seemingly forced the Antifa activists out of the neighborhood.", "is_fake": 1},
{"date": "August 13, 2020", "title": "Navy Seal Who Killed Bin Laden Has 1 Message For BLM & Antifa — They Go Nuts", "text": "Robert O’Neill is the Navy Seal who killed Osama bin Laden. He also is a noted supporter of President Donald Trump. Well, O’Neill has one message for Black Lives Matter and Antifa activists, and they didn’t like it. You’ll love this.Robert O’Neill is very outspoken when it comes to the state of the nation. He and the rest of SEAL Team 6 are immortalized as American heroes, and he definitely has some strong opinions on the riots and the so-called “peaceful protesters” behind them.O’Neill has since retired from the military. He noted that the “Democrat-run cities” have descended into mayhem and chaos. As the riots kicked off at the end of May, O’Neill had a message for the BLM and Antifa “rioters.”", "is_fake": 1},
{"date": "August 14, 2020", "title": "Dolly Parton Confuses Fans With Remark Supporting ‘Black Lives’ – But Not BLM", "text": "Dolly Parton was put on the hot seat by Billboard Magazine. They asked the country icon about Black Lives Matter. Her answer is confusing many conservative fans, while others note she stopped short of supporting BLM. Don’t miss this.Dolly Parton has weighed in on the Black Lives Matter debate, offering an apolitical answer that seems designed to avoid controversy over the far-left, anti-police group and keep her in good graces with the media and her fans.While many are saying they wished she would have spoken out against BLM, the leftwing CNN jumped on her statement ", "is_fake": 1},
{"date": "October 15, 2020", "title": "Ice Cube Comments On Working With Trump Admin On Big Project, Democrats Freak Out", "text": "Rapper Ice Cube, who trashed the president in the past, is now working with the Trump administration. Immediately, the 51-year-old African-American was under attack by rabid Democrats and Joe Biden supporters. That’s when Ice Cube retaliated by making it clear why he is working with the president, and it only made then leftists freak out more. You’ll love this.This might be the worst thing that happened to the Biden campaign in a few days. Ice Cube was forced to make a statement about working with the Trump administration, which caused his African-American fans to look into what was going on.It all started after Trump 2020 adviser Katrina Pierson tweeted, “Shoutout to @icecube for his willingness to step up and work with @realDonaldTrump Administration to help develop the #PlatinumPlan…Leaders gonna lead, haters gonna hate. Thank you for leading!”", "is_fake": 1},
{"date": "August 19, 2020", "title": "Oprah Explains How Americans ‘Use Whiteness As A Weapon,’ Patriots Torch Her", "text": "Oprah Winfrey launched a podcast to teach white Americans how racist they are. In her first podcast at the beginning of August, the billionaire media mogul claimed that being “white gives you an advantage no matter what.” Now, in her new episode, she is endeavoring to explain how Americans “use whiteness as a weapon.” Well, that’s when patriots utterly torched her. You’ll love this.Leave it to one of the richest women in the world, who happens to be black, to lecture Americans how racist the United States still is. Oprah Winfrey has totally bought everything Black Lives Matter stands for, and now she sees it as her place to teach white Americans about how they “use whiteness as a weapon.”In an episode aptly titled “How to Be an Antiracist,” Winfrey referred to a May incident in New York City’s Central Park in which a white woman, Amy Cooper, called the police on a black man, Christian Cooper, following a dispute involving the woman’s dog.", "is_fake": 1},
{"date": "October 14, 2020", "title": "Rocker Tommy Lee Swears He Will Leave U.S. If Trump Wins, Gets Rude Awakening", "text": "Mötley Crüe drummer Tommy Lee is swearing to leave the United States if the president wins re-election. Lee is like so many in the Hollywood crowd who made the same promise in 2016, but they never left. “Dude, I swear to God if that happens then I’m coming over to visit the UK. I’m out of here,” Lee claimed. Well, that when the aging rocker got a rude awakening he never saw coming. Don’t miss this.Mötley Crüe drummer Tommy Lee has made the promise that many left-wing celebrities have made before and failed to honor — leaving the United States if Donald Trump wins the presidency.The 58-year-old rocker, who looks like he is much older thanks to hard living, ", "is_fake": 1},
{"date": "October 16, 2020", "title": "Springsteen Promises To Flee To Australia If Trump Wins, Gets Brutal Smackdown", "text": "In a recent interview with the Australian press, rocker Bruce Springsteen vowed he would be packing up and leaving the United States for Australia if President Donald Trump wins re-election. Springsteen even had the gall to smear working-class Americans, who he blames for the Trump presidency. Well, that’s when poor Bruce got a brutal smackdown he never saw coming. You’ll love this.Bruce Springsteen will pack up and flee to Australia should Donald Trump win re-election in November, he warned Thursday during a virtual interview with Down Under media outlets.The singer-songwriter also added he thought Trump would be no match for former Vice President Joe Biden, predicting he would lose.", "is_fake": 1},
{"date": "October 20, 2020", "title": "‘Happy Days’ Cast Reuniting To Flip Wisconsin For Biden, Americans Torch Them", "text": "The 1970s sitcom “Happy Days” represented a slice of middle America. But not anymore. Ron Howard, the leftwing director who starred as “Richie Cunnigham,” is reuniting the cast in a last-ditch attempt to flip Wisconsin for Joe Biden. Well, one cast member is a huge supporter of the president, and he blasted them. Then, Americans torched Howard and his ridiculous reunion. You’ll love this.What makes the oldtimers of the  cast think Wisconsin voters would give two cents about what they want in this upcoming election? We know this comes from leftwing activist Ron Howard, who starred in the 70s and 80s sitcom as “Richie Cunnigham.”", "is_fake": 1},
{"date": "September 10, 2020", "title": "ESPN To Televise “Social Justice” & Singing Of Black National Anthem – Regret It", "text": "ESPN is scheduled to launch the National Football League games and has made a major announcement about the pre-game festivities. The players have said they will protest, and ESPN says they will televise it. But that’s not all. ESPN is proud to announce they will also televise the singing of the “black national anthem,” which will be sung five minutes before kickoff. Well, that’s when Americans gave them all a huge reality check.The NFL and ESPN just put the final nail in their own coffins.Normally, ESPN only shows the honor guard and singing of the ", "is_fake": 1},
{"date": "September 14, 2020", "title": "Black ‘Queen’ Berates Passengers on Their White Privilege, Gets Brutal Smackdown", "text": "A woman, who identified herself as a “black queen from California,” attacked white passengers on a recent flight. She claimed they needed to “bow down to her blackness” and stop their “white privilege.” After ranting and raving for two minutes, the “black queen” got a brutal smackdown she won’t soon forget. Don’t miss this.On a recent airline flight, a presumed Black Lives Matter supporter berated her fellow passengers on their “white privilege” and proclaimed that she is a “black queen.”The left has clearly given up on civility. Their new method of operation involves screaming in people’s faces.", "is_fake": 1},
{"date": "October 21, 2020", "title": "List Of Hollywood Celebrities For Trump Goes Viral, Democrats Explode", "text": "We always hear about the Hollywood leftists who are constantly reminding us of their sheer hatred of President Donald Trump. So, it was refreshing to find a list of 19 Hollywood celebrities who support the president, and it is going viral. Many Americans were surprised to learn there is a growing trend in Hollywood to support Trump, and that’s causing the Democrats to explode. You’ll love this.Hollywood star Kirstie Alley’s announcement that she is voting for President Donald Trump unleashed a firestorm of vitriol from the left against the Emmy-winning Cheers actress. But it also placed her in a growing list of celebrities who have been brave enough to publicly declare their support for the president.Kirstie Alley says she s voting for Trump because of Biden s \"racial slurs.\" ", "is_fake": 1},
{"date": "September 14, 2020", "title": "Sharpton: LA Cop Shooter Was Plant To Make BLM Look Bad, Gets Rude Awakening", "text": "Reverend Al Sharpton is weighing in on the recent shooting of two Los Angeles County deputies who were ambushed and shot in their heads at point-blank range in their patrol vehicle. Sharpton told MSNBC that he “suspects” the shooter, who is still at large, must be a “plant” to make the Black Lives Matter movement “look bad.” Well, that’s when poor Al got a rude awakening. Don’t miss this.MSNBC’s  program was like watching an alternate reality on Monday. Host Joe Scarborough began his segment by asking Al Sharpton for his message to the “", "is_fake": 1},
{"date": "October 7, 2020", "title": "Oprah: Nazi Germany Copied America’s Racial ‘Caste System,’ Gets Brutal Reality Check", "text": "Oprah Winfrey is once again playing the race card claiming Nazi Germany rose to power thanks to our “caste system.” Oprah claims America has a “caste system” based on race. If you were born a person of color, you had no chance to succeed in America, according to her. Well, that’s when the billionaire TV mogul got a brutal reality check. You’ll love this.Oprah Winfrey described America’s “caste system” as “the template for Nazi Germany” in an interview with Isabel Wilkerson, author of  for the latest episode of her Apple TV series, Oprah’s Book Club.", "is_fake": 1},
{"date": "October 29, 2020", "title": "Girl Scouts Quickly Apologizes After Backlash Ensues Over Tweet Recognizing Women Who Have Been Appointed To SCOTUS", "text": "Although the left claims to be a champion for all women, it’s becoming evident that their support for females does indeed depend on party lines. The Girl Scouts found this out after “highlighting the five women who have been appointed to the Supreme Court” in a tweet. The problem? One of those five women was Justice Amy Coney Barrett, and the organization had congratulated her.“Congratulations Amy Coney Barrett on becoming the 5th woman appointed to the Supreme Court since its inception in 1789,” Girl Scouts wrote on Twitter on Wednesday in a since-deleted tweet, featuring portraits of all five women who have sat on the highest court in the federal judiciary of the United States of America.Official ", "is_fake": 1},
{"date": "November 5, 2020", "title": "3rd-Grader Forced To Remove Mask Due To Its ‘Inappropriate’ Message, Lawsuit Filed", "text": "A third-grader was forced to remove her mask due to the inappropriate message that it displayed, which the principal claimed went against school policy. A lawsuit has since been filed.Lydia Booth, a 9-year-old, Mississippi third-grader, has aspirations of becoming a missionary, so she chose a mask that expressed her beliefs. Unfortunately, when she wore the mask to Simpson Central Elementary School in Pinola on October 13th, her principal ordered her to remove it due to the message it displayed.In pink letters on black fabric, Lydia’s mask read, “Jesus Loves Me.” Claiming the mask’s message was inappropriate because it went against district policy, the principal told Lydia to remove it. She was then given another mask to wear with no message on it, according to her parents, Matthew and Jennifer Booth, ", "is_fake": 1},
{"date": "November 11, 2020", "title": "Watch Wisconsin School Board Meeting Descend Into Chaos As Black Lives Matter Protesters Chant & Intimidate Board Members", "text": "A Wisconsin school board meeting descended into chaos when Black Lives Matter protesters clashed with members, began chanting, and disrupted the meeting. Sadly, that was only the beginning as police would have to come in and escort members out. Don’t miss this.A meeting of the Burlington Area School District Board of Education in Burlington, Wisconsin, descended into chaos when Black Lives Matter protesters succeeded in disrupting and shutting down the meeting after they angrily confronted board members over an anti-racist curriculum, according to .", "is_fake": 1},
{"date": "November 28, 2018", "title": "California County Tackles Top Crisis Facing Our Country: Tiny Plastic Shampoo Bottles", "text": "The state of California is facing numerous crises. Thousands of migrants storm their borders. Homelessness is at epidemic levels. High taxes and government regulation are driving businesses away. But one California county has decided to solve the  problem plaguing our country — hotel shampoo bottles.Since Donald Trump entered the White House, the state of California has been in meltdown mode. It seems their liberal supermajority has decided to oppose every common-sense initiative proposed by Trump to help the country.", "is_fake": 1},
{"date": "December 12, 2018", "title": "Environmentalists Go Too Far — CNN Offers Nasty Replacement For Hamburgers", "text": "For years climate alarmists have demanded we give up eating beef in order to “save” the planet. Their erroneous claims state that raising cattle is more damaging to the environment than all the smog-producing factories in China. In order to win us over to their thinking, they have offered this beef alternative for your burgers. You’re gonna hate this.We know that environmentalism isn’t about saving the planet. Researchers  over the causes of so-called global warming. Many ", "is_fake": 1},
{"date": "December 21, 2018", "title": "Ruth Bader Ginsburg Undergoes Surgery — It Doesn’t Look Good", "text": "The Supreme Court announced on Friday that Justice Ruth Bader Ginsburg had undergone surgery for lung cancer. It doesn’t look good for the judge, who just last month took a nasty fall, breaking several ribs.“Justice Ruth Bader Ginsburg underwent a pulmonary lobectomy today at Memorial Sloan Kettering Cancer Center in New York City,”  “Two nodules in the lower lobe of her left lung were discovered incidentally during tests performed at George Washington University Hospital to diagnose and treat rib fracturessustainedin a fall on November 7.”", "is_fake": 1},
{"date": "January 30, 2019", "title": "VIDEO: Guy Drags Plastic Bag Along Windshield, You’ll Be Racing To Try This Trick", "text": "With the Midwest experiencing record-low temperatures, a Facebook video has gone viral showing a driver dragging a plastic bag along his car’s windshield. When I realized why he was doing it, I was racing to try the nifty trick, too.The Midwest is currently experiencing dangerously low temperatures. In some spots, it’s even colder than Antarctica. The temperature has dropped so low, in fact, that most residents have not experienced this type of cold in their lifetimes and are unlikely to ever again.Heavy snow and powerful wind created blizzard-like conditions Monday across parts of the Midwest, prompting officials to cancel about 1,000 flights at Chicago’s airports and close hundreds of schools.", "is_fake": 1},
{"date": "July 13, 2020", "title": "‘Kids Will Die Going Back To School’: Whoopi & Crew Trashed For COVID Nonsense", "text": "Whoopi Goldberg and her crew are freaking out over kids returning to school this fall. Armed with misinformation and spewing unhinged rants about President Donald Trump, Goldberg, who wore a crown, did her best to scare her viewers into believing kids will die going back to school this fall. Well, that’s when she and her crew got trashed by the truth. You’ll love this.Now that most of the Black Lives Matter and Antifa protests are winding down, the Democrats and their cohorts need to make sure Americans continue to be off-balance and believe that things will never return to “normal.”Being extra sarcastic, Whoopi Goldberg claimed the Trump administration is “acting dangerously” by encouraging schools to open across the country this fall.", "is_fake": 1},
{"date": "January 4, 2019", "title": "Man Bites Into Chipotle Burrito — Finds Nasty ‘Side Item’ In His Food", "text": "A man in Massachusetts visited a local Chipotle restaurant for dinner. He purchased a burrito to satisfy his cravings. But very soon after he began his meal, he discovered something was wrong — big time.Chipotle is a popular Mexican-food restaurant chain. Their stores seem to be popping up everywhere. In New York, you can witness lines of people outside the restaurants, come the lunch rush. It seems like everybody can’t get enough of their trademark overstuffed burritos and bowls.Nicolas Ramos was one of the millions who frequent this restaurant. It was a usual Thursday evening when he picked up a chicken burrito for dinner. The Saugus Chipotle was his favorite stop when he was hungry for an easy dinner.", "is_fake": 1},
{"date": "July 30, 2020", "title": "Fauci: Wear Goggles Or Eye Shields To Prevent Spread Of COVID-19; Regrets It", "text": "Doctor Anthony Fauci is now advocating wearing “googles or eye shields” to prevent the spread of Covid-19. Well, one Yale epidemiologist blasted Fauci for “running a misinformation campaign.” Don’t miss this.Dr. Anthony Fauci suggested Wednesday that Americans should consider wearing goggles or a face shield in order to prevent spreading or catchingCOVID-19.“If you have goggles or an eye shield, you should use it,” the infectious disease expert ", "is_fake": 1},
{"date": "July 30, 2020", "title": "Trump-Hater Madonna Got ‘Rude Awakening’ When She Posted Info On COVID-19", "text": "Madonna, who is a noted hater of President Donald Trump, got a rude awakening she never saw coming after she posted information about the coronavirus to her Instagram account. You’ll love this.Madonna loves to keep her image fresh and trendy. At 61-years-old, the pop icon found out what it’s like to be a conservative in America today when she posted a coronavirus video to her Instagram account.The pop star got flagged on Instagram for posting a video of an event from the America’s Frontline Doctors press conference this week that ", "is_fake": 1},
{"date": "August 31, 2020", "title": "CDC Data Shows Number Of COVID Deaths With Comorbidities – Democrats Explode", "text": "The Centers for Disease Control and Prevention website shows how many people who died from COVID-19 had comorbidities. Some Democrats are claiming it is another rightwing conspiracy theory. You’ll love this. to the CDC: “For 6% of the deaths, COVID-19 was the only cause mentioned. For deaths with conditions or causes in addition to COVID-19, on average, there were 2.6 additional conditions or causes per death.”The following are the top underlying medical conditions", "is_fake": 1},
{"date": "October 1, 2020", "title": "Chrissy Teigen Stages Hospital ‘Photo Op’ During Miscarriage — Fans Torch Her", "text": "Chrissy Teigen suffered a miscarriage on Wednesday night. The former model and wife of John Legend was reportedly about halfway through her third pregnancy. However, what is making headlines is the strange “photo-op” Teigen posted on social media. In fact, even her fans are torching Teigen and wondering what she was thinking. Don’t miss this.Chrissy Teigen took to social media during her miscarriage at Cedar-Sinai Hospital in Los Angeles. The 34-year-old mother of two and her musician husband have been very vocal about their support of abortion and Planned Parenthood.Teigen and Legend have often taken to their social media accounts to support Planned Parenthood, and they are not shy about claiming Trump and his supporters are backward hillbillies for being anti-abortion.", "is_fake": 1},
{"date": "October 22, 2020", "title": "‘Peanuts’ Holiday Specials Will Not Appear On Network TV For 1st Time In Decades, Thanks To Apple — Folks Are Furious", "text": "The year 202o has been a doozy, to say the least. The coronavirus, quarantine, social separation, distance learning, massive unemployment, rioting, violence in the streets, and a heated presidential race are just a few of the things we’ve had to endure. With the holidays headed our way, however, we were ready for a bit of reprieve from the year from hell.Most of us were maintaining hope that some holiday traditions would give us an escape from the troubling reality that has been 2020, but instead, it appears we will be facing even more disappointment. For decades, many families have looked forward to watching the “Peanuts” holiday specials that aired on network television every year, but in 2020-fashion, there’s been a wrench thrown in those plans.Thanks to Apple, the iconic holiday specials won’t appear on network TV. “Since Apple TV+ acquired exclusive rights to the entire library of Charles Schulz’s animated specials, for the first time since 1965 those ‘Peanuts’ specials — ‘It’s the Great Pumpkin, Charlie Brown,’ ‘A Charlie Brown Thanksgiving,’ and ‘A Charlie Brown Christmas’ — can be seen only on Apple TV+,” ", "is_fake": 1},
{"date": "October 26, 2020", "title": "Cher Bombs For Biden At Las Vegas Rally: ‘I’ll Wave Goodbye & That Will Be It’", "text": "Cher, the pop icon who has been one of the biggest haters of President Donald Trump on social media, agreed to appear at a Joe Biden rally in Las Vegas over the weekend. Poor Cher became upset and bombed. The Biden campaign really screwed this up, big time. You don’t want to miss this.There is something really interesting going on. Pollsters tell us Joe Biden is still eking out a lead over President Trump nationwide. However, on the ground reports of spontaneous “rallies” for Trump combined with his planned rallies show a much different story.“A combination of what I would call ‘old school’ activism is taking place everywhere. Car parades, boat parades, marches, rallies, and massive swarms of American MAGA supporters are literally flooding the political space on a scale that makes it impossible to ignore,” ", "is_fake": 1},
{"date": "October 27, 2020", "title": "VIDEO: ‘Scared’ Cardi B Freaks Out: ‘Trump Supporters Are Everywhere,’ Swarming LA In ‘Big A** Trucks’", "text": "Cardi B, an American rapper and Joe Biden surrogate, was terrified when she recently observed groups of Trump supporters on the streets of Los Angeles, California. Although she was safe in her vehicle, the liberal performer, who was born in Manhattan and raised in the Bronx, was so frightened that she took to video to express her horror.“I don’t like this shit!” she screeched as she screamed in horror, claiming Trump supporters were swarming LA in their “big ass trucks.”According to ", "is_fake": 1},
{"date": "October 27, 2020", "title": "Brad Pitt: Joe Biden ‘Will Be President For All Americans,’ Gets Rude Awakening", "text": "Brad Pitt is embracing Joe Biden in a big way. The leftwing actor just narrated a pro-Biden ad in which he states that the 77-year-old Democrat is the only man who can “unify” the country. “He will be president for all Americans,” the actor claims. Well, that’s when poor Brad got a rude awakening from patriotic Americans. You’ll love this.Actor Brad Pitt has thrown all the way down for Joe Biden, voicing an ad for the Democratic presidential nominee that aired Saturday night during the World Series. The ad will be carried in different markets until Election Day.“America is a place for everyone,” Brad Pitt ", "is_fake": 1},
{"date": "October 29, 2020", "title": "Trump Gives Bruce Springsteen & His Fellow ‘Rock n Roll’ Buddies Reality Check", "text": "President Donald Trump is in the home stretch of the presidential campaign. Trump is ramping up his rallies nationwide. This is causing Bruce Springsteen and his fellow “Rock n Roll” buddies to demand the Trump campaign stop using their songs at the rallies. Well, that’s when the president gave them all a big reality check. You’ll love this.Campaigns have been turning popular songs into theme songs for more than a century, and American artists have been objecting at least since 1984 when Bruce Springsteen denied the use of “Born in the U.S.A.” to the Ronald Reagan reelection campaign.Bruce has a long history of being a huge hater of conservatives in America. In fact, it was the New Jersey native who “ushered in a new dimension to the campaign-song hit parade: the practice of speaking out against, and sometimes suing, mostly Republican politicians who appropriated tunes without the musicians’ endorsement,” ", "is_fake": 1},
{"date": "November 2, 2020", "title": "Lady Gaga Spits On Patriots With Camo & Beer Drinking Biden Ad – Doesn’t End Well", "text": "Lady Gaga spat on flyover country patriots and all supporters of President Donald Trump with a new Biden campaign ad. Donning camouflage in front of a big pickup truck, Gaga cracks open a can of beer. “Hey, I’m Lady Gaga, I’m voting for America — meaning I’m voting for Joe Biden,” Gaga said in the ad. Well, this stunt didn’t end well for the leftist celebrity as patriots stepped in. You’ll love this.Lady Gaga has launched an effort to win votes in the swing states by dressing in camouflage and crushing a beer can.On Saturday, she", "is_fake": 1},
{"date": "March 14, 2018", "title": "Hillary’s Doctors Won’t Let Her Leave India As Her ‘SECRET ILLNESS’ Comes Out", "text": "Hillary Clintonhas been put on bedrest with doctors also ordering the seventy-year-old former Secretary of State to avoid traveling, leaving her stranded in India. Hillary’s mystery illness is something she cannot hide anymore. She fell twice on stairs in Indiathen had “another episode” that has caused a team of doctors to attend to her “secret illness.” You don’t want to miss this.Hillary’s latest health scare happened in India when the failed presidential candidate fell twice while going downstairs, even though she was being assisted by her handlers. Now, we have learned she’s been put on bedrest with travel restrictions, but here’s the kicker: The diagnosis is a “sprained wrist.” reports, “Hillary Clinton sprained her hand during her visit to India, after taking a nasty spill on the stairs while out touring a palace on Monday. It is not yet clear if the hand injury was a direct result of Monday’s incident in which she fell not once but twice on the stairs and was pictured using her hand to brace her fall.”", "is_fake": 1},
{"date": "March 8, 2018", "title": "Mom Brings Baby To Hospital With Burnt Hands, Doctors Make 2nd Horrid Discovery", "text": "The staff at a Texas hospital were more than shocked after a mother brought in a baby with burnt hands. Sadly, things would only get worse as doctors made a second horrid discovery about the situation that would leave them speechless.After picking up her 11-month-old child after work,Jenny McGivney states that she immediately noticed that something was wrong. As if hearing his blood-curdling screams weren’t enough to put her on edge, she then saw young Aiden doing something rather strange with his hands.“I couldn’t believe it,” McGivney recalled. “I couldn’t believe what I saw. He was losing it.” Walking over to investigate, Jenny was terrified to see that her son had massive yellow blisters forming on his hands and that her child was in agony.", "is_fake": 1},
{"date": "April 19, 2018", "title": "EXPOSED: Bill Gates’ Evil Plan To Become ‘Big Brother’ & Watch You 24/7", "text": "In a bone-chilling discovery, the devious plan of billionaire Microsoft founder Bill Gates to become the all-seeing eye, or “Big Brother” made famous in George Orwell’s “1984,” has been revealed. The terrifying consequences will have effects for every generation to come if he is not stopped.Gates is backing a new project by startup company EarthNow to cover the planet with satellites to provide “live and unfiltered” high definition coverage of every square inch of the entire Earth. The company will cover the planet with 500 of these satellites to provide real-time surveillance of every move you make,  reported.", "is_fake": 1},
{"date": "April 27, 2018", "title": "New Report: Earth In ‘Greatest Two-Year Cooling Event In A Century’", "text": "People who shriek about global warming have yet another thing to be upset about. A new report has been released, destroying one of their major arguments. The data confirms what most of us believed all along, but you won’t hear this from the mainstream media.Most people care about the environment — to an extent. We don’t like pollution, and we want to enjoy nature from time to time. Liberals, however, take this to a dangerous extreme. They push environmentalism, trying to convince the rest of us that the earth is doomed unless they have their way.The only solution liberals have to “fix” the planet is big government. That’s their solution for everything. In order to prevent the world from getting hotter, we must let the government pass strict laws controlling private industry. Obama and many others pushed regulation, taxation, and penalties all designed to hurt businesses.", "is_fake": 1},
{"date": "May 16, 2018", "title": "Double Amputee Veteran Gets Turned Away After 5 Hours At The VA, Sends Trump Bold Request", "text": "Johnny “Joey” Jones is a double amputee Marine veteran who lost both his legs in a 2010IED explosion while serving in Afghanistan. Recently, he waited five hours at a VA hospital in Georgia only to be turned away. However, he sent a bold request to President Donald Trump.U.S. Marine Sgt. Johnny “Joey” Jones, who served as a bomb technician in Afghanistan, visited Atlanta VA Medical Center in Decatur, Georgia on Wednesday, May 9, 2018, seeking treatment and to have a prescription refilled. What seems like a perfectly reasonable and simple request lead Jones to wait five hours only to be turned away empty-handed and without an explanation.Jones first took to ", "is_fake": 1},
{"date": "June 15, 2018", "title": "Louisiana Town Discovers Nightmare in Drinking Water, Third Time in Three Years", "text": "If you live in Terrebonne Parish, Louisiana, you might want to consider buying some bottled water. For the third time in three years, the tap water has been laced with a terrible substance.When you drink tap water these days, you take your life in your hands. You’d think that would be the opposite. This is the United States, after all. The one thing we should be able to count on is clean drinking water.But the people responsible for maintaining our supply of water work for the government. So, yeah, you might want to invest in a Brita filter.", "is_fake": 1},
{"date": "July 24, 2018", "title": "URGENT ALERT: If You Have This Popular Product In Your Pantry, Throw It Out ASAP", "text": "An urgent recall has been issued for a popular product that can be found in nearly every American pantry. If you’re one of the millions of people with this food in your home, throw it out as soon as possible. Don’t allow someone in your family to make the mistake of consuming it.According to , ", "is_fake": 1},
{"date": "September 5, 2018", "title": "Bad News for Climate Alarmists, New Report Torches Major Claim", "text": "Climate alarmists have been making wild claims about our planet for years. Their end goal has always been to exploit the issue for their own gain. But a new extensive study has blown apart one of their top claims. In fact, what they’ve been saying is the opposite of what’s really going on.Is there anyone more out-of-touch than an environmentalist? Sure, most people want a clean planet. We don’t like pollution, and we want our technology to help the earth, not hurt it. But environmentalists take this to a whole new level.Environmentalists care more about the earth than human life. Their demands are so radical, it will send most nations back into the dark ages. They want more than just recycling centers and clean-burning cars. Their radical regulations in government would cripple entire industries, destroy our energy production, and hamper innovation for decades to come.", "is_fake": 1},
{"date": "September 5, 2018", "title": "FOX Host Suffers ‘Shocking Health Crisis,’ Warns Fans To ‘Please Take My Advice’", "text": "When a longtime Fox News host began experiencing various ailments, she brushed them aside as minor concerns and went about her business without thinking about it further. In time, those seemingly minor ailments turned into a “shocking health crisis” that could have left her paralyzed. Now, she is warning fans to “please take my advice” before it’s too late.Heather Childers, co-host of “Fox & Friends First,” returned to work on Tuesday after a medical emergency in July. Childers said she was excited to be back at work, but she wanted to share some health advice with her viewers.“If you get up very, very early you may have seen me weekday mornings on ‘Fox & Friends First’ since the show launched on Fox News Channel in 2012. I’ve been away from my job as 4 a.m. to 5 a.m. host on the show since July 13, but I’m very happy to be returning Tuesday – after a shocking medical emergency and surgery to avoid being paralyzed for the rest of my life,” Childers wrote on ", "is_fake": 1},
{"date": "October 15, 2018", "title": "Personal Trainer Puts Signs Up About Obese Man All Over Town", "text": "An obese man was warned by doctors that he was “eating himself to death.” He enlisted the help of a personal trainer to get into shape, but that didn’t seem to be enough. This personal trainer took a pretty unusual step, putting up signs all over town. Not everyone agrees with the method.Our society faces a new health crisis. No, I’m not talking about obesity (that’s been around for a while), I’m talking about the “body positivity” movement. Scores of overweight (and downright obese) people have been preaching that it’s okay to be fat.These people claim that unrealistic beauty standards are making them feel bad for being too heavy. They attack anyone that encourages people to eat healthy, exercise, and lose weight.", "is_fake": 1},
{"date": "November 11, 2020", "title": "Jon Voight Sends Out Message To All Patriots: ‘Greatest Fight Since The Civil War’", "text": "Jon Voight is a big supporter of President Donald Trump. The Academy Award-winning actor released a video with a message for all patriots. Voight came out in support of the president’s claim that Joe Biden is falsely declaring victory in last week’s presidential election. His latest message is going viral. Don’t miss this.Jon Voight is in the minority of celebrities who support President Trump. However, the 81-year-old actor has never shied away from controversy, and he is an amazing patriot who is standing up to the leftwing media attempting to gaslight Americans into believing Joe Biden has won this election without question.Reporter Ian Miles Cheong pointed out how the Biden campaign is adding to this false narrative by having the Democrat candidate’s new background say: “Office of the President-Elect.”", "is_fake": 1},
{"date": "November 24, 2020", "title": "Trump-Hating Actor Robert De Niro Says President’s Supporters ‘Should Be Afraid Of What’s Gonna Happen’ When He’s Out Of Office", "text": "Actor Robert De Niro hasn’t been shy about his hatred of President Donald Trump, and a recent interview was no different. When asked about the election results, De Niro warned that Trump supporters are “gonna try to crawl back” but said they “should be afraid” of what he says is soon to come. Don’t miss this.During a Friday appearance on ABC’s “The View,” Robert De Niro fielded a number of questions from the talkshow’s co-hosts, including some from fellow Trump-hater Ana Navarro. “Is anyone going to be able to convince [Trump] to concede [the election to Democratic presidential nominee Joe Biden],” Navarro asked De Niro. “And, why are so many Republicans still kissing ‘the ring’ among other things?”The Trump-hating Hollywood actor, likely emboldened by Joe Biden’s projected win, used the inquiry as an opportunity to issue a warning to those who have supported Donald Trump and his presidency as De Niro predicted that some will have the gall to “try and crawl back,” according to ", "is_fake": 1},
{"date": "November 25, 2020", "title": "Milano: It’s Time To Heal, Extends ‘Olive Branch’ To Trump Voters – Gets Torched", "text": "Alyssa Milano, after years of blasting President Donald Trump and accusing his supporters of being racists, is ready to extend an “olive branch.” She said, “I am ready to move forward together. There’s so much work to do to heal the nation.” Well, the left-wing activist immediately got torched by Americans.It was just a couple of months ago that Alyssa Milano was calling for Republicans to be “tried for treason.” And now, just weeks removed from the election, and after years of smears and attacks, the left-wing activist and actor is ready to “extend an olive branch to Trump supporters.”“I am ready to move #ForwardTogether,” Alyssa Milano said in a tweet on Tuesday, echoing language used earlier by Joe Biden. “There’s so much work to do to heal the nation. Let’s be a part of the solution and not add to the problems we face. My comments are open. Please reply with #ForwardTogether.”", "is_fake": 1},
{"date": "December 4, 2020", "title": "Noah Cyrus Appears To Call Candace Owens A Racist Slur — Instantly Regrets It", "text": "Noah Cyrus, the little sister of pop star Miley Cyrus, found herself in some hot water after lashing out at well-known political commentator Candace Owens. After appearing to call Owens a racist slur, Cyrus was made to instantly regret it.Noah Cyrus decided to get in on the fray between political activist Candace Owens and pop star Harry Styles after Owens critiqued a Vogue photoshoot featuring Styles wearing a dress. Not impressed with the imagery, Owens shared photos from the shoot to Twitter, where she blasted Styles for wearing a ball gown,  reported.", "is_fake": 1},
{"date": "February 4, 2018", "title": "Woman Mourns Deceased Dog, Truth Revealed 10 Years Later With One Chilling Phone Call", "text": "After a Pennsylvania woman’s dog went missing, she was forced to say goodbye, mourning the loss of her beloved pet. However, ten years later, she received a chilling phone call that revealed the truth and has left her and her family utterly shocked.Ten years ago, DebraSuierveld’sblack lab named Abby went missing. One minute, the beloved pooch was playing in their backyard with the family, and the next, she was gone. Unfortunately, after searching everywhere, Debra and her family were forced to face the fact that Abby wasn’t coming back and mourn the realization that her companion was gone forever.However, ten years later, Debra received a chilling phone call that she never expected.After ten years, Debra and her family had since moved on and had even gotten two more dogs, but this week, everything changed with a single phone call as all the emotions she felt over the loss of Abby were brought rushing back to the surface. The person on the other end happened to be from the Animal Protectors in NewKensington, Pennsylvania, and they had surprising news – they had found Debra’s dog, Abby, a full decade after she went missing.", "is_fake": 1},
{"date": "January 17, 2018", "title": "Arizona Teen Makes Unnerving Find Dangling From Tree Behind Lowe’s Home Improvement Store", "text": "A 15-year-old girl was walking behind a local Lowe’s home improvement store in Arizona when she suddenly stopped in her tracks as something unnerving caught her eye. Off in the distance, she spotted something hanging from a tree and proceeded with caution toward it, horrified by the disturbing find. Now, the community is furious and seeking help in finding answers.The young girl thought that it was going to be an ordinary afternoon, but a simple walk quickly took an unsettling turn. As she went for a stroll behind the local Lowe’s in Tucson, Arizona, she stumbled upon a horrific scene, which someone had left hanging from a tree. The culprit had obviously assumed no one would see what they had done until it was too late, but the young girl, who has remained anonymous, walked around the corner just in time.After the teen had heard an unusual noise coming from behind the building, she decided to go investigate just to be sure, and it’s a good thing that she did. When she turned the corner, she saw something quite disturbing – a whimpering dog had been left for dead and was hanging from a tree.", "is_fake": 1},
{"date": "March 13, 2018", "title": "Students ‘Traumatized’ After Seeing What Idaho Science Teacher Fed Snapping Turtle", "text": "Students from a school in Idaho have been left “traumatized” by their science teacher’s afterschool antics. The kids could not believe what their teacher fed to the classroom’s pet snapping turtle when the animal got hungry. Now, the district has launched a full-blown investigation.Robert Crosland has taught science at Preston Junior High School for years. And, for years, his classroom has operated without incident. However, he has now come under fire for a stunt which is inexcusable in the eyes of many. After class, Crosland fed a puppy to his pet snapping turtle in front of an undisclosed number of middle school students.Robert Crosland, considered a “popular” and “cool” teacher, served up the puppy last week after class, according to Preston School District 201 Superintendent Marc Gee. [Source: ", "is_fake": 1},
{"date": "March 7, 2018", "title": "Cops Find Dog Abandoned On Road, Left Sickened After Seeing What’s On Its Face", "text": "In Atlanta, Georgia, the police received a call regarding an abandoned dog on the side of the road. After an officer arrived at the scene, he was left sickened to see what was on the terrified black dog’s face.An Atlanta Police Department officer responded to a call about an abandoned dog spotted in a ball on the side of the road. When he arrived on the scene, he was quickly left disgusted when he took a closer look and realized what was on the poor dog’s face — duct tape. In fact, it was wrapped around her entire face.According to ", "is_fake": 1},
{"date": "July 11, 2018", "title": "VIDEO: Nursing Student Goes ‘Swimming With Sharks,’ Now She’s Lucky To Be Alive", "text": "Katarina Zarutskie is a Miami nursing student and an Instagram model who came very close to losing her life. Originally from Orange County, California, the petite blond was vacationing down in the Bahamas when she had the crazy idea to “swim with the sharks.” Now, her ordeal is going viral as the entire spectacle was capturedon film, and she is lucky to be alive.Americans beware: when vacationing down in the Bahamas, the locals may tell you that swimmingwith nurse sharks is safe, but common sense tells you all sharks are predators. This is the hard lessonKatarina Zarutskie learned as she excitedly jumped into a group of nurse sharks while on vacation., “Zarutskie, a 19-year-old nursing student and Instagram model from Laguna Beach, California, had been swimming with nurse sharks when one bit her arm and started to drag her under the water last month. Her boyfriend’s father took several photos throughout the attack, capturing the exact moment that Zarutskie came in contact with the 5-foot-long shark.”", "is_fake": 1},
{"date": "July 31, 2018", "title": "Hippie Vegans Protest North Carolina Fishing Tournament, Get Taught Nasty Lesson", "text": "A group of vegan activists descendedonthe city of Wrightsville Beach, North Carolina, over the weekend to protest a fishing tournament being held there. However, shortly after the hippies arrived with their quirky homemade signs, they were taught a nasty lesson by one of the tournament’s no-nonsense organizers.According to , several vegan activists gathered at a popular fishing tournament to protest eating meat. The Wilmington Fish Save and North Carolina Farmed Animal Save organized the protest, called “Vigil for Fish,” to raise awareness about animal rights during the annual ", "is_fake": 1}
]