[
{"date": "Thursday, Jul 01, 2021 - 09:05 AM", "title": "Complacent Goldilocks Got Eaten By Bear", "text": "This morning I just watched a massive, fully laden container ship sailing out of Southampton Water loaded with goods for the global markets. The sun is shining and what’s to worry about?The global economy is reopen, the last dying embers of the pandemic are being hosed out, consumers are determined to consume, and aside from some simple supply side inflation adjustments … we have absolutely nothing to worry about…Run for hills if I ever write something like that without a twinkle in my eye and wry smile on my lips… I am smiling now… but not in an overly wry way! Call my expression this morning… quizzical.I am tempted to throw a selection of random words and phrases at the Porridge to see how they stick.. Let’s try", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 09:28 AM", "title": "New Video Shows Surfside Condo's Parking Garage Crumbled Before Collapse", "text": "Video recorded moments before the Champlain Tower South  last Thursday shows concrete crumbling and water pouring out of an underground parking garage ceiling.The footage, shot by Adriana Sarmiento and Roberto Castillero, two tourists staying in a nearby hotel, initially heard a loud bang minutes before the 12-story condominium building collapsed. They grabbed their smartphones and headed to the parking garage.They found water pouring out of the ceiling and concrete breaking apart inside the build's underground parking garage. This is yet another clue that structural deficiencies may have played a part in the collapse, outlined in a prior", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 08:35 AM", "title": "Almost 15 Million Americans Remain On Government Dole, Despite Initial Claims Drop", "text": "With more states ending their emergency handouts to the jobless, claims data is likely to start getting noisy but last week saw initial claims tumble more than expected (to a post-COVID low of 364k from 415k last week)Pennsylvania remains an outlier among the states...The total number of Americans of some form of government dole continues to hover just below 15 million...Finally, a reminder of just how decoupled benefit-gobbling non-jobseekers have become from job openings in America...", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 08:45 AM", "title": "Nio Shares Pop 3% Pre-Market After Company Bucks Semi Shortage And Reports 21,896 Q2 Deliveries", "text": "Shares of EV automaker NIO are up about 3% in the pre-market session after the company was able to buck the semiconductor shortage and report deliveries for June that were on the high end of analyst expectations.The Chinese automaker reported on Thursday morning that it had delivered 8,083 cars in June, bringing its second quarter total of vehicles delivered to 21,896 vehicles. Those numbers were at the high end of the company's forecast for deliveriesof between 21,000 and 22,000 for the quarter, .The company's ", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 07:15 AM", "title": "Trump Organization CFO Alan Weisselberg Surrenders After Indictment ", "text": "Weisselberg has pleaded not guilty to the charges, according to his attorney, who said he will \"fight these charges in court\". The exact nature of the charges has yet to be revealed as the indictment is still sealed.* * *After  was handed down by Manhattan prosecutor Cyrus Vance Jr. last night, long-serving Trump Organizatoin CFO Allen Weisselberg surrendered to the district attorney's office on Thursday morning.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 09:45 AM", "title": "Blackstone Doubles Down On Las Vegas Bet By Buying Vdara & Aria Properties", "text": "As a record-breaking heatwave finally recedes, private equity giant Blackstone is adding to its already-considerable real-estate holdings in Las Vegas.Bloomberg reported Thursday morning that Blackstone-managed funds would acquire MGM Resorts' (not to be confused with the MGM movie studio that Amazon is trying to acquire) Aria and Vdara properties for $3.39 billion in cash.Following the acquisition, both properties will be leased back to MGM Resorts for initial annual rent of $215MM. Blackstone will own the properties, but management and operations will remain in the hands of MGM. The 10-figure windfall will provide an advantageous cash-cushion to the company, which was forced to make dramatic cuts and layoffs in order to survive the pandemic.\"We expect to continue executing on our asset-light strategy and utilizing the proceeds from our real estate transactions to enhance our financial flexibility and secure new growth opportunities,\" said Bill Hornbuckle, CEO and president of MGM Resorts.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 07:00 AM", "title": "LAPD Bomb Squad Truck Explodes After Massive Fireworks Stash Ignites", "text": "This is some Alanis Morisette-level irony.More than 12 individuals were seriously injured late Wednesday when an LAPD bomb squad truck exploded while attempting to dispose of a cache of illegal fireworks.The enormous explosion, which caught the attention of the national press, was triggered by the more than 5K pounds of illegal fireworks confiscated from a home in South LA. One individual was arrested in the raid that led to the fireworks.In addition to the injured personnel, the explosion also damaged nearby cars and homes.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 10:05 AM", "title": "Manufacturing Surveys Disappoint In June, Signal Looming Stagflationary Threat", "text": "Despite slumping 'hard' data, 'soft' survey data has been trending higher on a bed of soaring prices (well it must be demand), and supplier delivery delays (well it must be demand) providing any and all asset-gatherers and commission-rakers the ammo to confirm the recovery. But, perhaps, if today's PMI is right, that trend is beginning to end as Markit's final Manufacturing survey for May dropped from April and also ended below the preliminary print (but was still well into expansion at 62.1).ISM also reported a small miss in its Manufacturing survey. as greater global demand for inputs put pressure on material shortages. and reports of labour shortages. Although the rate of growth was among the sharpest since May 2007, firms noted difficulties processing new orders amid material delivery delays and challenges finding suitable candidates for current vacancies.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 08:23 AM", "title": "Brace For Shock At The Pump: WTI Surges Above $75 As OPEC+ Raises Output Less Than Expected", "text": "Brace for shock at the pump. WTI crude prices surged by over $2, rising more than 3% to $75.8/bbl...... the highest since 2018...... amid reports that ahead of the conclusion of today's OPEC, JMMC and OPEC+ meetings, regarding raising oil output, one which will include a monthly oil output increase of ", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 08:27 AM", "title": "Xi Gives Blistering Taiwan \"Reunification\" Speech, Vowing Foreign Meddlers Will \"Get Their Heads Bashed\"", "text": "China's President Xi Jinping issued a blistering \"warning\" to the West in a Thursday speech marking the occasion of the 100th anniversary of the Chinese Communist Party. The most provocative part of the roughlyhour-long address given from Tiananmen Square focused on at \"meddling\" in China's affairs and in the region (read: ).The gray Mao suit clad Chinese leader said the nation is ", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 07:55 AM", "title": "Futures Start Second Half Hovering At All Time Highs As Oil Jumps", "text": "S&P futures were flat, hovering near all time highs, after earlier briefly rising above 4,300 - Goldman's year-end price target - before dipping back to the unchanged line as European stocks faded gains of as much as 1% as gains in cyclical shares offset declines in technology firms. Asian shares dipped as Covid-19 flareups threaten to hamper the recovery there. Dow e-minis were up 20 points, or 0.06%, S&P 500 e-minis were up 1 point, or 0.03%, and Nasdaq 100 e-minis were down 25.5 points, or 0.28%. The dollar rose while Treasuries dipped.WTI crude surged almost 3%, rising above $75 a barrel, for the first time since 2018, as the market awaited a decision from OPEC+ on production levels for the coming months. OPEC+’s de facto leaders, Saudi Arabia and Russia, have a tentative agreement to increase output gradually, but are still negotiating a deal, delegates said as ministers gathered online on Thursday. The proposal under discussion would add about 2 million barrels a day to the cartel’s output between August and December, they said.In premarket trading, Micron slipped 2.9% even as it beat estimates for quarterly profit and forecast fourth-quarter revenue above expectations. Didi jumped 8.5%, a day after its shares ended their first day of U.S. trading slightly over their initial public offering price of $14, and dropping more than 10% from the break price. Here are some of the other big premarket movers today:With the S&P 500 and the Nasdaq hitting a series of record highs last month, investors are razor-focused on Friday’s nonfarm payrolls report, where a strong reading could force the U.S. Federal Reserve to rethink its accommodative stance. Focus also shifts to the second-quarter earnings season, beginning July, to gauge whether the first-half momentum could continue further for the remaining year.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 10:35 AM", "title": "Evacuation Underway As Philippine Volcano Triggers \"Magmatic Unrest\" ", "text": "Philippine authorities have begun to evacuate thousands of people Thursday after the alert status for Taal volcano, located near capital Manila, was raised following a \"magmatic intrusion.\"LOOK: Phreatomagmatic eruption of  Volcano from 3:16 PM to 3:21 PM today (July 1, 2021), as viewed from the Main Crater station. | Courtesy of \nThis afternoon, the agency raised Taal's Alert Level to 3 (magmatic unrest). Stay safe and updated! ", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 10:53 AM", "title": "Rabobank: When Exactly Did Capitalism Go So Wrong", "text": " You can’t stop the party: not even if the Bank of America and Mohammad El-Erian both join Larry Summers as splittists and no longer see inflation as “transitory”; nor as Ford reduces output in the US due to a lack of parts; nor as . (“,” says one executive; “” says another; “", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 11:12 AM", "title": "Supreme Court Rules Arizona Law Against Ballot Harvesting 'Not Racist'", "text": "The US Supreme Court on Thursday, in what may pave the way for other states to enact similar measures to prevent potential voter fraudVoting 6-3 along ideological lines, t, according to ", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 11:50 AM", "title": "Pelosi Picks RINO Liz Cheney To Join \"Bipartisan\" Committee Investigating Capitol Riots", "text": "House Speaker Nancy Pelosi announced Thursday that Rep. Liz Cheney, the daughter of former VP Dick Cheney and a prominent GOP critic of Trumpism, While Pelosi will undoubtedly tout Cheney's appointment as evidence of \"bipartisanship\" on the committee, Cheney's standing within the GOP So far, Cheney is the only Republican to join the 13-member committee, which will consolidate several ongoing House investigations.Pelosi's goal with the appointment is to give the commission the same bipartisan credentials that were enjoyed by the 9/11 Commission. Members of the GOP, ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 08:20 PM", "title": "George Orwell's 1984 Has Become A Blueprint For Our Dystopian Reality", "text": "“If you want a picture of the future, imagine a boot stamping on a human face - for ever.”George Orwell,It’s been more than 70 years since Orwell—dying, beset by fever and bloody coughing fits, and—depicted the ominous rise of ubiquitous technology, fascism and totalitarianism in", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 08:40 PM", "title": "Baltimore City Police Set To Seize Twice As Many \"Ghost Guns\"", "text": "Months ago, wereaders \"ghost guns,\" which are untraceable to the federal government and can either be made from 80% percent lower kits or 3D printers were popping up all across Baltimore City. Now the number of ghost guns the Baltimore City Police Department (BCPD) expects to seize this year is set to be more than double what it was last year.With more than 300 homicides for six consecutive years, 2021 murders areto be over 300.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 09:00 PM", "title": "Incremental Outrageousness Is Killing America", "text": "Millions of American parents are just coming to realize that our schools have become woke indoctrination centers preaching divisiveness, bigotry, discrimination, and disdain for American history. Most of them are wondering how we got here. One step after another, over the course of decades. It’s hardly just K-12 education. An incentive system of “incremental outrageousness” has taken every aspect of American culture dangerously far from reality into the orgy of radical leftist hatred known as progressivism.The onslaught began in higher education—an institution particularly well suited for a takeover because it functions without external market signals. Success in academia hinges entirely on peer approval. Faculty members make all decisions concerning the hiring, firing, and promotion of junior colleagues, curriculum design, publication in prestigious journals, the appropriate paths for research, and the availability of public and private research funding.The best way to do that (within the bounds of legality and propriety) is to “build upon” their work—that is, by taking it one step further in the recommended direction. Senior academics select the direction. Junior academics bolster the prestige of their seniors whenever they make a new “scientific discovery” along the designated path. In one fell swoop these junior academics show how important past work has been and tie their own egos, prestige, and careers to those of their seniors.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 09:20 PM", "title": "Welcome To The \"Post-COVID Luxury Spending Boom\"", "text": "Now that the Covid panic is starting to subside, the \"boom\" is beginning. Especially in the luxury goods market.The surge in spending is indicative of the tailwind that loosening lockdowns, combined with trillions of dollars in stimulus, has created.One person experiencing the spending binge firsthand is travel agent Dottie Williford, who told  that the company's luxury offerings are being sold out first: “People don’t usually spend $20,000 to go to the Bahamas, but my clients are. The first things to sell out were the top category on the ship.”", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 09:40 PM", "title": "Biden Sends Federal Motor Fuels Tax Packing, Washington Insider Says", "text": "President Joe Biden has thrust a dagger into the heart of the federal motor fuels tax and, with it, the trust fund that’s long been dedicated to paying for highway projects.So says Randy Mullett, a multi-decade veteran of the inside-the-beltway transportation wars and head of a Virginia-based consultancy. Biden’s staunch opposition to an increase in the federal fuels tax — which hasn’t been raised since 1993 — sends a clear message to Congress that the Highway Trust Fund, which for decades has used fuel tax proceeds to funnel money to states for road infrastructure projects, has reached the end of its useful life, Mullett said. The Trust Fund was created in 1956 to fund the interstate highway system and other road projects.“The days of a dedicated highway trust fund are finished,” Mullett said Tuesday afternoon during a virtual session at the SMC3 annual summer meeting.House Democrats had been tinkering with the idea of raising the fuel tax by indexing it to inflation, Mullett said. Biden’s pronouncement quashed those efforts, he said. From now on, every infrastructure project will compete with other federal spending initiatives for the same pot of money, a prospect no one in the transport ecosystem relishes, Mullett said.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 11:44 AM", "title": "Eric Adams Files Lawsuit To Ensure 'Fair Election Process' After NYC Board Botches Election Count", "text": "“Today we petitioned the court to preserve our right to a fair election process and to have a judge oversee and review ballots, if necessary,” his campaign said in a statement.“.”Adams, the Brooklyn Borough president, ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 10:00 PM", "title": "Billionaire Funds South Dakota National Guard Deployment To U.S-Mexico Border", "text": "South Dakota Gov. Kristi NoemMondaythat she's sending 50 of her state's National Guard troops to the U.S.-Mexico border in Texas and will be paid for by a private donation, according to.Noem said,", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 10:20 PM", "title": "Conrad Black: A Tsunami Of Crises About To Swamp Biden Administration", "text": "The Biden-Harris administration is now in an extended levitation of credibility. Except for Donald Trump, who entered office in the midst of a public relations terror campaign against him and had no trace of a political honeymoon, all incoming presidents arrive with a favoring wind of bipartisan goodwill behind them.Especially as President Biden came into office promising a quieter and more genteel atmosphere and has largely done that, it is not surprising that his general popularity has been sustained at somewhat above 50 percent these first five months. In service to that credo, As Vice President Harris checked the box by going to El Paso, 800 miles away from the more agitated areas of illegal southern entry last week, she repeated the mantra that this administration inherited a mess. The polls are unanimous in indicating that the public realizes they did not inherit a mess; they inherited the almost complete end of illegal immigration and they squandered it instantly and jubilantly by effectively inviting the world to enter while having the hapless Homeland Security Secretary Alejandro Mayorkas repeat like a Disney World self-propelled puppet “The border is closed.”", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 10:40 PM", "title": "5,000 Burgers Per Day: World's First Mega Lab-Grown Meat Factory Opens ", "text": "The World Economic Forum's (WEF) The Great Reset plan includes a complete transformation of the global food and agricultural industries and the dieting of humans. The architects behind this plan are preparing for awith the introduction of cell-based, slaughter-free meat.Before this decade is over, we're all going to be eating some form of slaughter-free meat, including chicken, pork and lamb, and beef. The point of all this is to, use less land for farming, and reduce the use of freshwater and grains for the traditional process of growing livestock.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 11:00 PM", "title": "CJ Hopkins Exposes \"The War On Reality\"", "text": " Societies all across the world have been . Neighbors, friends, and even family members are  into two hostile camps, each regarding the other as Mutant variants are spreading like wildfire. Most of society is still shut down or subject to emergency health restrictions. People are still walking around in public with plastic face shields and medical-looking masks.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 11:20 PM", "title": "New Video Shows Boston Dynamics' Robo-Dog Dancing To A Whole New Beat ", "text": "It comes as no surprise that after South Korean firm Hyundai finalized itsof Boston Dynamics earlier this month, the internet's favorite dancing four-legged robot, Spot, danced to a song by South Korean boy band BTS.The South Korean automotive giant now owns a controlling interest in the Massachusetts-based robotics company, previously belonging to SoftBank.Last year, Hyundai and BTS partnered in a music video called \"I'm On It\" that featured an IONIQ, a new EV lineup brand of Hyundai. So it comes as no surprise that Hyundai would use BTS to pump up their new Spot robot in a video released Tuesday.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 02:00 AM", "title": "German Mayor Responds To Islamist Terror Attack By Expressing Concern About Refugees", "text": "Yes, really.Videos from the scene of the attack showed members of the public confronting the 24-year-old killer, who was later found to have radical Islamist propaganda on the premises of his home.On Monday, Joachim Herrmann, Bavaria’s Interior Minister, said the incident had all the hallmarks of an Islamist terror attack.⭕️One more video from the incident in ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 11:40 PM", "title": "Decisions That Would Cause U.S. To Lose World War III", "text": ",This month marked the 80th anniversary of Nazi Germany’s invasion of the Soviet Union which took place on June 22, 1941. , which were massed on the borders of eastern Germany, western Poland, Hungary, and Romania poised for their own invasion, enabled the Germans to capture or destroy tens of thousands of Soviet tanks and aircraft. Some authors who have examined Soviet archives have suggested the offensive was scheduled to take place a mere two and a half weeks after Hitler’s attack.Despite the fact that the Soviet Union had joined with Nazi Germany in invading Poland and starting World War II as co-aggressors, President Franklin Delano Roosevelt and British Prime Minister Winston Churchill responded to the German invasion of its former Soviet ally by pledging their unqualified support for the Soviet war effort no matter what the consequences of their unqualified political and military support might be. U.S. and U.K government war propagandists went to work to deceive their citizens into believing that the world’s greatest mass murderer, Soviet dictator Josef Stalin, was, in fact, a gallant ally of democracy and freedom in the fight against Nazi Germany.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 02:45 AM", "title": "Google Mistakenly Uses Photo Of Swiss Engineer On Wikipedia Entry For Notorious Bulgarian Rapist", "text": "Today in \" news, aGoogle algorithm has been responsible for mixing up an engineer based in Switzerland with a notorious serial killer online.The mix up happened when algorithms mistakenly took a photograph of engineerHristo Georgiev and placed it into a Wikipedia  for Hristo Georgiev, who is described by the same entry as \"a Bulgarian rapist and serial killer who murdered five people, mainly women, between 1974 and 1980\".", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 04:15 AM", "title": "UK Secures Financial Sector Carve Out In Global Tax Talks To Protect Struggling Banks", "text": "In what's being heralded as a major diplomatic victory for the UK, British diplomats have reportedly succeeded in securing an exemption for the financial services industry from the global corporate tax framework that's being hammered out by the OECD. With talks set to end Thursday, the OECD is expected to soon publicize \"Pillar 1\" of what would be the most comprehensive overhaul of international corporate tax rules in a century.But while Washington likes to talk about the new framework as a foregone conclusion, there's plenty of reason to doubt that it will ever be implemented.One reason is that countries like Ireland, Singapore, Indonesia and island island tax havens like Bermuda all oppose the new scheme. Why would these countries want to surrender a policy that has in almost every case been a tremendous boon for economic growth, just to accept whatever tax crumbs the Americans toss their way? Adding salt to their wounds, while these countries haven't played much of a role in the talks so far, the UK has already succeeded a critical carveout, something Their biggest fear, of course, is that everybody gets an exemption but them.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 03:30 AM", "title": "Brits Ramped Up Savings In 2021 Lockdown, Data Show", "text": "Brits squirrelled away their wages, profits, and pandemic handouts during this year’s spring, according to official figures.The data from the Office for National Statistics also show that GDP contracted during that first quarter of the year by more than expected, dropping by1.6 percent compared with the previous 1.5 percent estimate.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 05:45 AM", "title": "Nigerian Influencer \"Hushpuppi\" Funded Life Of Luxury With Complex Email Schemes, FBI Alleges", "text": "For Instagram \"influencer\" Hushpuppi, also referred to as the \"Billionaire Gucci Master\" Ramon Olorunwa Abbas, living a life of private jet setting and luxury on Instagram in front of his 2 million followers turned out to not only be his claim to fame, but alsothe straw that broke the camel's back for his empire. While many looked on at his life of luxury in awe, questions started to arise about how he obtained, and maintained his wealth. The answer lied in the evolution of the often mocked \"Nigerian email scam\" that we have all become used to.Hushpuppi always maintained the questions about his wealth were \"the jealousy of so many haters\", a lengthy notes.“As I turn a year older into my 30s today, I want to celebrate all of you out there,” the influencer said to his fans on his 37th birthday.“Those of you who mostly I have never met, spoken to or anything but have been a strong supporter of me through every situation until this point and still riding for me, I want you to know wherever you are that I celebrate and appreciate you today, today is OUR DAY!”It was one of many posts he made flaunting his wealth and engaging with his followers who supported him while he jet-setted, beefed with celebrities online, and did his best to side-step questions about where, exactly, his success came from.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 05:00 AM", "title": "The Pacific Is Crowded With Unprecedented Number Of War Games", "text": "Each week the Pacific is getting even more crowded with military ships, submarines and aircraft from countries in the region and from outside. NATO countries — United Kingdom, France, Germany and the Netherlands — are sending military vessels and aircraft.The Russian navy conducted military maneuvers off Hawaii.The USis on the verge of creating aas a part of its aggressive response to China’s naval presence in the Pacific.In March, President Joe Biden directed the Pentagon to establish a China Task Force to examine China-related policies and processes and give its recommendations to Defense Secretary Lloyd Austin. The creation of a Pacific Naval Task Force would allow the secretary of defense .The Pacific task force would also include NATO allies such as Britain and France, that have already sent their warships into the Pacific, as well as Japan and Australia.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 06:30 AM", "title": "The Fed In A Box Part 2: They Cannot End Quantitative Easing", "text": "When the economy was shut down in March 2020, the government responded with massive fiscal and monetary support. The fiscal stimulus totaled $4T+ in relief packages. All of this spending was paid for with debt issued by the Treasury. The Treasury mostly issued short-term debt. With rates being held at zero by the Fed, and strong demand for short-term debt, it made sense to quickly raise cash using Treasury Bills as interest-free loans.The Fed monetary policy was two fold, slash short-term rates to zero and inject $1.5 trillion into the long-term debt treasury market. The effect was to bring down interest rates across the entire yield curve. After the initial debt binge, QE went on auto-pilot, with the central bank buying about $80B a month in long-term debt (plus another $40B in Mortgage debt). Over the last year, the Treasury has continued to issue long-term debt, averaging more than the $80B the Fed has been buying. This has caused long-term rates to rise.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 02:44 AM", "title": "\"Panic Porn Dressed Up As Science\" - Exposing The Truth About The Delta Variant", "text": "Equity futures are in the red Wednesday morning as Dr. Anthony Fauci's warnings about the supposedly \"dire threat\" posed by the Delta variant continue to be .Yesterday,  ticked higher after touching their lowest levels since the start of the pandemic. The data set off another round of warnings about the relatively large swath of Americans who refuse to get the vaccine.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 03:23 PM", "title": "JPM's Kolanovic: The Delta Variant Does Not Pose A Risk For Markets ", "text": "Amid the growing mainstream media panic over the covid Delta variant, which one can only assume is meant to set the stage for another lockdown and even more stimulus payments, earlier today we tried to explain why much of this fearmongering is nothing more than just \".\" However, with the market also starting to freak out about the Delta strain with rates hammered and travel and auto shares sliding on concerns about future lockdowns as the reflation trade fizzles yet again, we note that none other than the market's biggest cheerleading permabull, JPM's Marko Kolanovic who has emerged as this generation's Abby Joseph Cohen, this morning published a report in which he says that \"the Delta variant does not pose a risk for markets\" and that \"yields and value should move higher\", which was to be expected since JPM's core thesis is to be be balls to the wall long value.Reminding readers that contrary to the rest of the market which freaked out over the emerging B.1.1.7 variant back in February, Kolanovic was quite optimistic back then (and as always), the Croatian quant then extrapolates the same argument to today, writing that \"there is a similar setup now with the so-called Delta COVID-19 variant fears, which resulted in a decline in yields and value stocks.\"So what makes JPM's resident nuclear physicist-", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 03:06 PM", "title": "Steve Cohen Is Hiring Head Of Crypto", "text": "One month after we reported that Steve Cohen's  Point72 was set to make a \"sizable entrance\" into the crypto market and is poised to \"get big in crypto,\" today we learned that Steve Cohen isn't joking around and as and BBG reported, Point72 is seeking to hire \"a head of crypto.\" It wasn’t immediately clear what the position would entail.Point72 said in a May letter to investors seen by Bloomberg. “We would be remiss to ignore a now $2 trillion crypto currency market.”", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 03:45 PM", "title": "As California Begins To Burn, Biden Meets With Western Governors", "text": "President Biden met with governors from Western states Wednesday to discuss new measures to contain wildfires as this year's fire season could be one for the record books amid the latest historic heat wave and megadrought.Biden said the government has \"to act fast\" in containing and preventing wildfires, adding that, \"We're late in the game here.\"The president addressed the wage issue among federal firefighters by increasing their minimum wage from $13 per hour to $15. As we noted below, Biden last week called $13 \"ridiculously low.\"He said more federal firefighter positions would become permanent rather than seasonal \"so that when fires aren't burning, we have a workforce of experienced hands enhancing our forest management, reducing the risks of future fire seasons.\"", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 03:31 PM", "title": "Former Defense Secretary Donald Rumsfeld Dead At 88", "text": "Former defense secretary Donald Rumsfeld, the main planner for the Iraq war until former President George W. Bush replaced him, has died at the age of 88, according to a statement from the family.\"It is with deep sadness that we share the news of the passing of Donald Rumsfeld, an American statesman and devoted husband, father, grandfather and great grandfather. At 88, he was surrounded by family in his beloved Taos, New Mexico,\" the statement read.\"History may remember him for his extraordinary accomplishments over six decades of public service, but for those who knew him best and whose lives were forever changed as a result, we will remember his unwavering love for his wife Joyce, his family and friends, and the integrity he brought to a life dedicated to the country,\" the statement continued.Bush selected Rumsfeld as Pentagon chief in 2001 and was the architect of the Iraq war until Republicans lost the House majority in 2006.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 03:58 PM", "title": "Oh No You DIDIn't!! Chinese Ride-Sharing Firm Crashes Back Near IPO Price", "text": "DIDI just crashed back to within pennies of its IPO price...We appear to have where the underwriters were waiting.Didi raised about $4.4 billion in its initial public offering Tuesday after pricing shares at $14 apiece, making it the according to Dealogic.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 04:00 PM", "title": "Stocks & Bonds Soar In 'Stagflationary' Q2, June Gloom Crushes Crypto", "text": "An ugly year for \"hard data\", especially relative to expectations, but that didn't stop oil prices, big-tech stocks from soaring (as the yield curve flattened dramatically with the long-end well bid)And Q2 saw ominous stagflationary signals...As Bubble Markets followed The Fed's balance sheet flow...This seemed to sum things up...", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 04:40 PM", "title": "One Fifth Of Young Adults Are Neither Working Nor Studying", "text": "If one defines a failed state as one where the most productive segment of society does nothing, then America is 20% of the way there.According to a new report from the Center for Economic Policy and Research, Specifically, some 3.8 million Americans aged 20 to 24 were not in employment, education or training (known as the NEET rate) in the first three months of the year. That’s up a whopping 24%, or 740,000, from a year earlier, before many lost their jobs or opted to defer college enrollment as campuses shut down at the onset of the Covid-19 pandemic.that while the NEET rate has eased from its April 2020 peak, progress on reducing racial disparities hasn’t been as even. Almost a quarter of Black young adults were inactive last quarter, up from 20.9% in the same period of 2020. The rate for Hispanics in that age group was just under 20% and about 16% for White Americans. As usual, Asian somehow always find ways to be the busiest of all despite such widespread excuses for failure as \"systematic racism\" and \"white rage.\"", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 05:20 PM", "title": "Democrats' Revive \"Destination\" Fundraisers Despite Concerns About Delta Variant", "text": "With the spread of the Delta COVID-19 variant tripping alarms across the US, Democratic politicians, who have mostly urged caution with the reopening of the economy, are once again organizing \"destination\" fundraisers during weekends in July and August as they race against the GOP to raise as much money as possible before the 2022 midterms.According to , Democrats opted not to hold fundraisers outside Washington during the pandemic, which is why so many members are apparently looking forward to their weekends mingling with donors in the sunshine, despite the alleged threat posed by the Delta variant.Maryland Rep. Dutch Ruppersberger plans to host a late August beach weekend in Ocean City, where he once worked as a summer lifeguard. ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 05:00 PM", "title": "Watch: House Subcommittee Hears Chinese Military Ran Wuhan Lab; Experts Warn It's \"Highly Likely\" COVID-19 Leaked", "text": "The hearing of the House Select Subcommittee on the Coronavirus Crisis went ahead, and no appearance from either NIH director Dr. Francis Collins and NIAID directorAnthony Fauci, who both declined to attend.As Minority Whip Steve Scalise, Democrats have not held any hearings and without subpoenas it is near impossible to get health officials to turn up to any Republican led hearing.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 05:40 PM", "title": "University Bans The Phrase \"Trigger Warning\" Because It Might Be... Triggering", "text": "that Brandeis University has “created an anti-violence resource called thePrevention, Advocacy & Resource Center which provides information and advice to students and staff.”Among the phrases to have been banned are, ironically, ‘trigger warning’ which had to go because of its association to guns, along with ‘take a shot at it’ for the same reason.Similarly, ‘take a stab at it’ and ‘killing it’ have been described as ‘oppressive language’ and replaced by ‘try’ and ‘great job’. “If someone is doing well, we don’t need to equate that to murder!” the college’s explanation reads.The University also claims that the word ‘picnic’ is “often associated with lynchings of black people in the United States, during which white spectators were said to have watched while eating, referring to them as picnics or other terms involving racial slurs against black people.”", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 06:00 PM", "title": "Half Of Australia's Population Locked Down As Delta Hysteria Worsens", "text": "Nowhere is the paranoia and overreaction to the (imaginary) threat posed by COVID's \"Delta\" variant more intense than in Australia, where tiny clusters of mostly mild COVID cases (most of which have reportedly been identified as instances of the Delta variant) have prompted another wave of lockdowns, involving  (the island nation's most populous city), but six other cities encompassing half of the Australian population (more than 12MM people).The cities now under lockdown include: Sydney, Brisbane, Perth, Darwin, Townsville and the Gold Coast. And on Wednesday, the outback town of Alice Springs also entered a snap lockdown after cases emerged in South Australia.Australian authorities now fear the Delta variant could now spread to nearby Aboriginal communities which are already vulnerable due to low vaccination rates. State leaders across the nation said they were \"facing a pressure cooker situation\" as more cases were discovered, triggering new lockdowns.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 06:20 PM", "title": "Censorship Kills", "text": "Whenever I write an essay critical of expert opinion on Covid, I immediately receive indignant replies. Some assume I must be a bleach-drinking supporter of President Trump. Others label me a dangerous libertarian since, in their view, I challenge the “best” source of expert opinion.Among my critics are well-meaning people who see no alternative but to follow the policy prescriptions of their favored experts. Karl Popper helps us understand why an “authoritarian attitude to the problem of human knowledge” hinders scientific progress. His essay “On the So-Called Sources of Knowledge” appears in his collection.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 04:20 PM", "title": "Forget Goldilocks: El-Erian Doubts \"Transitory\" Narrative, Fears \"Increasing Risk Of Instability\"", "text": "It is not often that I take a very strong view that runs directly counter to the market consensus. On the rare occasions in the past that I have done so, it has been an uncomfortable feeling at first.The question is whether my current scepticism over the consensus view of a “Goldilocks-like” scenario for markets of not-too-hot, not-too-cold conditions, moves from being an outlier to a baseline for economists and policymakers. The good thing on this one is that I will not mind if I end up being wrong as it would also mean a much lower risk of unnecessary economic and financial disruption.As highlighted by a recent Bank of America survey, markets are currently dominated by a consensus based on three core hypotheses: durable high global growth; transitory inflation; and ever-friendly central banks.By embracing this trifecta, investors have pushed equity and corporate bonds ever higher, anchored government bond markets, and sidelined short sellers who bet on falling prices.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 06:22 PM", "title": "Bill Cosby Conviction Overturned On Technicality, Will Be Released From Prison Within Hours", "text": "Bill Cosby's sexual assault conviction was overturned by Pennsylvania's highest court on Wednesday, after finding that an agreement with a previous prosecutor .BREAKING: PA Supreme Court overturns Bill Cosby's conviction. Orders his release. ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 07:00 PM", "title": "Majority Of Voters Reject Teaching Children That America Is \"Structurally Racist\": Harvard Poll", "text": "About two-thirds of Americans believe that children should not be taught in school the claim that the United States is a “structurally racist” nation dominated by white supremacy, a new poll revealed.The findings were published last week as part of an online survey () conducted by the Center for American Political Studies atand The Harris Poll between June 15 and 17, among 2,006 registered voters. The survey asked participants whether they “believe that kids in elementary school should be taught that America is structurally racist and is dominated by white supremacy.”", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 06:40 PM", "title": "Four Cali Residents Convicted Of Using $1.8 Million In PPP Funds For Luxury Homes, Gold Coins And Jewelry", "text": "While hundreds of billions of dollars in PPP money has (and will continue to go) unchecked as a result of arguably the government's most wasteful and poorly planned cash grab for citizens, the dragnetmanaged to pull in a couple of offenders.The latest of which were four California residents that were convicted by a Federal Jury on June 25 for \"scheming to submit fraudulent loan applications seeking millions of dollars in Paycheck Protection Program (PPP) and Economic Injury Disaster Loan (EIDL) COVID-19 relief funds,\" according to a .", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 09:05 AM", "title": "Mortgage Apps Crash To Pre-COVID Lows As Homebuyer Confidence Collapses", "text": "Who could have seen this coming?Despite near record high confidence among homebuilders and realtors (whose salaries depend on it), it would appear that it is collapsing homebuyer confidence that really matters after all...Howe do we know? Well aside from home sales tumbling, we are now seeing mortgage applications slumping to pre-COVID lows...Overall mortgage applications dropped 6.9% WoW - the biggest drop in almost 5 months", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 09:25 AM", "title": "The Lifeline Of Markets – Liquidity Defined", "text": "We recently read an analogy in which the author compares the current state of asset prices to an airplane flying at 50,000 feet. Unfortunately, we cannot find the article and provide a link. The gist is market valuations are flying at an abnormally high altitude. While our market plane cannot sustain such heights in the long run, there is little reason to suspect it will fall from the sky either.Many investors are writing on the current state of extreme equity and bond valuations. Surprisingly, there is little research focusing on what keeps valuations at such levels. Liquidity is our asset bubble’s lift and worth closely examining to better assess the markets’ potential flight path.In the investment world, liquidity refers to theand", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 09:51 AM", "title": "Chicago PMI Plunges Most Since April 2020", "text": "\"Soft' survey data has been doing what it does... surging ahead of actual \"hard\" data providing those who need it with proof that things are getting better.However, recent data has shown that soft survey data losing its lead and the latest Chicago PMI confirms that with the second biggest drop since 2015 (from 75.2 - the highest since 1973 - to 66.1)....Stagflation looms as prices accelerate and production and employment growth slows...pace; signaling expansion", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 09:45 AM", "title": "Dozens Die Across British Columbia And Pacific Northwest Amid \"Historic\" Heat Wave", "text": "The Pacific Northwest is experiencing a multi-day heat wave that we said last week would be \".\" The unrelenting triple-digit temperatures shattered records on Monday and Tuesday and have stressed out power grids in the Pacific Northwest and British Columbia. Many folks in these areas don't have central air condition and struggle to survive in these unprecedented conditions. At the moment, dozens have died of heat-related complications since last Friday.Just north of the Pacific Northwest is Canada's westernmost province, British Columbia, where Death Valley hot temperatures reached triple digits. Many folks in this region of the Pacific coastline and mountain ranges don't have central air condition and found it challenging to stay cool.reports more than 230 deaths across British Columbia have been recorded since Friday.The coroner for the region called it an ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 10:08 AM", "title": "Pending Home Sales Buck Dismal Trend - Surged In May", "text": " - new- and existing-home sales have slumped, homebuyer confidence has collapsed, mortgage applications have crashed, home prices are accelerating at a record pace, and even homebuilder confidence is starting to ebb.The last man standing for bulls to pin their hopes on and ignore everything else was today's Pending Home Sales which analysts expected to drop 1.0% MoM in May (after a 4.4% drop in April).  said Lawrence Yun, NAR's chief economist.\"The housing market is attracting buyers due to the decline in mortgage rates, which fell below 3%, and from an uptick in listings.\"", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 10:59 AM", "title": "WTI Pumps'n'Dumps After 6th Straight Weekly Crude Draw", "text": "Oil prices dumped and pumped overnight, testing below $73 and above $74, amid API inventory data, .“OPEC countries are cautious with regard to output-increase strategy amid oil market challenges,” Kuwait’s Oil Ministry said in a statement on Wednesday.“Any decision the organization will take will be in the interests of producers and consumers.”", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 10:59 AM", "title": "La Niña Ended In May, So When Is The Break From This Heat In The US?", "text": "SciJinks discusses the.In Spanish, El Niño means “the little boy” and La Niña means “the little girl.” They are sort of like a brother and sister. Like many siblings, the two weather patterns are opposites in almost every way. La Niña causes water in the eastern Pacific to be colder than usual. In the same region, El Niño can cause the water to be warmer than usual. Areas that are hit with drought during La Niña years are pummeled with rain in El Niño years.Climate.Gov discusses", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 10:48 AM", "title": "Robinhood Pays $70 Million To Settle Allegations Of Manipulation, Opening Door To IPO", "text": "Following reports that regulators have been throwing up obstacles to Robinhood's planned IPO, forcing the company to push back its expected timeline for the offering, the Wall Street Journal reported just minutes ago that the discount brokerage has just agreed to pay $70MM to settle allegations that have been giving the firm serious problems.The settlement with Finra, the industry's self-regulatory body, will resolve allegations that Robinhood misled customers, approved ineligible traders for risky strategies and didn't supervise technology that failed and locked millions out of trading. Finra announced the settlement Wednesday morning.\"We’re fine with innovation, but innovation can’t be at the cost of creating compliance and supervision systems,\" Finra Enforcement Chief Jessica Hopper said in an interview. Finra is privately funded by the brokerage industry is overseen by the Securities and Exchange Commission. Of the $70MM, $12.6MM will be used as compensation for harmed investors. shared an example, from Finra, of the type of behavior that led to the fine.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 11:44 AM", "title": "The Fed: Why Federal Spending Soared In 2020 But State And Local Spending Flatlined", "text": "In the wake of the Covid Recession and the drive to pour ever larger amounts of “stimulus” into the US economy, the Federal Government in 2020 spent more than double—as a percentage of all government spending—of what all state and local governments spent in 2020, combined.More specifically, federal expenditureswhile state and local spending.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 11:20 AM", "title": "Microsoft, Google Abandon \"Truce\" As Tech Giants Turn On Each Other Amid Anti-Monopoly Push", "text": "Now that humbling America's tech giants has become an issue with bipartisan support, a package of restrictive new measures targeting Big Tech is slowly moving through Congress, while President Biden  empowering regulators to While all the money firms like Facebook, Amazon and Google spend on lobbying may have saved them from being forcibly broken up, the new restrictions will unquestionably hurt the bottom line of big tech, while making it more difficult for the biggest firms to simply buy out any competitors who might threaten their dominance.Google has once again found itself squarely in the sight of regulators hoping to humble the company's display ads business, an integral piece of Google's dominance of the digital advertising space.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 12:00 PM", "title": "Putin Raises Question Of Russia's Next President, Setting Off Alarm In US", "text": "Russian President Vladimir Putin on Wednesday held an annual event that's somewhat unique to Russia referred to as a marathon call-in,which allows ordinary citizens to ask questions of their leader via a \"direct line\" telethon show lasting for hours.Putin engaged in discussion on multiple pressing topics, perhaps the most interesting which was the question of his successor.and other US-based press agencies  Putin as ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 12:15 PM", "title": "Amazon Seeks Recusal Of FTC Head Lina Khan As Antitrust Probe Ramps Up ", "text": "Amazon is pushing back against the Biden Administration's effort to impose new anti-trust strictures on Big Tech by filing a complaint with the FTC asking that Lina Khan, recently confirmed as head of the commission, recuse herself from all dealings involving Amazon.In its request, filed with the agency on Wednesday, the company argued that Khan should be barred from handling enforcement decisions involving Amazon  Amazon added thatas well as about the ultimate issue of culpability itself.\"", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 12:33 PM", "title": "Rabo: The Second Half Of 2021's Inflationistas Vs. Deflationistas Is About To Get Underway ", "text": "Sticking with a football theme today, I must add: “” This after England beat Germany 2-0, winning only their second major knock-out game at the Euros since 1996, the first not involving penalties since goodness knows when, and setting up a quarter final with Ukraine – which on paper even looks winnable. The majority of readers of this Daily are not English, but this news still provides an interesting sociological snapshot of how a country’s media reacts:The Guardian: The Times: ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 12:55 PM", "title": "Kim Jong Un Issues Rare Attack On Own Officials For Setting Off \"Great Crisis\"", "text": "Despite long denying - or at least never confirming - that his country has a severe COVID-19 pandemic outbreak in its midst, North Korean leader Kim Jong Un issued in a speech published Wednesday. He basically admitted government \"failure\" to handle a national health crisis, again which comes long after Pyongyang has carefully hidden how coronavirus may have impacted the isolated country for more than the past year.Further his remarks in state media sparked widespread speculation given his reference to - or elsewhere translated as a ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 01:39 PM", "title": "US Spy Plane Was Involved In Warning Shot Incident With UK: Putin", "text": "The details of last week's  in the Black Sea which saw \"warning shots\" fired by the Russian side continue to be shrouded in mystery and accusations and counter-accusations between the Kremlin and the West.On Wednesday Russian President Vladimir Putin inserted a new bombshell allegation regarding the dangerous June 23 encounter which could have sparked open conflict. During a live call-in news show, an annual tradition where the Russian leader fields ordinary citizens' direct questions, during the incident.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 01:20 PM", "title": "How Average Inflation Hit A Red Hot 2.4%", "text": "When even lifelong democrat Larry Summers warns that and expects it to be anything but \"transitory\" as the US has \"substantial inflation for real. It is not reflected in price indices but it will be or should be soon\"...This is substantial inflation for real. It is not reflected in price indices but it will be or should be soon. ... you know Joe Biden has an inflation problem, which can be summarized as a staggering 3.4% increase in core PCE.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 01:42 PM", "title": "Do We Hear A Trillion: Fed's Reverse Repo Hits Record $992 Billion, Up $150 Billion In One Day", "text": "There's not much we can add here: after all we have beaten to death the topic of the Fed's soaring reverse repo facility (see \"\" and especially \"\"), but while many were expecting fireworks for month and quarter end, nobody expected that a record 90 counterparties (up from 74 on Tuesday) would park an additional $150 billion in loose liquidity (for context, ) at the Fed's reverse repo facility where it is now earning 0.05% compared to the 0.00% rate prior to the June FOMC, ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 02:00 PM", "title": "CDC Director: Vaccinated People Don't Need To Wear Masks Amid Delta COVID-19 Variant Fears", "text": "U.S. Centers for Disease Control and Prevention () Director Rochelle Walensky issued a clarification on the COVID-19 “” variant, proclaiming that fully vaccinated individuals are protected against the strain and don’t need to wear masks.Some municipalities—", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 04:15 AM", "title": "Abu Dhabi Bars Unvaccinated People From Most Public Spaces", "text": "As paranoia surrounding the \"Delta\" variant intensifies, inspiring new lockdowns and other measures like the revival of mask orders (in LA, the Department of Public Health just issued a statement asking the public to return to wearing masks indoors when in public) around the world, the emirate of Abu Dhabi has announced that soon people who haven't been vaccinated will be barred from shopping centers, restaurants, colleges, recreational facilities and other places.The city’s government said the far-reaching measure - which has been approved by the Emergency, Crisis and Disasters Committee and will take effect on Aug. 20. - will exempt children below the age of 16, and others with an official exemption.\"The committee stated [that] the decision would enhance safety in areas that have been subject to additional precautionary measures and provide enhanced protection for community members,\" the Abu Dhabi Government Media Office said in a statement.The new measures will begin on Aug. 20, giving the tiny emirate more time to inoculate its citizens. Those who haven't been vaccinated against COVID-19 will not be allowed to enter shopping centers, restaurants, cafes, and all other retail outlets, including those which are not part of a shopping center, except supermarkets and pharmacies.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 05:00 AM", "title": "Accountancy Watchdog Investigates Auditors For Greensill Capital And Gupta Lender", "text": "The Financial Reporting Council (FRC) said itsEnforcement Division had started an investigation into accounting firm Saffery Champness in relation to its audit of the financial statements of Greensill Capital (UK) Limited for the year ending Dec. 31, 2019, following a decision to investigate on June 15.Greensill Capital, a supply chain finance company that filedfor insolvency protection in March, hasThe lender also reportedly to companies owned bysteel tycoon Sanjeev Gupta, according to the", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 10:05 PM", "title": "China: 100 Years Of Chaos", "text": "Lots going on this week in terms of the data and the end of Q2 – across financial markets investors will be scrabbling to ring fence returns made this year, and figure out where they are going to come from in the remaining quarters. Just how vulnerable, or resilient markets prove to be – well, that is always the question.However, the really big event this week is China celebrating 100 years of the CCP on Thursday. Actually, no one knows the exact date the cadre first assembled in a Shanghai smoky room – as he grew the cult, Mao only chose July 1stas an auspicious date for the commemoration years later. There are lots of questions around the 100 years of ChineseYou will find a multitude of opinions, answers and imaginings in the press this week.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 10:25 PM", "title": "Best Places To Live On A $50k Salary In Every State ", "text": "By now, it's become quite clear, even to the working poor, that quantitative easing and all the easy money policies by the Federal Reserve havesome of the worst wealth inequality this nation has ever witnessed. With inflation soaring and millions of people left in the dust as the rich get richer,has compiled the best places to live comfortably on a $50,000 salary.The best thing one can do, for the own sanity and health, is to move to an area where they can afford to live and save money.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 11:05 PM", "title": "San Francisco Homeless Camp Costs $60,000 Per Tent, Per Year", "text": "Today in \"liberals making wonderful capital allocation decisions with your tax dollar news\"...It turns out \"solving\" the homelessness problem that has (along with sky high taxes)been plaguing San Francisco, driving residents out of the city (and state), is a costly endeavor.In fact, ahomeless encampment run by San Francisco costs the city $60,000 per year, per tent, the  this week.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 10:45 PM", "title": "By 2030 You'll Own Nothing And You'll Be Happy", "text": "The title of this article projects Over the years I have written several articles covering the elite gathering in Davos. The global elites see the() as an opportunity to promote their views and various causes.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 11:25 PM", "title": "An Unflinching Guide To Biden's Immigration Fiasco", "text": "The crisis of illegal immigration - to give this calamity its true name - is. The reason is no mystery. .Instead of securing the U.S. border, the administration says it wants to deal with the “root cause,” desperation in Central America. That won’t work for two reasons. First, the administration doesn’t have the tools to markedly change conditions in Central America. Second, even if the policies could stimulate economic growth, improve safety, and reduce corruption—spoiler alert, they can’t—they won’t have any significant impact for years. Under even the most optimistic scenarios, they couldn’t reduce immigration anytime soon. It’s a policy based on a mirage.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 11:45 PM", "title": "IDF Forces Deploy New Semi-Autonomous Robots To Gaza Border ", "text": "An armed robot equipped with optical sensors and a 7.62mm machine gun has been spotted on the Gaza border by the Democratic Front for the Liberation of Palestine, a secular Palestinian Marxist–Leninist organization, according to.Israel Defense Forces (IDF) appear to have deployed a new semi-autonomous robotic ground tank called the Jaguar that patrols the Gaza border and removes soldiers out of harm's way from sniper attacks by Hamas and Palestinian Islamic Jihad groups.said Israel Aerospace Industries' Elta systems develop the unmanned ground vehicle in close collaboration with IDF's Ground Forces Command.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 12:05 AM", "title": "What The Pentagon Papers 50th Anniversary Means", "text": " The anniversary is worth marking, for reasons sweeping and grand, and for reasons deeply personal.In 1971leaked the Pentagon Papers, a secret U.S. government history of the Vietnam War, to the.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 02:00 AM", "title": "Escobar: A Sea Painted NATO Black", "text": " The co-hosts are the US Sixth Fleet and the Ukrainian Navy. The main protagonist is Standing NATO Maritime Group 2.The show, in NATOspeak, is just an innocent display of “strenghtening deterrence and defense”. NATO spin tells us the exercise is “growing in popularity” and now features more than 30 nations “from six continents” deploying 5,000 troops, 32 ships, 40 aircraft and “18 special operations and dive teams”. All committed to implement and improve that magical NATO concept: “interoperability”.Now let’s clear the fog and get to the heart of the matter.  NATO’s supreme articles of faith, reiterated in its latest summit, are “Russia’s illegal annexation of Crimea” and “support for Ukraine sovereignty”.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 02:45 AM", "title": "CO2 Emissions For Vehicles In EU, Iceland And Norway Fall Most In Ten Years", "text": "The average total emissions for new passenger vehiclesregistered in the EU, Iceland, Norway and the U.K.fell the steepest in ten years in 2020, according to new data provided by the European Environment Agency.Total emissions decreased by 14.5g of CO2/km during the year, Bloomberg reported Tuesday.The decline was attributed mostly to a \"surge\" in the share of plug-in hybrid and fully EV vehicle registrations, which tripled to 11% from 3.5% in 2019. The agency says that despite electric cars rising in prominence, that only \"limited\" progress was made in electrifying vans.This followed ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 03:30 AM", "title": "The Brutal Truths About UK Housing", "text": "I was going to write about giga-factories, lithium mining and other dinosauric investment myths this morning, but the first thing that caught my ear this morning was a very earnest young economist from some bank in the City commenting on the 13.4 % annualised rise in UK Housing Prices. He was asked to explain why, during the worst economic shock in 300 years (the Pandemic, in case anyone has forgotten), house prices were on the up he went into behavioural analysis about couples reassessing work/life balance, deciding to upsize, moving out the conurbations, etc.Twaddle.Utter Twaddle. Famously, economists will never agree on anything. Put three of them in a box and expect 4 different theories on box economics.Suffice to say, I disagree with the young man. ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 05:45 AM", "title": "NSA Claims No Spying On Tucker Carlson In Broadly-Worded Denial", "text": "The National Security Agency (NSA) has responded to  that they've been monitoring the communications between members of his crew with the intention of getting the show canceled.In a Tuesday tweet that nobody can respond to, the agency said that the allegation is \"untrue,\" adding \".\"", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 06:30 AM", "title": "Michael Pento: How Central Banks Murdered The Markets", "text": "The Japanese Government Bond market is nearly $10 trillion in size. It is the 2nd biggest bond market in the world. However, it comes as a shock that this humongous market barely trades any longer. Meaning, there are almost no private investors who will touch it any more. The Bank of Japan has bought so much debt that it forced interest rates below zero percent back in 2016; and the result is the free market has subsequently died.which are guaranteed to lose principal in nominal terms—and deeply negative results after adjusting for inflation. This is prima facie evidence that centrals banks have committed murder-one when it comes to markets. Back in February of 2012, at the height of the European debt crisis, the Greek 5-year Bond Yield skyrocketed to 63%. The free-market deemed the nation to be insolvent and that it could never pay back its debt without returning to the Drachma; and then turning it into confetti. Hence, bond yields surged—makes perfect sense, correct? Also in 2012, the Greek National debt to GDP ratio was 160%. Today, that ratio has soared to an all-time record high of 210%; and yet, these bonds display a negative cash flow going out 5 years in duration. Only one thing has changed: central banks deemed it mandatory to step in and replace the entire demand for government debt in order to force interest rates towards zero percent. It is the only way these countries would have any semblance of solvency.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 05:45 AM", "title": "JP Morgan Makes Paris Its Post-Brexit European Trading Headquarters", "text": "JP Morgan has officially moved the company's trading hub to Europe.The move comes as a result of France looking to welcome more investment banking business and as finance workers from London relocate as a result of Brexit.JPMorgan Chase Bank’s main trading center is now located in Paris, according to comments fromChief Executive Officer Jamie Dimon. Theinauguration of the new headquarters took place on Tuesday of this week, according to .French President Emmanuel Macron was also at the ceremony.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 06:55 AM", "title": "New York City Mayor's Race \"Plunges Into Chaos\" As 130,000 'Test-Run' Votes Lead To Unprecedented \"Discrepancy\"", "text": "The BOE has confirmed Hardt's reporting:The NYC Board of Elections counted 135,000 test ballots together with real ballots and released “results” without anyone at BOE noticing.\nTrump lost the WH by 43,000 votes spread in 3 states and he is corroding democracy if he has concerns about the integrity of those numbers.Wtih the New York City Mayoral race \"plunged into chaos\" (as the ", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 07:48 AM", "title": "Shaky Futures Close Out Second Best First Half Since 1998", "text": "US stock index futures treaded water after rebounding from session lows on the last day of the quarter, one day after the S&P 500 and the Nasdaq closed at record levels, as rising renewed lockdown risks from the delta coronavirus strain overshadowed confidence in the global economic recovery. The S&P 500 has climbed about 14.3% in the first half of the year and ...... with energy, financials, real estate and communication services stocks notching the best performance at the sectoral level. The S&P growth index which houses mega-cap FAAMG names has jumped nearly 11.9% this quarter, outperforming its value peer and narrowing the gap for the year-to-date performance.At 715 a.m. ET, Dow e-minis were down 54 points, or 0.16%, S&P 500 e-minis were down 1.5 points, or 0.04%, and Nasdaq 100 e-minis were down 16.75 points, or 0.12%.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 08:21 AM", "title": "ADP Employment Gains Slow In June", "text": "ADP reported the addition of 692k jobs in June (better than the expected 600k but a slow down from May's 886k addition)... from 978k as reported last month.Information and management services firms saw employment shrink.“The labor market recovery remains robust, with June closing out a strong second quarter of jobs growth,” said Nela Richardson, chief economist, ADP.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 08:30 AM", "title": "Oil Jumps Ahead Of OPEC+ On Speculation Oil Supply Deal May Be Extended", "text": "Brent jumped back over $75 this morning - cementing a stellar first half for oil which saw oil prices rise by 50% for its best half since 2009 - pushed higher by a Reuters report that OPEC+ is expected to discuss the extension of the oil supply deal beyond April 2022 following earlier that some minsters are concerned about an oversupplied market in 2022.The jump reversed however following unconfirmed reports that ahead of tomorrow's OPEC+ meeting, Russia had expressed its favor for an increase in OPEC+ oil production starting form August, with an increase between 500k-1mln BPD suggested. As OPEC journalist Reza Zandi added, some members disagree with such suggestions out of the fear that COVID might surge again.As usual, ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 08:45 PM", "title": "Arizona's Maricopa County Will Replace All Voting Machines After Audit", "text": "Authorities in, Arizona, announced they will replace all voting machines following a Senate-ordered audit of the county’s 2020 election results.The Maricopa County Board of Supervisors, which oversees elections in the county, issuedto a letter sent by Arizona Secretary of State", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 04:01 PM", "title": "Bitcoin, Black Gold, & The Buck Bounce As England Beat Germany", "text": "Record surge in home prices (transitory), and Americans' \"hope\" is dramatically lagging their current exuberance...which has tended to end badly...But this is what really mattered today...I'm in tears even Bozo Boris was surprised to see Harry Kane score 😂😂  ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 04:35 PM", "title": "WTI Extends Gains After 6th Weekly Crude In A Row", "text": "Oil prices ended higher as OPEC and allies delayed their Joint Ministerial Monitoring Committee meeting to Thursday from Wednesday to allow countries more time for talks offering bullish oil traders some hope that any production increase may be less than expected. While OPEC+ members such as Russia have considered backing an increase in output, Saudi Arabia has exercised caution in the face of growing demand and global spread of the delta variant. saidRebecca Babin, senior energy trader at CIBC Private Wealth Management.But for now, while we all await Thursday's OPEC+ decision, API will be the next trigger move.Crude -8.153mm (-4.7mm exp)", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 04:20 PM", "title": "14 Astonishing Facts About The Blistering Heatwave That Is Absolutely Frying The Northwest Right Now", "text": "What we are witnessing right now is . I know that I have been making a lot of statements like that lately, but it is undeniable that some very strange things are happening. For example, over the past couple of years I have been consistently warning thatglobal weather patterns were starting to go completely nuts, and at first there were some people that didn’t believe me. But now nobody can deny that  In the past, there have been times when the weather has gotten really hot and a city or two may set a new high temperature record for a particular date, but this week we are seeing city after city shatter their all-time records for hottest temperature ever recorded on any date. We have never seen anything like this before, and hopefully this does not become “the new normal”.The following are 14 astonishing facts about the blistering heatwave that is absolutely frying the Northwest right now…", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 04:45 PM", "title": "When Expedient \"Saves\" Become Permanent, Ruin Is Assured", "text": "All the Fed has is an incoherent jumble of expedient, panic-driven \"saves\" it cobbled together in the 2008-2009 Global Financial Meltdown that it had made inevitable.The irony is that the Fed's leaky grab-bag of expedient \"saves\" was not designed to ensure systemic stability, though that was the PR cover story.the purpose of all the 2008-2009 extremes was not to impose the discipline required to truly stabilize the financial system; the purpose was to elevate-- the separation of risk from the consequences of risk--to unprecedented heights, backstopping every skimmer, scammer, fraudster and embezzler from well-deserved losses as the entire pyramid of fraud collapsed under its own enormous weight of risky bets gone bad.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 05:05 PM", "title": "Blankfein, Cohn To Face Shareholder Lawsuit Over Massive 1MDB Corruption ", "text": "For a while, it looked as if Lloyd Blankfein, Gary Cohn and other senior Goldman executives who were around when the firm first started doing business with 1MDB, the Malaysian sovereign wealth fund that was plundered by associates of former PM Najib Razak while also being utilized as a political slush fund (the money was supposed to be used on public works projects in poor Malaysia).Although Blankfein and others were forced to return some of their bonus pay, Gary Cohn - who left the bank to serve as Trump's top economic advisor for a brief time before being unceremoniously ousted from the West Wing - appeared to have successfully snubbed the bank's claw-back attempts, But while Blankfein and others have escaped criminal liability, it looks like they won't be so lucky on the civil front.Blankfein and Cohn must face a shareholder lawsuit over the 1MDB global bribery scandal, a judge ruled yesterday. US District Judge Vernon Broderick denied requests from Goldman, Blankfein and Cohn to dismiss a shareholder lawsuit led by Swedish pension fund Sjunde AP-Fonden. However the judge did drop former co-COO Harvey Schwartz from the case.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 05:25 PM", "title": "Stop Gaslighting Parents On Critical Race Theory", "text": "Proponents of Critical Race Theory are  to defend a dogma that most Americans instinctively abhor.Some pundits claim that CRT is exclusively a school of thought taught in legal academia. On her MSNBC show, Joy Reid that “law school is really the only place it is taught. NBC has looked into everywhere.” Former Lincoln Project co-founder George Conway ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 05:45 PM", "title": "US COVID Cases Tick Higher As Media Chokes On Dire Delta Variant Warnings", "text": "Once again, hopes that COVID-19 had finally been defeated in the US, Europe and a handful of other countries are being dashed by hysterical warnings about the \"Delta\" variant, a COVID mutation so infectious that epidemiologists are now concerned that humanity may never reach herd immunity from SARS-CoV-2 and its genetic heirs.The Delta variant has inspired another wave of fearmongering from 'experts' like Dr. Anthony Fauci, who recently said it's the biggest threat currently facing the global COVID response. The media has lapped up these warnings, inspiring some local health authorities to revive mask-wearing rules Although the uptick is barely discernible from looking at a graph of daily cases, the seven-day average of new cases in the US, at 12.6K, has just risen off of a record low, potentially marking the end of a steep decline from 69K daily cases in April.Experts have blamed the spread of Delta, particularly in southern states with lower vaccination rates, for driving the renewed spread. The strain, which was first identified in India, has become the dominant strain in the UK - it's what inspired PM Boris Johnson to delay the end of England's lockdown - while also spreading across regions like Southeast Asia and Africa.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 06:05 PM", "title": "\"A Half-In, Half-Out Regime\": Justice Thomas Slams Continued Criminalization Of Marijuana In Little Noticed Opinion", "text": "As we wait for the final cases from the Supreme Court this week, Monday was confined to orders of the Court, including the granting and denial of review of cases. One of the cases that was declined was. That is hardly news on a Court that rejects most petitions for a writ of certiorari. He is, of course, correct.However, the criticism from one of the Court’s most conservative members was particularly notable. The timing is also notable. This week, the", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 06:22 PM", "title": "And Now Prices Are Really Soaring: June Rent Jump Is Biggest On Record", "text": "With BofA predicting that the US is facing a period of \"\", one which could , as a result of soaring commodity prices in everything from metals to food and beyond, in what increasingly more warn is a stagflationary burst right out of the 1970s playbook...... it makes sense that home prices are also surging thanks to trillions in stimmy checks, near-record low mortgage rates and an exodus away from cities, and as we noted two ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 06:45 PM", "title": "Goldman Snubs NY & NJ, Looks To Open New Office In Dallas", "text": "Once upon a time, Goldman Sachs was known as a powerhouse in the world of commodities, a status it attained following its acquisition of J Aron, the commodities brokerage that was once the home of former Goldman chieftains Lloyd Blankfein, Gary Cohn, Harvey Schwartz and others. But Goldman dumped most of its physical commodities business years ago at the start of what was to become a yearslong bear market in oil and other industrial commodities.Now, after the bank's strategists have repeatedly (and correctly) called the run-up in crude prices, the start of (with crude expected to  in the not-too-distant future), Bloomberg reports that the storied Wall Street investment bank is looking to expand its physical footprint in Dallas.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 06:25 PM", "title": "SoftBank Halts Production Of Iconic $1,800 Humanoid Robot As Sales Slump", "text": "Last week, SoftBank founder Masayoshi Son made waves when he told shareholders and reporters assembled for SoftBank's 41st annual meeting that he envisions himself as a \"21st-century Rothschild\", explaining that while Rothschild provided the capital to finance the industrial revolution, he and SoftBank are providing the capital to finance the 21st century's AI revolution. For emphasis, Son shared the following slide from one of SoftBank's notoriously quirky presentations.Of course, Son's obsession with advancing AI technology via the firm's venture capital investment portfolio has been a notoriously mixed bag - though Son's returns from a handful of successful bets have helped cushion the firm's losses from blunders like the eye-popping valuation it assigned to WeWork. Even Son joked during the meeting that some of his backers say they like him \"very much\" as an entrepreneur, but not as an investor.Well, in what appears to be the latest setback for SoftBank's AI efforts, the company has just suspended production of Pepper, a humanoid robot that was me of Son's favorite pet projects at the conglomerate. According to , the suspension comes as the robot, priced at $1,790 apiece, failed to make an impact with consumers. Inventory has gotten pretty backed up, and it could take a while for the company to clear it - if that ever happens. The suspension might not be permanent, as SoftBank left open the possibility that it might restart production if sales start to pick up. Only 27K Peppers were ever produced.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 07:05 PM", "title": "Man Crowned Miss Nevada USA, First In Pageant History ", "text": "The first transgender woman has been crowned Miss Nevada in Las Vegas on Sunday and will compete for the Miss USA title in November, according to.Leading up to the Miss Nevada pageant, Kataluna Enriquez, 27,Miss Silver State USA in Nevada in late March.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 07:45 PM", "title": "Tom Brady, Gisele Bündchen Take Equity Stake In FTX Crypto Exchange", "text": "It was a rough month for seven-time Superbowl champion Tom Brady, who top-ticked the recent collapse in bitcoin almost to the day with his \"laser eyes\" profile picture change, something he himself mocked yesterday when he tweeted \"Alright the laser eyes didn’t work. Anyone have any ideas?\"Alright the laser eyes didn’t work. Anyone have any ideas? It retrospect, this was a rhetorical question because just one day later we learned that Tom Bradyand his wife Gisele Bündchen - best known for demanding to be paid in euros top ticking the common currency ahead of its all time high in 2008 - have taken an equity stake in crypto exchange FTX () and will receive crypto as part of an endorsement deal with the crypto exchange, which includes a bonus that will be paid in crypto.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 08:05 PM", "title": "With The Fed In Denial, Hawkish Bank Of Russia Sees Inflation \"Not Transitory\", Warns Of Possible Shock-And-Awe Rate-Hike", "text": " 2 percentage points above the Bank of Russia’s target of 4.0%.Polls in Russia show that food inflation is a top concern, currently running at 7.4%. The Consumer Price Index (CPI).", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 08:25 PM", "title": "India, A Well Known Source Of Gold Demand, Is Turning A Keen Eye Toward Crypto", "text": "India has long been known for being a strong source of demand for gold - not only for wealth preservation, but also for cosmetic and jewelry purposes.But now it looks as though something else has caught the country's eye: crypto.This could mean that themantra that could actually be catching on, ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 09:05 PM", "title": "Biden Plans Anti-Monopoly Executive Order Targeting Big Business", "text": "Yesterday, a US district judge tossed out an anti-trust case  by the federal government and a coalition of states (swiftly sending the tech giant's market cap past the $1 trillion mark). At the same time, reports emerged claiming the DoJ's anti-trust division was preparing to revive a Trump-era anti-trust push With Lina Khan in charge at the FTC and Tim Wu installed as special assistant to the president on competition, increasing attention is being paid to the Biden Administration's anti-trust plans now that breaking up Big Tech has become an issue with bipartisan support in Congress, with lawmakers of both parties supporting more scrutiny (while others said to be in the pocket of Big Tech have dutifully pushed back). As curiosity about the administration's next steps mounts,  reported Tuesday evening (following an earlier report from ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 08:56 PM", "title": "Fear Spreads As Another Miami Beach Condo Tower Deemed \"Unsafe\"", "text": "Haunted by the recent  in Surfside, some residents of ocean-side apartments in South Florida have been searching for information about the structural integrity of their condominiums. The residents of a Collins Avenue building with prior warnings in Miami Beach said they are horrified about what they found.\nThe fear started after Champlain Towers South, at 8777 Collins Ave., turned into the epicenter of heartbreakand grief on Thursday morning. Some of the residents of the Champlain Towers North and East decided to evacuate.Days following the incident, two studies on the 12-story residential structure came to light. One was a field study from 2018 by an engineering firm that ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 09:45 PM", "title": "76% Of San Francisco Voters Want More Cops As Crime, Appalling Street Conditions Get \"More Brazen\"", "text": "A recent poll conducted by theSan Francisco Chamber of Commerce found that , at a moment people are fleeing the liberal, extremely high cost of living west coast city in droves, heading for places like Austin in Texas.A seemingly endless amount of public funds have also been poured into\"solving\" the homelessness problem that has (along with sky high taxes)been plaguing San Francisco, adding toresidents' desire to get out of the city.Fox ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 09:36 PM", "title": "Supreme Court Leaves Eviction Moratorium Intact As Roberts And Kavanaugh Join Liberals", "text": "While it has long been known that Supreme Court Chief Justice John Roberts is a CINO (conservative in name only), it may come as a surprise that one of Trump's own SCOTUS appointees, Brett Kavanaugh, sided with the three supreme court justices in a divided decision refusing to lift the moratorium on evictions implemented by the CDC during the covid pandemic and which is due to expire in any case at the end of July.The 5-4 vote had little practical value, and rejected calls by landlords and real-estate trade associations from Alabama and Georgia to block the moratorium while their challenge goes forward. They contend the U.S. Centers for Disease Control and Prevention exceeded its authority by imposing the ban.Chief JusticeJohn Robertsand JusticeBrett Kavanaughjoined the court’s three liberals in the majority. Kavanaugh cast the pivotal vote, saying he was letting the ban stay in effect even though he thought the CDC had exceeded its power.“Because the CDC plans to end the moratorium in only a few weeks, on July 31, and because those few weeks will allow for additional and more orderly distribution of the congressionally appropriated rental assistance funds, I vote at this time to deny the application,” Kavanaugh wrote.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 08:45 AM", "title": "Inflation's The Nail In the Coffin Of Biden's Spending Plans", "text": ".If there is any economic sense left in Washington, the rising inflation threatshould grind President Biden's big-government spending plans to a halt.FederalReserve officialshavecalled inflation “transitory,”  The public is clearly worried.According to a new Harvard CAPS/Harris poll released this week,of Americans are concerned about inflation. For good reason.Last month, the Consumer Price Index rose at its fastest level", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 02:23 PM", "title": "Daily Briefing: The Ideological Trade: Value, Oil, and Inflation", "text": "Real Vision’s Jack Farley welcomes Samuel Burke, managing editor, and Jared Dillian of The Daily Dirtnap to the Daily Briefing to discuss U.S. treasury yields, commodity prices, and delta variant concerns. Dillian explains his investment framework amidst growing fears of the delta variant in the U.S. The trio covers decreasing treasury yields and their effect on the inflation trade. Further, they examine the nuances of the commodity market as lumber prices move lower and oil prices remain resilient.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 10:05 AM", "title": "Conference Board Confidence Near Pre-COVID Levels, Inflation Expectations At 13 Year High", "text": "Following last month's extraordinary divergence between hope (tumbling) and current conditions (soaring), analysts expected some level of convergence but instead the current conditions index continued its dramatic surge higher (almost back to pre-COVID levels) while hope (expectations) rose only modestly to 107 (from a revised 100.9).The headline Conference Board Consumer Confidence data rose from an upwardly revised 120.0 to 127.3 (smashing expectations of 119.0). said Lynn Franco, Senior Director of Economic Indicators at The Conference Board.“Consumers’ assessment of current conditions improved again, suggesting economic growth has strengthened further in Q2. Consumers’ short-term optimism rebounded, buoyed by expectations that business conditions and their own financial prospects will continue improving in the months ahead.\"", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 10:18 AM", "title": "Syria Says US Strikes Killed Child, Wounded 3 Civilians As Biden Defends Against Congressional Pushback", "text": "Details are emerging on the overnight US attacks against the border area of Iraq and Syria. One of the strikeskilled a child, and wounded three civilianswhen it hit a residential area, Syrian state sources say. .That missile strike hit an area in al-Bukamal, the main border crossing city in Syria leading to Iraq. There is no indication why the US thought this residential area was a military target, though US officials maintain that the strikes were valid as \"self-defense.\"", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 10:59 AM", "title": "The Fate Of The World Will Be Previewed In The UK", "text": "The U.K. will soon confirm if the world will transition rapidly to accept living with Covid-19 as an endemic disease or instead 2H will be about returning lockdowns.On Monday, the U.K. reported the most number of daily Covid cases in almost five months, as the highly contagious delta variant becomes rampant.It’s a worrying chart.But the reason the next few weeks in the U.K. are so crucial for everyone to monitor is that the country is also a leader in vaccines. ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 10:39 AM", "title": "Hot-Rolled Steel Prices Hit Record As Infrastructure Deal Nears ", "text": "Future prices for hot-rolled steel, commonly used in producing frames for trucks and heavy machinery, hit a record high Monday on the prospects of an infrastructure deal nears.July Nymex Midwest Domestic Hot-Rolled Coil Steel Futures hit a record high of $1,801 Monday, rising nearly 1%, after more than doubling from the virus pandemic low in 1Q20.Hot rolled steel is used in agriculture and heavy machinery equipment because of its high strength and formability. With the Biden team in damage control last weekend,they will sign the roughly $1 trillion bipartisan infrastructure, prices have been on a tear. Base metal prices, such as copper, iron ore, and other metals, have also surged, as bets that infrastructure spending to revamp and expand railroads, highways, and bridges will boost demand.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 11:13 AM", "title": "Biden Assures Israeli President He Won't Tolerate A Nuclear-Armed Iran", "text": "On Monday President Biden hostedIsraeli President Reuven Rivlin in the Oval Office, where he made his first public statements on Sunday night's airstrikes he ordered against \"Iran-backed\" militias on the Syria-Iraq border. Biden talked up being \"tough on Iran\" while assuring Rivilin the US won't tolerate Tehran ever obtaining nukes. Biden called the military strikes (the 2nd of his presidency)a \"\"to Iran.Biden to America's closest Mideast ally. Rivlin responded that he was \"very much satisfied\"by the US president's statement.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 11:55 AM", "title": "Watch: Huge Sandstorm Swallows Mongolian City", "text": "Worldwide weather appears more volatile than ever, or perhaps social media and how news quickly decimates just makes us more aware of these events.The Twitter user said,The video qingyanjiejie posted shows a massive wall of sand encompassing a city in Inner Mongolia.\n6月28日下午，内蒙古 巴彦卓尔乌拉特后旗、乌拉特中旗出现强 沙尘暴 天气。数百米长的沙墙伴随着风席卷而来，遮天蔽日 ，整个天空呈暗黄色，空气中弥漫着扬沙⋯⋯ ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 11:44 AM", "title": "The Pandemic Is Over According To 57% Of Republicans... And 4% Of Democrats", "text": "Although a record-high 89% of Americans now say the coronavirus situation is improving, most are not yet ready to declare the pandemic over in the U.S. More than twice as many think the pandemic is not yet over (71%) than think it is over (29%).These findings are from Gallup's June 14-20 probability-based web panel survey, which was conducted as increased vaccinations in the U.S. resulted in declining COVID-19 cases, hospitalizations and deaths. These developments are likely instrumental in the public's growing belief that the coronavirus situation is getting \"a lot\" (46%) or \"a little\" better (43%).With pandemic-related restrictions in most states now lifted, the amount of disruption Americans see in their everyday lives continues to decline. Less than half of U.S. adults, 46%, currently say their lives are affected \"a great deal\" or \"a fair amount,\" but more, 54%, consider their lives to be \"not much\" or \"not at all\" disrupted.Likewise, Americans are increasingly reporting a return to some semblance of normalcy in their lives. While 15% of U.S. adults say their life is \"completely back to normal,\" 62% describe their life as \"somewhat\" but not completely normal, and 23% say it is \"not yet back to normal.\" Moreover, the percentage of U.S. adults who report that normalcy has not been restored in their lives has shrunk by 11 percentage points since May.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 11:32 AM", "title": "LA County \"Strongly\" Recommends Masks For Vaxx'd & Unvaxx'd People Over \"Delta\" COVID-19 Variant", "text": "“Public Health strongly recommends people wear masks indoors in settings such as grocery or retail stores; theaters and family entertainment centers, and workplaces when you don’t know everyone’s vaccination status,” the Los Angeles County Department of Public Healthin a statement on Monday.The county’s recommendation comes about two weeks after Democrat Gov. Gavin Newsom lifted California’s mask mandate and ended lockdown provisions in the state.But the agency said that the mask recommendation—which is not a mandate—is being issued because officials don’t know the exact effects or the transmission rate of the Delta variant. They also suggested that the variant might be able to lead to breakthrough COVID-19 cases among vaccinated individuals", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 12:15 PM", "title": "Warnings From Behind The Curtain", "text": "almost sounds like the title of a goodfiction novel. However, this time, the story is of warnings for investors not often discussed by the mainstream media.Notably, there is a necessary clarification that must get made.For example, a warning label that says", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 12:35 PM", "title": "Several Observations Ahead Of Didi's Massive IPO Tonight", "text": "With the Didi Chuxing US IPO set to price tonight at the  (the IPO was covered multiple times early on the first day of the bookbuild last week and the investor books were closed on Monday, one day ahead of schedule), below we present two observations ahead of what will be the biggest US share sale by a Chinese company since Alibaba raised $25 billion in 2014 in what is already a year of record IPOs.The first, and more downbeat one, comes from Bloomberg's Julia Fioretti who notes that despite a record year for global initial public offerings, companies are still finding their valuation targets being adjusted downwards by investors.Take Didi Global Inc. ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 12:52 PM", "title": "Daily Briefing: Are Investors Correctly Pricing Delta Variant Risk?", "text": "Real Vision senior editor Ash Bennington welcomes Real Vision interim managing editor Samuel Burke and Tommy Thornton of Hedge Fund Telemetry to the Daily Briefing to discuss Bitcoin’s rebound and market sentiment as delta variant fears grow. Thornton shares his bullish outlook for Bitcoin and potential explanations for its recent bounce from 6-month lows. In addition, Burke provides a unique perspective on European lockdowns and investor opinions as the delta variant of Covid-19 continues to spread.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 12:55 PM", "title": "The Dawn Of A New Era For US Shale", "text": "Higher oil prices and capital expenditure discipline are for the world’s exploration and production companies this year. And U.S. shale firms—set to generate $60 billion free cash flow—are primed for playing a key role in the record-breaking free cash flow from global upstream operations.The U.S. shale patch is expected to be the biggest beneficiary of capex discipline and high oil prices, as well as the largest contributor to the highest-ever free cash flows from the upstream business globally, independent research firm Rystad Energy said in a new. - from supermajors to U.S. independents - that is contributing to record cash flows this year.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 01:14 PM", "title": "White House Defends Olympians \"Protesting\" Anthem As GOP Leaders Urge Ban On \"Activist Athletes\"", "text": "Amid a  of of US Olympians using the spotlight for \"activism\" when it comes to respect or lack thereof shown toward the American flag or anthem, we earlier predicted there's very likely more to come as the games soon kick off in Tokyo. This is especially likely now that , who will represent the US in the hammer throw at the summer games.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 01:35 PM", "title": "Peter Schiff: Everything Is Great! Because The Fed Says So", "text": "The S&P 500 closed last week at an all-time record high. This is quite a reversal from the previous week. In his podcast, Peter Schiff said there has been a shift in expectations. After, investors were jittery that the Fed was going to tighten monetary policy to fight inflation. Now the thinking seems to be that there is no inflation problem. It really is just transitory.Everything is great because – well – the Fed tells us so!The big difference between last week and this week was last week everybody was worried that the Fed was going to fight inflation. This week they’re not worried that the Fed is going to fight inflation because they don’t think there’s any inflation to fight because they pretty much have decided that the Fed is right and that inflation is transitory.”", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 02:15 PM", "title": "\"Absolutely Shameless\": WH Press Secretary Blames Republicans For Defunding Police", "text": "In another exchange with Fox News reporter Peter Doocy, Psaki argued that the lack of support on the right for Biden’s massive pork filled COVID relief bill equates to wanting to defund law enforcement.Absolutely shameless. Under questioning from Fox's Peter Doocy, White House Press Secretary Jen Psaki argues it's *Republicans* who have been defunding the police and not supporting law enforcement because they didn't vote for Biden's stimulus boondoggle the American Rescue Plan. Republicans didn’t vote for the bill because it had nothing to do with COVID and everything to do with more government control.Last year after unrest and violence targeting police, Harvard university Professor Roland Fryer", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 01:54 PM", "title": "Japan Mulls Extension Of Tokyo Emergency Measures As Leg Of Olympic Torch Relay Canceled", "text": "With most foreign spectators barred, the Tokyo Games are already likely to lack much of the spectacle that makes the Olympics such a larger-than-life event. But as Japan's vaccine rollout plods on, , leaving the measures in place during and even after the Games.Japanese press reports claimed government officials have floated the idea of holding the Olympics without spectators if the emergency measures are extended beyond July 11, the date they are currently set to expire.Mainichi quoted some government officials saying that at the very least, the games will need to be held without spectators to stave off the possibility of an outbreak of the \"Delta\" variant, the subject of new fearmongering campaigns being launched around the world by public health experts like Dr. Anthony Fauci.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 02:59 PM", "title": "Indicted Israeli Traders Had Ties To Muddy Waters In 2014, Before Severing Ties", "text": "Two Israeli traders facing insider trading charges were once \"close associates\" of short seller Muddy Waters, before splitting due to a dispute in 2014, according to a . The traders split from Block in 2014 after Block said he suspected that they were selling information from Muddy Waters reports prior to the firm publishing them.Tomer Feingold and Dov Malnik were both said to have approached Muddy Waters founder Carson Block in 2010 after Block's firm published a report on Orient Paper Inc.Block said that even though Feingold and Malnik were \"close friends\", they told him that they only had \"passing familiarity\" with each other at the time. Block told Bloomberg that the pair played \"significant roles\" in both field research and trading for some of Muddy Waters' earliest reports. They contributed to the firm's blockbuster report on Sino-Forest, which Muddy Waters exposed as \"one of the biggest frauds in Canadian stock market history\".", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 10:30 PM", "title": "New Study Finds COVID-19 'Very Well Adapted' To Specifically Infect Humans", "text": "An Australian team of researchers has published a new study which found that SARS-CoV-2, the virus which causes COVID-19, , according to the .\"The computer modelling found ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 10:50 PM", "title": "Critical Race Theory Banned In 6 States (That's 44 States Too Few)", "text": "Critical Race Theory (CRT) is banned in 6 states and pending bans in at least 18 more.Critical race theory (CRT) is an academic movement of civil-rights scholars and activists in the United States who seek to critically examine U.S. law as it intersects with issues of race in the U.S. and to challenge mainstream American liberal approaches to racial justice.CRT views race and white supremacy as an intersectional social construction which serves to oppress people of color and marginalized communities at large (i.e gender and class)..", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 11:10 PM", "title": "\"Scared Me To Death\" - 2 Earthquakes Rattle Baltimore City In Days ", "text": "Something very odd is happening around the Baltimore Metropolitan Area, where two earthquakes have been recorded in a matter of days. The occurrence of earthquakes in the metro area is rare.When we think of earthquakes in the US, they're usually in California, the Coastal Pacific Northwest, Alaska, Hawaii, among other hotbed areas.But Baltimore? reports that a 2.6 magnitude earthquake rattled the area on Friday, and another 1.7 magnitude hit on Sunday.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 11:30 PM", "title": "Former Intel Chief Calls For \"Larger Discussion\" On UFOs, Warns They Display Technology US Doesn't Have", "text": "Former Director of National Intelligencesaid that Unidentified Aerial Phenomenon (UAP), also known as UFOs, Ratcliffe made the remarks in anthat aired Saturday, one day after the", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 02:00 AM", "title": "Former NHS Doc Exposes Six Impossible (British COVID) Things Before Breakfast", "text": "Alice laughed. “There’s no use trying,” she said. “One can’t believe impossible things.”“I daresay you haven’t had much practice,” said the Queen. “When I was your age, I always did it for half-an-hour a day. Why, sometimes I’ve believed as many as six impossible things before breakfast.”I hope the readers will forgive a little self-indulgence on my part if I relate At the time, the Health Secretary Alan Milburn (advised by the youthful Simon Stevens) had issued strict waiting time targets to all hospitals.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 12:10 AM", "title": "When A President Lies", "text": "“Did you, too, O friend,\nsuppose democracy was only for\nelections, for politics, and for a party name?”– Walt Whitman,“", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 11:50 PM", "title": "India May Have Failed To Count As Many As 1 Million COVID Deaths", "text": "With nearly 400K COVID-19 deaths, India has the world's third-highest coronavirus death toll, following the US (in first place with more than 600K+) and Brazil (coming in second with 510K+). For months now, we have been reporting on commentary from analysts and public health experts speculating that India's total COVID deaths might be 2x the official number. Some journalists have even found evidence of deaths that weren't included in the official tally.On Monday, a story published by  cited modeling from the University of Washington's IHME institute, the not-very-accurate purveyor of COVID-19 forecasting, which suggests that India's COVID-19 death toll might be as high as 1.1MM. This would mean that the wave of infections that spread across India in April and May (largely driven by the Delta variant) may have been the deadliest outbreak yet.Lacking accurate data on deaths is a problem for scientists trying to determine exactly how much deadlier the \"Delta\" variant is when compared with earlier strains of the virus. An accurate count is \"a very important part of understanding how big a threat new variants are,\" said Christopher Murray, director of the University of Washington’s Institute for Health Metrics and Evaluation.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 02:45 AM", "title": "Blinken Urges Allies To \"Repatriate\" & \"Rehabilitate\" Foreign ISIS Terrorists Held In Syria", "text": "US Secretary of State Antony Blinken on Monday actually called for ISIS members held in prisons across Syria - often in Europe. He applied the words \"repatriate\" and \"rehabilitate\" to literal ISIS terrorists and their families.What's more is that he was addressing European allies, meaning in this context he's also referencing primarilywho joined the Islamic State. The foreign jihadists have long been considered to be the most extreme among the extreme. Here's what Blinken said at a defense conference in Rome, ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 03:30 AM", "title": "Europe: Non-Competitive Power Prices Derail Growth", "text": "Despite an endless chain of monetary and fiscal stimuli, theconsistently disappoints in. One of the reasons is demographics. No monetary and public spending stimulus can offset the impact on consumption and economic growth of an ageing population, as Japan can also confirm.However, there is an especially important factor that tends to be overlooked. The lack of", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 04:15 AM", "title": "England Versus Germany: A Footballing History", "text": "The long and storied history of England vs. Germany on the football pitch, which is due to continue today at 12ET in the Euros 2020 Round of 16 match, is  (although the pain has been more of an English experience in recent times). although England can boast the most wins and goals in total, when it comes to the big tournaments, it's the Germans that have the clear edge. Despite the famous World Cup final win of 1966, Germany has bossed the 3 Lions when it really counts, winning three World Cup games and drawing one in addition to that famous loss. You will find more infographics at ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 04:44 AM", "title": "Basel III Regulations Finally Kick In: What This Means For Gold", "text": "On Monday, the long-anticipated (by gold bulls) banking rules implemented under a sweeping international accord known as came into effect (for European banks) and - as discussed previously both and elsewhere - mark a major change for European banks and their dealings with gold, \"potentially altering the landscape for precious metal demand and prices\" as .", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 05:00 AM", "title": "HMS Defender Versus The Russian Military: The Danger Of Believing Your Own Propaganda", "text": "Less than two weeks after NATO members reaffirmed allegiance to Article 5 – that an attack on one member was an attack on all members – the UK nearly put that pledge to the test. In a shockingly provocative move, the UK’s HMS Defender purposely sailed into Crimean territorial waters on its way to Georgia.Press reports suggest that there was a dispute between the UK defense and foreign ministries over whether to violate Russia’s claimed territorial waters with a heavily armed warship. According to reports, Prime Minister Boris Johnson himself jumped in to over-rule the more cautious Foreign Office in favor of confrontation. It was an in-your-face move toward Russia just weeks after the US and NATO were forced to back down from a major clash with Russia in eastern Ukraine.This time, as was the case in eastern Ukraine, the Russians took a different view of the situation. Russian coast guard vessels ordered the HMS Defender to exit Russian territorial waters – an order they punctuated with rare live fire of cannon and dropping of bombs.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 05:45 AM", "title": "Family, Lawyers Insist They Haven't Seen Or Heard From Brothers Linked To $4 Billion In Missing Crypto", "text": "Ameer and Raees Cajee, a pair of South African brothers who built one of Africa's largest cryptocurrency exchanges  still can't be located, yet a lawyer who claims to represent them says they \"categorically deny\" stealing the coins, even though nobody - not even their family members - appears to know where they are.A \"to let\" sign can be seen in the storefront office in Johannesburg’s upmarket Rosebank business hub where Africrypt's offices were once situated.The lawyer who claims to be representing the brothers told ", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 06:44 AM", "title": "NSA Whistleblower Reveals To Tucker Carlson That Biden Admin Spying On His Communications", "text": "Tucker Carlson says an NSA whistleblower has stepped forward and provided evidence that the National Security Agency (NSA) has been spying on him.\"Yesterday we heard from a whistleblower within the US government, who reached out to warn us that the NSA (National Security Agency) has been monitoring our electronic communications and is planning to leak them in an attempt to take this show off the air,\" said Carlson.\"The Biden administration is spying on is. We have confirmed that. This morning we filed a FOIA request asking for all information that the NSA and other agencies have gathered about this show.\"", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 06:30 AM", "title": "John Taylor: Is The Fed Getting Burned Again?", "text": "Inflation was picking up, and Burns wanted the White House to understand that the price surge was not due to monetary policy or to any action that the Fed had taken under his leadership. The issue, rather, was that “the structure of the economy [had] changed profoundly.” Accordingly, Burns was writing to recommend “a strong wage and price policy”:“I have already outlined to you a possible path for such a policy – emphatic and pointed jawboning, followed by a wage and price review board (preferably through the instrumentality of the Cabinet Committee on Economic Policy); and in the event of insufficient success (which is now more probable than it would have been a year or two ago), followed – perhaps no later than next January – by a six-month wage and price freeze.”For a time after the freeze was implemented, the controls and guidelines seemed to be working. They were even politically popular for a brief period. Inflation inched down, and the freeze was followed by more compulsory controls requiring firms to get permission from a commission to change wages and prices.Moreover, it soon became obvious that the government controls and interventions were making matters worse.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 07:07 AM", "title": "South African Court Sentences Former President Zuma To 15 Months For Snubbing Corruption Probe", "text": "Five decades have passed since former South African President Jacob Zuma was last imprisoned - he served a 10-year-term at the notorious jail at Robben Island alongside the ANC's revolutionary leader Nelson Mandela - but pretty soon, he'll find himself inside a jail cell once again Zuma must now turn himself in within five days. Should he refuse, South African police will be ordered to \"take all steps necessary\" within three days to ensure that he's imprisoned - otherwise the former president will essentially be openly flouting the country's courts, dealing a major blow to the government's credibility.Acting Chief Justice Sisi Khampepe issued a forceful ruling, ordering a prison term because it would be \"the only appropriate sanction\" after Zuma repeatedly refused to appear when summoned for hearings at South Africa's Constitutional Court. The court was responsible for overseeing an investigation into corruption headed by Raymond Zondo, South Africa's deputy chief justice, according to the  with the hope that doing so sends an unequivocal message... the rule of law and the administration of justice prevails.\"", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 08:33 AM", "title": "Fed Governor Compares Digital Currencies To Parachute Pants And Bitcoin To Gold", "text": "The Fed's Vice Chair for Supervision comments on Central Bank Digital currencies. Let's tune into the debate.Speaking for himself and not the Fed, the Vice Chair for Supervision, Randal K. Quarles, comments on.I have been reflecting recently, and in connection with this speech, on America's centuries-long enthusiasm for novelty.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 07:52 AM", "title": "Futures Rise To Record Despite Rising Delta Strain Jitters", "text": "Global stocks were mixed and US futures edged to new all time highs as concerns over the Delta strain of Covid-19 spurred caution among investors. At 7:00 a.m. ET, Dow e-minis were up 46 points, or 0.13%, S&P 500 e-minis were down 1 points, or 0.02% after topping a new all time high of 4,283 earlier, and Nasdaq 100 e-minis were down 13 points, or 0.09%. The dollar strengthened and treasuries were steady while oilslipped and gold headed for the biggest monthly drop in more than four years.While sentiment remains buoyant, investors are growing concerned by the latest evolution of the Delta variant, which is increasingly seen as a growing threat to the ongoing economic recovery in many areas, said Pierre Veyret, a technical analyst at ActivTrades. Even if the economic impact is “unlikely to be significant” in developed countries, “the inconsistency in vaccination campaigns in other parts of the world is likely to lead to an uneven recovery,” he said.Others echoed this sentiment: JPMorgan Chase & Co. strategists led byMarko Kolanovicsaid. “The economic consequences are likely to be limited given progress on vaccinations across developed market economies. It could, however, pose some risk of a delay in the recovery in countries where vaccination rates remain lower.”", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 08:50 AM", "title": "​​​​​​​Triple-Digit Heat Dome Bakes Pacific Northwest, Triggers First Blackout", "text": "The Pacific Northwest is experiencing a multi-day heat wave that we said last week would be \".\" The unrelenting triple-digit temperatures shattered records across the region and have stressed out power grids where rolling blackouts have been reported.reports Avista Corporation, which supplies electricity to 340,000 residential, commercial, and industrial customers, triggered itsfirst rolling blackout across its grid after it becameoverloaded Monday evening.Rotating outages first hit 9,300 customers late Monday and could expand as temperatures remain well above average through July 4.Avista was the first major utility to report rolling blackouts in the Northwest region, and with positive temperature anomalies to linger through the week, it may not be the last.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 05:30 PM", "title": "Over 500 Election Fraud Cases Are Pending In Texas Courts: Attorney General", "text": "said over the weekend that his office still has more than 500cases that need to be heard in court.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 05:00 PM", "title": "Rubin Joins Fellow Clintonite Summers With Warning About \"Elevated Risk\" Of Persistent Inflation", "text": "Earlier this year, former Clinton Treasury Secretary and erstwhile Harvard President Larry Summers was pilloried by his fellow Democrats for daring to suggest that the firehose of COVID-inspired fiscal and monetary stimulus would likely cause runaway inflation. Then, (who continues to insist that price pressures will ultimately be \"transitory\" despite the FOMC's decision to move up its expectations for the timing of rate hikes to account for hotter-then-expected inflationary prints) has let on.Now, it looks like another Clinton-era economic nabob, (who, let's not forget, was once a member of Clinton's \"committee to save the world\" alongside Summers and former Fed chief Alan Greenspan)", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 04:36 PM", "title": "Greenwald: Biden's Lawless Bombing Of Iraq and Syria Only Serves The Weapons Industry Funding Both Parties", "text": " in the five months since he was inaugurated, President Joe Biden on Sunday  on Syria, and for the first time, he also bombed Iraq. The  was the same as Biden's first : the U.S., in the ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 05:14 PM", "title": "Major Banks Raise Dividend, Boost Buybacks As Expected After Stress Test Results", "text": "After  to resume dividend and buyback increases, guess what all the major banks just did...Naturally, the CEOs who are also substantial shareholders, were delighted by the outcome:While we await the final number of bubacks to be tallied, we remind readers that expectations were that the six biggest banks would boost buybacks to repurchase up to $142 billion in shares.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 06:10 PM", "title": "Scientists Obfuscated Source Of COVID-19-Like Virus Stored At Wuhan Lab", "text": "Shi Zheng-li, the director of the Wuhan Institute of Virology, is the common thread through which many key research projects and gain-of-function experiments on coronaviruses are connected.In 2002, an  of a novel coronavirus named SARS resulted in the deaths of 774 people worldwide.  quickly established that the virus spread from bats to civets and then on to people.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 06:30 PM", "title": "Cathie Wood's Ark Files Paperwork To Launch Bitcoin ETF", "text": "The gene-editing breakthrough announced Monday by  and its partner Regeneron sparked another rally for biotech stocks, but it also cemented a comeback for Cathie Wood, founder of Ark Investment Management, which saw the AUM of its family of actively-managed ETFs explode over the past year thanks to her bets on crypto, Tesla, Shopify, Zoom, Palantir, Roblox.Ark is the largest, or second-largest, shareholder of the handful of Crispr gene-editing technology companies that saw their shares rally hard on the news - including Crispr Therapeutics, Intellia, Editas Medicine and Beam Therapeutics - and the news sent shares of the Ark Genomic Revolution ETF up 3.3% on Monday while Ark's flagship Ark Innovation fund rallied 3.8%.The rally cemented a comeback of sorts for Wood. After a rough few months, Ark's flagship fund has now rallied more than 25% off its May low.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 06:44 PM", "title": "The Experiment Is Over: Labor Market Normalizing In Republican States, Remains Broken In Blue States", "text": "Exactly one month ago, that with 23 - - states announcing at least some form of early reduction in pandemic-related unemployment insurance benefits ahead of the September expiration at the federal level...... in hopes of unclogging labor supply and easing the unprecedented labor shortage gripping America which has manifested in record numbers of job openings which nobody wants due to Uncle Sam's generous weekly benefits...", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 06:50 PM", "title": "Watch: LA Spa Staff Dismiss Woman's Complaint About Man Exposing His Penis In Female Area", "text": "Yes, really.A video clip shows the woman approaching reception staff and telling them, “I just wanna be clear with you – it’s OK for a man to go into the women’s section, show his penis around other women, young little girls underage – your spa Wi Spa condones that – is that what you’re saying?”The staffer says the man is allowed to be there because of his “sexual orientation.”responds the woman.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 07:10 PM", "title": "Hong Kong Bars UK Travelers Over \"Extremely High\" COVID Risks As Crackdown On \"Foreign Influence\" Continues", "text": "After Hong Kong police arrested more journalists from the now-defunct Apple Daily over the weekend, a sign that Beijing's crackdown on democratic freedoms under the guise of the new \"national security\" law isn't letting up, health authorities on Monday announced that they would bar travelers from the UK after reintroducing the UK to HK's list of \"extremely high-risk\" countries.Two sources confirmed the decision to , the biggest English-language newspaper in HK (it's also owned by Jack Ma, who is now officially under the CCP jackboot). The move comes just days after the city tightened quarantine rules for foreign visitors, and also after reports in the western press claimed Beijing plans to keep its borders closed to almost all foreign travelers until the second half of next year (with a handful of exceptions for countries with high vaccination rates).Before ramping up the UK's designation to \"extremely high risk\", HK had already moved the UK to \"very high risk\", meaning travelers would need to quarantine for 21 days upon arrival, a quarantine term that would exclude all but the most essential business travel. Hong Kong health officials claim that over the past week, the country has recorded 14,876 new COVID-19 infections and 11 related deaths on Sunday.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 07:30 PM", "title": "The Technocratic Mindset Produces Only Misery And Failure", "text": "Saw, come across my news alert for “”. In it Dr. David Eagleman talks about how not only can we augment human senses with fantastic new abilities (like to “see” heat and electromagnetic patterns), but how we’ll even be able to build machines that think too.There is a line in his thinking that one can glean from the article: on one side of the line are enhancements and augmentations to the human experience which are startling and amazing and which will transform our societies: even more radical life extension will be in the cards quite soon (for those who can afford it).", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 07:50 PM", "title": "\"It's So Out Of Control\": Airlines Mull Ending Alcohol Service As In-Flight Incidents Skyrocket", "text": "Now that Covid lockdowns are ending, Americans can get back to what they do best: getting into fist fights on airplanes.Yes, despite the fact that travel restrictions are ending and citizens can get back to vacationing over the summer, things continue to get ornery in the \"friendly skies\".The incidents have become so common, there has been a discussion about endingfavorite travel companion: alcohol on flights.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 08:10 PM", "title": "Is China's Bitcoin Mining Ban A Benefit In Disguise?", "text": "Beijing’s broadening ban on cryptocurrency mining has - for now - crippled the industry and sentprices collapsing. In late May, China’s State Council issued treatises to crack down on bitcoin trading and mining. The notices came after China’s central bank began implementing its own digital currency.The Chinese Communist Party (CCP) deems cryptocurrencies such as bitcoin a nuisance, disrupting economic order and facilitating illegal transfers of wealth. In addition, Beijing has decried the massive power consumption of bitcoin miners.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 08:30 PM", "title": "Israel Sees Explosion Of Cases In Vaccinated Patients Caused By \"Delta\" Variant", "text": "More evidence is emerging to suggest that the Delta COVID variant poses a very real threat, even to patients who have already been fully vaccinated.As a reminder, the WHO's new naming scheme has the most pervasive variants named after greek letters. Right now, the Delta variant is causing the most trouble worldwide.It prompted UK PM Boris Johnson to delaying the end of the UK's COVID-19 restrictions, which have been rolled back with agonizing slowness, as many Britons have complained. It is also now causing a wave of lockdowns and travel restrictions around the world as countries with lower vaccination rates have come to see it as a serious threat. Meanwhile, , more cases of Delta have been detected across the country, forcing Israel's public health authorities to consider more drastic measures.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 08:50 PM", "title": "5 Signs That Show That The Depravity In America Has Reached An Entirely New Level", "text": " From the very lowest levels of society all the way to the very highest levels of society, the level of depravity that we are now witnessing all around us is absolutely stunning. At this point, most Americans do not have any sort of a solid moral foundation, and it shows. Everyone is just basically doing whatever seems right in their own eyes, and that has resulted in complete and utter chaos. We are a very, very sick nation, and we are getting even sicker with each passing day.Let me give you five examples of what I am talking about…The founder of an organization dedicated to ending child sex abuse has been sentenced to 13 years in prison on child rape and child pornography charges.Joel Davis, 25, was convicted of ‘enticing a child to engage in illegal sexual activity,’ possession and distribution of child pornography, US Attorney for the Southern District of New York Audrey Strauss announced on Tuesday.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 09:10 PM", "title": "State Media Admits Kim Jong Un Looks \"Emaciated\", Says Population Is \"Heartbroken\"", "text": "\"Everyone in North Korea is , said an unidentified resident of Pyongyang , after watching recent video footage of Kim.\" That's according to  after regional media has for a couple of weeks been consumed with speculation based on examinations of recent before and after photos.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 09:50 PM", "title": "India Sends 50,000 More Troops To Disputed Chinese Border In Major Escalation", "text": "After a past year of continued simmering Himalayan border tensions, particularly after the deadly June 2020 incident wherein Chinese and Indian border troops were in a fierce clash, India has escalated its stance by .While the nuclear armed nation already has an estimated 200,000 stationed there,  is reporting the alarming ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 09:30 PM", "title": "Jason Whitlock: Dear Black America, We Are Being Lied To...", "text": "They have pitted us against the Proud Boys, the KKK, rural militia groups, and Trump supporters in a made-for-TV race war. Just five years after Barack Obama completed two terms as president of the United States, we're supposed to believe America has been overrun by violent white supremacists determined to reinstate segregation, Jim Crow laws, and maybe even slavery.1) Republicans want all voters to show a government-issued ID;2) On January 6, unarmed Trump supporters crashed the Capitol and took pictures inside Nancy Pelosi's office;3) Across the nation, police kill on average 250 black men and 450 white men per year.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 03:17 PM", "title": "Why The Fed Is Dead Wrong On Inflation: Americans Have $3.5 Trillion In Savings For A Sunny Day", "text": "Even though the US personal savings rate has dropped substantially in recent months from its post-covid record high of 34%...... when the US government unleashed the fiscal and monetary bazooka, it is certainly the case that there has been a very large surge in savings in the past 15 months, and as Bank of America economists write today, one of the biggest unknowns in the next few years is what happens to all the liquid savings that households have accumulated. The bank offers a new perspective on this question:But first things first: how much excess savings is there?Bank of America answers this basic question by noting that there are three ways to measure the surge. The first is to identify specific government outlays that were likely mainly saved such as stimulus checks to healthy households. This approach comes up with some small numbers - less than a trillion dollars in windfall savings. This is the wrong approach, as one needs to look not only at direct deposits, but the indirect impact of stimulus dollars flooding the economy and at the fact that spending on services was constrained.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 09:06 AM", "title": "US Home Prices Just Accelerated At Their Fastest Pace On Record", "text": "According to the Case-Shiller indices, home prices in America's 20 largest cities have exploded at 14.88% YoY in April - the highest since Nov 2005... among 20 cities surveyed...All cities are seeing home prices appreciate at double digits (a little higher than The Fed's 2% \"goal\"). said Craig J. Lazzara, global head of index investment strategy at S&P Dow JonesIndices.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 10:10 PM", "title": "542% Increase In Convicted Sex Offenders Arrested At Border", "text": "Border Patrol agents have arrested 353 illegal aliens with sex-related criminal convictions so far this fiscal year. A large number of the detainees had prior convictions for crimes involving a minor.In the same period in fiscal 2020, agents apprehended 55 criminal sex offenders, and 58 total in all of fiscal 2019.Convicted criminals are the most likely population of illegal aliens trying to avoid capture by Border Patrol.Border Patrol has detected more than 250,000 illegal aliens who have evaded capture so far this year, according to the newly-appointed Acting Border Patrol Chief Raul Ortiz on June 24. It’s impossible to estimate how many have evaded Border Patrol without detection.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 03:50 PM", "title": "NHTSA Orders Automakers To Report Crashes Involving Autonomous And Driver-Assist Features", "text": "Automotive regulators look like they may finally be posturing up and playingof hard ball with autonomous driving and/or driver-assistedincidents.Frequent readers of Zero Hedge know that we have been critical of the job done (ordone, for that matter) by theNational Highway Traffic Safety Administration, who appears to be taking a \"see no evil, hear no evil\" approach to regulating what has been an incessant, years-long slew of automated driving accidents, including several fatal ones.", "is_fake": 1},
{"date": "Tuesday, Jun 29, 2021 - 03:37 PM", "title": "Walmart Rolls Out Budget Insulin As Low-Income Diabetics Struggle To Afford Drug", "text": "Walmart on Tuesday announced that it will begin selling a far less expensive, private-label version of insulin which could help low-income diabetics afford their medication.Starting this week, the retailer will begin selling their exclusive insulin, ReliOn NovoLog, according to , with availability at its membership-based Sam's Club in mid-July. The cost will be . Branded competitors are selling the same formulation for as much as $101 per vial / $251 per pack of insulin pens.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 10:21 AM", "title": "Iran-Backed Militias Vow Swift \"Revenge\" Against US After Syria-Iraq Airstrikes", "text": "Sunday's night's series of US airstrikes on Syria and Iraq were the , which were described as targetingIran-backed militia's which had been targeting American troop positions with drone and rocket attacks.The  overnight cited Iraqi militia officials to say that ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 11:00 AM", "title": "Transgender Boy Wins Bathroom Case After Supreme Court Refuses To Hear Appeal", "text": "A former high school student's victory against a Virginia school board was solidified on Monday .The decision came in an unsigned order, though conservative justices Clarence Thomas and Samuel Alito indicated they would have taken up the appeal.The 4th Circuit found that the Gloucester County school board's policy requiring plaintiff Gavin Grimm to use restrooms that correspond with biological sex - female in this case - ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 10:47 AM", "title": "ESG Investing – The Great Wall Street Money Heist", "text": "ESG refers to the Environmental, Social, and Governance risk theoretically embedded in a business. However, while ESG investing is about taking these risks into account in investment decisions,. Such is the inherent problem.However, as is also the case, with the recent surge in liberal policies, woke activism, and demand for social justice, Wall Street is more than willing to sell products to fill a need.Following the financial crisis, ESG funds had roughly a ZERO market share of total assets under management. Today, ESG-labelled funds in the United States exceed $16 trillion.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 11:10 AM", "title": "London Fire Brigade Says \"Fire Now Under Control\" At South London Railway Arch", "text": " Two hours or so after the arches underneath the railway station atElephant and Castle insouth London caught fire, thetweeted the fire \"is now under control.\"The fire in  is now under control. Firefighters will remain at the scene for the next few hours to dampen down the scene. Road closures are still in place in the area. ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 11:23 AM", "title": "Make-A-Wish Foundation Says It Won't Help Terminally-Ill Kids Unless Their Entire Family Is Vaccinated", "text": "Yes, really.Make-a-Wish president and CEO Richard Davis made the announcement in a video released last week, stating, “All wish participants, including your wish kid and any siblings, will need to be two weeks past completion of either a one-dose or a two-dose vaccine.” remarked the Twitter user who posted the video.A two-tier form of discrimination which treats the unvaccinated as second class citizens is already underway in the form of vaccine passports, but to deny critically ill children support because they haven’t taken the jab is particularly cruel.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 12:41 PM", "title": "Capitalism Does Not Equal Corporatism, Part 1", "text": "Yet, whenever you mention capitalism, there is palpable anger arising from a fundamental widespread misbelief.I have two words for you –Such does not mean capitalism has becomeOn the contrary,", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 01:00 PM", "title": "\"Just Another Summer Weekend Of Mayhem\": 77 Shot In Chicago As Understaffed PD Braces For July 4th", "text": "Even after for months running Chicago has typically seen many consecutive weekends with some 40 shootings every Saturday and Sunday, this weekend's numbers have reached truly staggering new heights, with at least .Local Chicago news has noted further that seven of the surviving victims are minors of 17-years old or younger. From Saturday night, news of shootings came in so rapidly that police and reporters struggled to keep a tally, with Chicago PD citing 55 wounded across the city by Sunday evening.But after", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 12:00 PM", "title": "Turley: Why Giuliani's Suspension Should Worry All Lawyers", "text": "Below is my column in The Hill on the suspension of Rudy Giuliani by the New York Bar. Here is the column:This week, New York’s Supreme Court took the  former federal prosecutor and counsel to former", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 01:20 PM", "title": "Trump Responds To Former AG William Barr's Claims About 2020 Election", "text": "Former President  responded to remarks from former Attorney General William Barr that criticized the former commander-in-chief over his claims following the 2020 general election.Barr made the remarks in an upcoming book from ABC News reporter Jonathan Karl, who claimed the relationship between Trump and Barr deteriorated last year.Trump said in a statement late on Sunday.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 02:11 PM", "title": "Developer Of Collapsed Miami Condo Once Allegedly Paid Off Officials", "text": "Champlain Towers developer Nathan Reiber, who died in 2014, was once accused of paying off local officials to sidestep a construction moratorium in Surfside in 1979 because of problems with the sewer system, according to.Reiber had \"contributed\" to the campaigns of local officials that granted him preferential treatment when it came to building Champlain Towers South in 1981.WaPo noted all the principals involved in the design and construction of the building are deceased. Former construction companies that played a role in the construction of Champlain Towers were unwilling to talk about the building collapse.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 02:00 PM", "title": "Oakland 'Defunds' $17 Million From Police Budget", "text": "The Oakland City Council approved a budget on June 24 that will redirect $17.4 million from itsdepartment to other programs over the course of two years.The city council voted 7–2 to adopt the plan that would cut $17 million from the police department and direct the funds instead to a violence prevention program, according to. The council’s", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 02:20 PM", "title": "Sydney Enters 2-Week Lockdown As Closed Border Fails To Keep \"Delta\" Out Of Australia", "text": "Australia's brief lockdown of  and the surrounding Victoria state ended three weeks ago, but now a new outbreak has emerged in Sydney, inspiring the Australian government to impose a new lockdown covering the remote island country's most populous city.In other news, restrictions in Australia's Northern Territory will be extended by 3 days - through the middle of this week - after another new case of was discovered in Darwin, the capital city of the territory. The lockdown restrictions also apply to Palmerston and Litchfield.As with other outbreaks, Australian authorities have confirmed that the Delta variant is responsible for most of the new cases, which are rapidly nearing 100, while cases of the Delta variant in the country have now reached triple digits. According to the latest report from the government of New South Wales, the state where Sydney is situated, there are at least 130 \"active local cases\" in the Australian state, as of 2000 local time Sunday, June 27.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 02:45 PM", "title": "Daily Briefing: Darius Dale: End of Market Goldilocks? Oil, the Dollar, and Bitcoin", "text": "Real Vision managing editor Samuel Burke welcomes Jack Farley and Darius Dale, founder and CEO of 42 Macro, to the Daily Briefing to discuss Dale’s macro outlook and weigh the possibility of deflation. The trio will cover the recent U.K. ban on Binance and its effects on crypto assets. Additionally, they will discuss the strength of the dollar and GDP projections in a potentially deflationary environment. Finally, they will examine oil stocks ahead of the OPEC meeting scheduled for Thursday.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 03:15 PM", "title": "Facebook Soars Past $1 Trillion Market Cap After District Judge Dismisses FTC's Anti-Trust Case", "text": "Facebook stock soared to a new record high after a District judge dismissed two antitrust cases filed by the federal government and a coalition of states.U.S. District JudgeJames Boasbergin Washington on Monday granted Facebook’s request to dismiss the complaints filed last year by the U.S.Federal Trade Commissionand state attorneys general led by New York’sLetitia James.According to , the FTC didn't offer enough details to show that Facebook has a monopoly for social networking services.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 02:49 PM", "title": "When Will The Supply-Chain Collapse Finally Stabilize: Here Is Goldman's Take", "text": "As we have been documenting daily (most recently in \"\"), even as some signs of price normalization emerge, most notably the recent drop in commodity prices (lumber, copper)...... widespread supply-chain disruptions remain and have become a serious challenge in many parts of the US economy, with large effects on both output and inflation.The Goldman chart below shows that businesses report the ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 03:21 PM", "title": "Tropical Storm Danny Forms Off South Carolina Coast, Landfall Imminent ", "text": " The National Hurricane Center (NHC) and preliminary Air Force reconnaissance data indicate that the tropical depression off the coast of South Carolina this morning has been upgraded to Tropical Storm Danny with maximum sustained winds of 40 mph.Strong burst of convection going off near 's center as it approaches the coastline. Potential for tropical storm force wind gusts (40+ mph) in exposed areas near the coast as it comes ashore. As of 1400 ET, the tropical storm was about 55 miles east-southeast of Charleston, moving west-northwest at 16 mph, with sustained winds of 40 mph or higher.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 01:40 PM", "title": "'Fact Checking' Virologist Who Worked At Wuhan Lab Is Suddenly Open To Lab-Leak Hypothesis", "text": "The latest effort to bolster the COVID-19 natural origin theory comes from , which published a glowing interview of Danielle Anderson - an Australian virologist who worked shoulder-to-shoulder with top scientists at the Wuhan Institute of Virology,   - repeatedly insisting that COVID-19 couldn't have possibly escaped from the lab.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 02:00 AM", "title": "Georgia & Ukraine Agree To \"Commitment\" Seeking NATO Membership", "text": "Georgian President Salome Zurabishvili paid a two-day visit to Ukraine earlier last week (her first) and met with her opposite number President Volodymyr Zelensky.Zurabishvili first came to world notice when she emerged as part of the triumvirate that took over in Georgia   that saw incumbent head of state Eduard Shevardnadze manhandled and divested of his powers. Her colleagues were Mikheil Saakashvili, who became president, and Zurab Zhvania, whose family claims he was assassinated in 2005. That event is the prototype of what have come to be called color revolutions; after Georgia the Orange Revolution in Ukraine in 2004, the Tulip Revolution in Kyrgyzstan and the Cedar Revolution in Lebanon in 2005, and a veritable host of others, successful and otherwise, in Belarus, Moldova, Armenia, the Maldives, Venezuela, Myanmar, Iran and elsewhere.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 02:45 AM", "title": "Thousands Of Asteroids Whizz Past Earth", "text": "NASA's Center for Near Earth Object Studies keeps an eye on the sky, surveying more than 26,000 asteroids and a much smaller number of comets that pass near Earth.  anyone who has dabbled in paleontology - even in the science fiction realm of Jurassic Park or The Land Before Time - knows that a giant asteroid hitting Earth is not good news for life on the planet. In fact, there is evidence that this may have been one of the main causes of the Cretaceous-Paleogene extinction.But An asteroid that was only ten meters in diameter exploded 25 km above the Bering Sea in December 2019", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 04:15 AM", "title": "Tour de France To Sue Fan Who Caused Horrific Crash During Selfie", "text": "An oblivious and careless fan set off a horrific mass crash just as the famed annual multi-stageTour de France was getting underway on Saturday. The fan was seen essentially posing for a selfie -trying to get on TV - in front of the pack of riders as they were coming up fast and tightly grouped.While holding a handwritten sign that said \"Allez Opi+Omi\" (a hello message to herGrandpa and Grandma, apparently) the spectator stayed in front of the peloton up to the very moment a rider with no way to avoid the obstruction.FRANCE - Moron trying to get a selfie causes Tour de France fiasco. ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 03:30 AM", "title": "Green Party Implodes In Germany", "text": "At the end of April and beginning of May, support for the Green Party surged, briefly putting them in first place.Talk of a Green government ensued. Take a look at the turn of events.Germany, Kantar poll:\nCDU/CSU-EPP: 28% (+1)", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 04:44 AM", "title": "Yet More Olympics \"Activism\": Medalist Turns Back To Flag During Anthem At Trials", "text": "It appears more US athletes are preparing to \"protest\" the American flag, after  transgenderBMX Freestyle rider Chelsea Wolfe made headlines for expressing a desire to \"burn a US flag\" on the Olympic podium.There's been yet another attention-grabbing display, this time at the ongoingUSOlympic track and field trials in Eugene, Oregon. Hammer throw medalistGwen Berry was on the podium when the national anthem came on over stadium loudspeakers - as it had every night throughout the trials. \"While the music played, Berry placed her left hand on her hip and shuffled her feet. She took a quarter turn, so she was facing the stands, not the flag,\" ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 05:00 AM", "title": "Two UK Commercial Real Estate Funds Shut Permanently, Investors Trapped, As Sector-Wide Exodus Intensifies", "text": ", after struggling to raise sufficient cash to meet redemption requests, iton Wednesday. The Aegon Property Income fund had £380 million ($531 million) in assets under management and the feeder fund £150 million, according to Morningstar.and two feeder funds due to the prevailing economic uncertainty and liquidity concerns.Both the Aegon and Aviva funds were suspended in March 2020,", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 05:45 AM", "title": "\"Fiat Is A Fraud\" - Mexico's 3rd Richest Man Says \"Absolutely Right\" To Buy Bitcoin \"The New Gold\"", "text": "“ Look, I started my career in 1981, the Mexican Peso was 20 to $1. Today we are at 20,000 to 1.And that is in Mexico, but .”", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 06:11 AM", "title": "FDA Adds Warning About Heart Inflammation To COVID-19 mRNA Vaccines ", "text": "The U.S. Food and Drug Administration () The FDA announced earlier this month that it would add the warning after the Centers for Disease Control and Prevention (CDC) had reported that more cases of heart inflammation—either myocarditis or pericarditis—were found in young adults and children after they received the vaccines, which use mRNA technology.On June 25, ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 06:30 AM", "title": "Classified UK Defence Documents \"Found By Member Of Public At Bus Stop\"", "text": "Sensitive defence documents containing details about HMS Defender and the military have been found by a member of the public at a bus stop, according to reports.The Ministry of Defence (MoD) said the employee concerned with the loss of documents reported it last week, and the department has launched an investigation.A member of the public, who wanted to remain anonymous, contacted the BBC when they  early on Tuesday morning.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 07:55 AM", "title": "Top Chinese Nuclear Expert Jumps To His Death", "text": "On June 14, China's Taishan Nuclear Power Plant near Hong Kong experienced damaged fuel rods that triggered a build-up of radioactive gases. French company Framatome, a part-owner of the plant,the US Department of Energy for assistance as an \"imminent radiological threat\" seemed inevitable.Radioactive gasses were released, and US officials at the time said the situation at the nuclear plant did not \"pose a severe safety threat to workers at the plant or Chinese public.\" But three days later, Zhang Zhijian, one of China's top nuclear scientists and the Vice-President of Harbin Engineering University, allegedly committed suicide after jumping off a build.At 9:34 on June 17, Professor Zhang Zhijian, member of the Standing Committee of the Party Committee and Vice President of Harbin Engineering University, fell from the main building of the University of Engineering and died. ", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 08:03 AM", "title": "Futures Stall At All Time High As Focus Turns To Jobs Data", "text": "S&P500 futures paused at fresh all time highs in a subdued session as traders eyed central bank support and awaited the June jobs report due Friday. European stocks dipped as new travel restrictions prompted by the Covid-19 Delta strain spurred a re-think of the reflation trade. The dollar and oil posted modest gains.Contracts on the Nasdaq 100 led gains while the S&P 500 fluctuated following the best week for the underlying gauge since February following an agreement on President Joe Biden’s $1.2 trillion infrastructure spending deal (which however may prove to be a total dud) and waning concerns about a sooner-than-expected policy tightening from the Federal Reserve. At 730 a.m. ET, Dow e-minis were down 17 points, or 0.05% S&P 500 e-minis were up 3 points, or 0.08% and Nasdaq futs were up 42.50 ot 0.29% as FAAMG megacaps edged higher in premarket trading despite higher bond yields.Cryptocurrency-exposed stocks climbed in US premarket trading with Bitcoin and other digital currencies spiking overnight, pushing bitcoin to $35,000 and Ethereum back over $2,000. Boeing fell 1.4% after the FAA told the planemaker that its planned 777X is not yet ready for a significant certification step and warned it “realistically” will not certify the airplane until mid- to late-2023. Virgin Galactic extended gains amid continued Reddit chatter, and Intellia Therapeutics surged after reporting positive results on Saturday from a clinical trial. Here are some other notable U.S. movers today:Both the S&P 500 and the Nasdaq hit record levels last week. But the tech-heavy Nasdaq’s 4.4% gain is outpacing its peers in June as investors pile back into tech-oriented growth stocks on waning worries about runaway inflation. Still, tensions remain as Bloomberg notes, with highly-contagious strains of the virus threatening to derail the return to normal, while markets remain sensitive to more central banks debating the withdrawal of emergency stimulus.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 08:14 AM", "title": "Record-Breaking Extreme Heat Forced Suspension Of Sunday's Olympic Track & Field Trials", "text": " a high jump competitor at the US Olympic track and field trials in Eugene, Oregon told the  over ablistering weekend of record Pacific Northwest temperatures.At about 3pm on Sunday event officials declared the trials postponed for the day as temperatures , causing at one point an athlete to be removed from the stadium in a wheelchair.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 07:04 AM", "title": "UBS Allows 2/3rds Of Workforce To Adopt Permanent \"Hybrid Work\" Schedule ", "text": "Bucking the trend among the world's megabanks, UBS has decided to permanently allow as many as 2/3rds of its workforce to transition to a \"hybrid\" work model allowing them to spend time working from both home and the office.That's in stark contrast to , which have all announced plans to recall bankers back to the office on a full-time basis, with no allowance for any kind of a hybrid model. While Morgan is allowing its bankers a little longer to transition back to the office, Morgan Stanley CEO James Gorman recently quipped that bankers who don't want to report back should be ready to brook a pay cut because \"if you want that NYC salary, you need to be in NYC offices.\"Morgan Stanley is also ordering all employees in the New York office to be vaccinated before returning to the office; even clients will need to be vaccinated (and provide proof thereof) before being allowed in Morgan's offices.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 08:30 AM", "title": "Peter Schiff: Political Hypocrisy Provides Cover For Fed On Inflation", "text": "From 2016 to 2020, Republicans were constantly trying to play up the economy. You’ll recall Donald Trump claiming it was the greatest economy in history. Meanwhile, Democrats were trying to play it down. Now, the roles have reversed. Since the Democrats own the economy now, they’re talking about how great the recovery is while Republicans are sounding warnings. As Peter Schiff explained in his podcast, this political hypocrisy is letting the real culprit get away without blame.We saw this political hypocrisy on display during Jerome Powell’s recent testimony before the House Select Committee on COVID-19. The Democrats on the committee took the opportunity to grandstand about how great the economy is doing. As Peter put it, “They own the economy and they want to pretend that everything is great.” Their questions and statements focused on what a good job Powell is doing.It’s  and so we’ve got nothing to worry about.”", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 08:51 AM", "title": "Crypto Shrugs Off Regulatory/China Crackdown, Surges Off Weekend-Dip Lows", "text": "Disappointing the endless stream of FUD-promoters, crypto markets have rebounded strongly over the weekend despite more  (good for 'clean' bitcoin) and the ; perhaps supported by positive comments from:", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 09:10 AM", "title": "Daily Beast Journalist Says Normal Life Feels Like A \"Horror Movie\"", "text": "Yes, really.“I feel America has forgotten we’re still in the middle of a pandemic that has killed more than 600,000 people, and there’s a deadly Delta Plus strain, and our kids are still not vaccinated. Sigh,” tweeted Ali.I see packed restaurants and people inside stores and malls and their kids aren't wearing masks. I feel I'm in a horror movie.“I see packed restaurants and people inside stores and malls and their kids aren’t wearing masks. I feel I’m in a horror movie,” he added.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 09:50 AM", "title": "Rabo: Nobody In The Market Has Any Idea How To Trade Two Goliaths Going At It", "text": " - 1 Samuel 17most of us know the basics of that Biblical story well, which is why it always rings true to us, psychologically. We have some of that dynamic playing out in places today. Yet just as importantly, we also have a series of Goliath vs. Goliath battles going on.on Friday, but one could interpret it more benignly if one strips out base effects, etc., etc., – which some takes did. However, ongoing supply-led inflation is nowhere near ending, with shipping container prices still rising sharply. Somebody is going to be paying for that for many months to come. Of course, markets will keep gargling the “transitory” bong water right up until the Goliath at the Fed panics, but it does not mean that inflation scaled for Gath isn’t being seen. Lumber may be going down like a giant with a stone embedded in its forehead, but many other things are not. over his public pledge to only sign an infrastructure bill if it came to his desk along with the American Families Plan: now he says he will sign the infrastructure bill alone, after Republican support for the suddenly-2-for-1 package crumbled. There were other U-turns over the weekend too: on the Golan Heights; and as the US military attacked Iran-backed militias in Iraq, even as negotiations over the Iran nuclear deal continue. And in the background, Trump political rallies are back even without Facebook and Twitter: the first in Ohio got 2 -3 million online viewers, apparently. What does that portend?", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 10:08 AM", "title": "Key Events This Week: Here Come Payrolls", "text": "The first half of this week will be quiet before the tempo picks up substantially with Thursday's ISM print and Friday's Non-Farm Payrolls which consensus expects to print at 675k on Friday up from previous 559k, if well below where the number has to be for the labor market to normalize by end 2021. Then, one week from Tuesday, Q2 earnings season begins.In terms of what to expect from payrolls, Deutsche Bank economists are forecasting a +700k increase in nonfarm payrolls following May’s +559k reading, which in turn should send the unemployment rate to a post-pandemic low of 5.7%. That said, even with a +700k increase, the total number of nonfarm payrolls would still be - 6.9m beneath its level in February 2020. Ahead of payrolls, the jobs plentiful / jobs hard-to-get series within tomorrow's June consumer confidence release will be interesting as it has been been highly correlated with the unemployment rate. Wednesday's ADP employment survey (+550k consensus vs. +978k) will also be watched even if has been well above payrolls of late.The jobs data has been the one clear soft spot in US economic data points that has given Powell reason to hold the line despite a number of hawkish FOMC speeches last week and elevated inflation figures. Although one report wont severely alter the Chair's t,ming, we see a good number as further confirmation that we remain on track for policy hints to be dropped at the Jackson Hole meeting come late August.We also get the US ISM report (Thurs) and consumer confidence (Tues). Both should hold at firm levels with the former again highlighting the supply chain strains that are putting up costs and boosting the chances that inflation stays higher for (much) longer (as long as 4 years according to BofA).", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 03:29 PM", "title": "Google Tumbles As Biden Revives Trump-Era Antritrust Probe Into Display-Ad Business", "text": "Minutes after news that a judge  sent the social-media giant's market capitalization past the $1 trillion mark, Google has just been hit by some disappointing news on the anti-trust front.Google shares tumbled heading into the close on reports that the Biden Administration was planning to revive a Trump-era investigation into Google's display ad business.While a judge has granted some relief for Facebook, potentially taking it out of the sights of the FTC, which is now being led by anti-monopoly pioneer Lina Khan, it's clear the Biden Administration hasn't given up on scrutinizing American Big Tech.", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 03:45 PM", "title": "Syria's Largest US-Occupied Oil Field Comes Under Missile & Mortar Attack", "text": "A US military base at following last night's Biden-ordered airstrike on militia bases along the Syria-Iraq border. Western sources are reporting it as for theUS military action against pro-Iranian encampments along Syria's eastern border, which left multiple militia members dead.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 02:00 PM", "title": "Illinois Struggles To Pay Its Bills Despite Tax Hikes And Biden's Bailouts", "text": "Thanks to Congressional handouts passed in reconciliation with zero Republican votes, Illinois will receive $13.2 billion in federal funding it can spend over the next three fiscal years.Supposedly the money was for pandemic-related expenses, but money is fungible. Illinois can use that money for anything, including pension bailouts.In addition to the free money, Illinois passed tax hikes estimated to bring in $666 million in revenue annually.Finally, Illinois borrowed billions from the Fed to pay down its backlog on unpaid claims. The 3% rate to the Fed is a huge reduction to the 12% statutory prompt payment penalty rate that Illinois paid vendors.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 02:30 PM", "title": "Biden Team Walks Back Threat To Sink Infrastructure Deal Unless $1.8T Families Plan Also Passed", "text": "The Biden administration issued a hasty walkback of the president's threat to veto a bipartisan infrastructure deal if his nearly $2 trillion \"American Families Plan\" wasn't enacted at the same time.\"\" Biden , while touting the deal, adding \"", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 03:00 PM", "title": "\"Buckle Up\": Morgan Stanley Says Any Strong Data Could Cause Chaos", "text": "Some Fed meetings are more consequential than others. We would put last week's meeting and Chair Powell's subsequent press conference in the eminently consequential category. While the precipitous sell-off in broad risk markets in the aftermath of the meeting has reversed, the uncertainties it unleashed have not. Legitimate questions about the direction of monetary policy and the Fed’s reaction function are now front and center in the minds of market participants. After all, memories of the 2013 taper tantrum are still fresh, and its scars run deep. Considering the role of the Fed’s ultra-accommodative policy in charting the course of the markets since the onset of the COVID-19 crisis, Not surprisingly, the US Treasury market is reflecting substantial changes in policy expectations. The Treasury yield curve has flattened dramatically. Breakeven inflation rates have fallen and real yields have risen. The market-implied timing of interest rate hikes has come forward by three months, with the Treasury market now pricing the first rate hike in December 2022. At the annual Jackson Hole symposium in August 2020, the Fed announced important changes to its monetary policy framework:", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 03:30 PM", "title": "Ford Electric Mustang Breaks Quarter-Mile Record, Challenges Elon Musk To \"Race\" ", "text": "So while the Tesla fanboy cult salivates over thezipping down the quarter-mile stretch at 9.25 seconds at 152.6 mph (data via), the Mustang Cobra Jet 1400, a concept car Ford revealed last year, broke the quarter-mile world record for full-body electric cars this weekend.Bob Tasca III, sponsored by Ford, drove the full-body electric Mustang called Cobra Jet 1400, on Saturday and hit a new world record. The vehicle shot down the quarter-mile stretch with all 1,502 horsepower silently screaming, recording a mindboggling 8.12 seconds at 171.97 mph.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 04:00 PM", "title": "United States Ranks Last In Global Media Trust, New Report Finds", "text": "For years, we have beenvalues with the rise of open bias in the media. Now, a newly releasedfrom the Reuters Institute for the Study of Journalism at Oxford has found something that would have been unthinkable just a few years ago. The United States ranked dead last in media trust among 49 countries with just 29% saying that they trusted the media.The plunging level of trust reflects the loss of the premier news organizations to a type of woke journalism. We have have been discussing how", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 04:30 PM", "title": "US Case Against Assange Struck Major Blow As Key Witness Admits He Lied", "text": "The US government's case against Julian Assange may be on shaky legal ground contained in the DOJ's indictment, according to stunning admissions to  magazine.Thordarson, a documented sociopath and convicted pedophile who also engaged in a \"wide-ranging financial fraud,\" ", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 05:00 PM", "title": "Hedge Fund CIO: \"Our Growing Acceptance Of Ever Wilder Conspiracy Theories Has Numbed Us To Everything\"", "text": "“In 18 incidents, described in 21 reports, observers reported unusual Unidentified Aerial Phenomena (UAP) movement patterns or flight characteristics. Some UAP appeared to remain stationary in winds aloft, move against the wind, maneuver abruptly, or move at considerable speed, without discernible means of propulsion. In a small number of cases, military aircraft systems processed radio frequency energy associated with UAP sightings.”wrote the Office of the Director of National Intelligence. \"Narratives from aviators in the operational community and analysts from the military and Intelligence Community describe disparagement associated with observing UAP, reporting it, or attempting to discuss it with colleagues.” Nothing new there.Throughout human history, And yet, without those courageous enough to speak their truth, we would live in a perpetual Dark Ages. Such is the depth of our fear of change that we persecute the brave few, even as they drag us into a better future, kicking, screaming.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 05:30 PM", "title": "FAA Denies Boeing Permission To Move Forward In Certifying 777X Due To Serious Flight Test Incident", "text": "If it's not one Boeing jet malfunctioning, it's another.With Boeing facing an uphill climb in restoring the public's confidence in its crash-prone 737MAX, the aerospace giant is facing fresh troubles, this time involving the updated version of the long-haul 777X jet which is facing additional testing because of what U.S. regulators called a serious test-flight incident and multiple other issues with software and inadequate data.In a sternly worded letter dated May 13, which was reviewed by the FAA warned Boeing it may have to increase the number of test flights planned and that certification realistically is now more than two years out, probably in late 2023.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 06:30 PM", "title": "White House Responds To Report Saying Biden To Reverse Trump's Golan Heights Policy", "text": "On Thursday the a story with the headline: This set off a wave of rumors and follow-up reports, culminating in an official Biden administration response on Friday.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 07:00 PM", "title": "Rapinoe No Victim: US Women's Soccer Team Earned More Than Men's Team", "text": " But Megan Rapinoe isn’t letting facts stand in the way of her p.r. campaign to pressure the United States Soccer Federation (USSF) into increasing her salary.In March, the gold medalist and two-time World Cup Championto Congress and to President Joe Biden that  Later this month, she’ll ", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 07:30 PM", "title": "Iran Refuses To Grant IAEA Access To Nuclear Facilities: \"Agreement Has Expired\"", "text": "At a moment the clock is said to be winding down toward a nuclear deal in Vienna, with both sides expressing increased, Tehran is playing hardball with the InternationalAtomic Energy Agency (IAEA).Once again it's over access to the country's nuclear sites according to prior arrangements: \"The speaker of Iran's parliament said on Sunday Tehran  to the U.N. nuclear watchdog as a monitoring agreement with the agency had expired, Iranian state media reported,\" ", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 07:56 PM", "title": "Biden Orders Series Of Airstrikes Along Syria-Iraq Border", "text": "The Biden administration has confirmed the president ordered  in order to \"protect US personnel\" - as an official Department of Defense statement in the aftermath indicated.\"At President Biden's direction, U.S. military forces earlier this evening conducted defensive ,\" the late ", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 09:15 PM", "title": "Labor Shortages And Inflation Plague California Businesses", "text": "There’s an irony to the new dining area at Chef Andrew Gruel’s Huntington Beach, Calif. restaurant. Statewide labor shortages andare among the challenges restaurateurs are now facing as they crawl back to life following the-induced restrictions that hammered California’s hospitality industry.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 08:50 PM", "title": "\"What If We Are Wrong\": Goldman Reruns Market Forecasts Assuming Its Key Assumptions Are All Wrong", "text": "Halfway through 2021, the S&P 500 closed at an all time high and stands just 1% below Goldman's year-end price target of 4300.So far so good, but as the bank's chief equity strategist David Kostin concedes, his forecasts are conditional on macro assumptions: \"Inflation will diminish, interest rates will rise, and a portion of President Biden’s fiscal plan will pass into law.\" And, as Kostin writes in his Weekly Kickstart note, \"this future is not guaranteed\" and as a result, Kostin's recent client discussions have focused around the risks to the bank's baseline macro forecast.To ease client nerves, Kostin, considers three “what if” scenarios that each focus on a key macro assumption and explore the implications of alternative outcomes for US equity returns, earnings, and valuations:So starting at the top, here are Kostin's thoughts first on...", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 09:40 PM", "title": "How Has Trader Positioning Changed Since The FOMC Meeting", "text": "As discussed previously (see \"\", \"\") June's FOMC meeting was hawkish in several dimensions and yet, after a brief initial shock, the market reaction appears to have been somewhat muted. This has raised the question of how positioning has adjusted ahead and in the aftermath of the FOMC meeting. To answer this question, JPMorgan's Nick Panigirtzolgou updates some of his regular positioning indicators.Turning first to bonds, JPM's quant makes the following observations:", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 06:00 PM", "title": "Decentralized Finance (DeFi) 101", "text": " There is a major shift going on in the underlying infrastructure powering financial applications, and it’s changing the way we think about permission and control, transparency and risks.DeFi is a developing market sector within the intersection of blockchain technologies, digital assets, and financial services. According to, the value of digital assets locked into DeFi applications grew 10X from less than $1 billion in 2019, to over $10 billion in 2020, and over $80 billion at its peak thus far in 2021. Yet the DeFi applications and underlying infrastructure are still in its nascent stage of development.The goal of this report is to provide an introduction of the new emerging area of DeFi infrastructure powering DeFi apps today. While it’s easy to get caught up in the hype and speculation within the space, I’ll focus on the key components of DeFi applications, their key differentiation compared to traditional finance, potential risks, and longer term implications these DeFi apps are causing.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 10:05 PM", "title": "\"Nike Is A Brand That Is Of China And For China\" Says Company's CEO", "text": "The CEO ofsaid that the corporation is a “brand of” earlier this week, amid recent allegations of the company being implicated with human rights violations conducted by the Chinese Communist Party (CCP).John Donahoe, the new Nike CEO, while speaking to Wall Street analysts, said that", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 06:45 PM", "title": "Senate Republicans Urge CDC To End Mask Mandate On Airplanes, Public Transit", "text": "A group of Republican senators on June 25urging the Centers for Disease Control and Prevention () to end the mask mandate for fully vaccinated Americans using public transit and interstate travel.The CDC has already lifted the mask guidance for fully vaccinated people outdoors and in most other settings. But interstate rail lines, airports, and airplanes still require masks in abeyance to", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 07:15 PM", "title": "UAW President Rory Gamble Announces His Retirement, Marking Fourth UAW Boss In Three Years", "text": "UAW President Rory Gamble has announced he is going to be retiring on June 30, one year earlier than expected.The retirement comes as the union attempts to shake a sullied public image as a result of 11 former officials being convicted of Federal crimes in recent years.Gamble was instrumental in helping negotiate deals to resolve criminal investigations into the union. The resultant settlements will give the Federal government \"prolonged oversight and broad control\" over the union.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 10:30 PM", "title": "Facebook Could Be Held Liable For Sex Trafficking On Its Site, Texas Court Finds", "text": "In what is hopefully the first step in a long road of accountability for the big tech giants, the Texas Supreme Court ruled on Friday that Facebook can be held liable if sex traffickers use the platform to target children.The court said that Facebook is \"not a lawless no-man's-land\" and that it could be held accountable after 3 lawsuits that involved teenage sex trafficking victims,  reported.The victims in the lawsuits were reportedly preyed on through the social media platform, which caused prosecutors to allege that the site was negligent in not blocking sex trafficking.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 07:45 PM", "title": "Blackouts Loom In California As Electricity Prices Are \"Absolutely Exploding\"", "text": "CAISO’s warning of impending electricity shortages heralds another blackout-riddled summer at the same time California’s electricity prices are skyrocketing.making it the biggest price increase of any state in the country last year and nearly seven times the increase that was seen in the United States as a whole. According to, the all-sector price of electricity in California last year jumped to 18.15 cents per kilowatt-hour, which means that Californians are now paying about 70% more for their electricity than the U.S. average all-sector rate of 10.66 cents per kWh. Even more worrisome: California’s electricity rates are expected to soar over the next decade. (More on that in a moment.)High energy costs have a particularly regressive effect in California, which has the highest poverty rate – and some of the highest electricity prices – in the country. In 2020, California’s all-sector electricity prices were the third-highest in the continental U.S., behind only Rhode Island (18.55 cents per kWh) and Connecticut (19.19 cents per kWh.)", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 09:15 PM", "title": "US Threatens Sanctions On Gulf Allies If They Normalize Relations With Assad", "text": "For the past couple months there's been persisting reports and rumors that  under Bashar al-Assad, coming off a decade of war in which the Saudis spearheaded efforts alongside the US and other allies to topple him.As the ", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 08:45 PM", "title": "Why Gold?", "text": "At a time when many investors are calling gold “a relic,” and many younger ones, in particular, are buying Bitcoin instead, it is worth going back to fundamentals and looking at gold’s role as money over thousands of years. I am not here to attack Bitcoin. Rather, I am here to defend gold.Nearly two-and-a-half millennia ago, Aristotle wrote his famous treatise on money. Money serves as a medium of exchange, a store of value, and a unit of account. In his treatise, Aristotle listed the characteristics of ideal money.Money should be divisible, which is why we do not use fine art as money. It should be fungible, which is why we do not use real estate as money. It should be rare, which is why we do not use iron ore as money, and so on. Aristotle concluded that only gold has all these attributes and is the ideal form of money.Long before the formal gold standard, when kings, emperors, and republics issued gold coins, gold was the backing of the monetary system. Gold has preserved its purchasing power throughout history. Roy Jastram, in his thorough book,", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 08:15 PM", "title": "US Food Banks Warn Soaring Prices Will Affect Distributions ", "text": "Soaring food prices aren't just impacting financially strapped families and the working poor. They're also affecting the mission of US food banks who are spending a lot more on food than ever before.In the coming weeks and or months, food banks across the country mayfrom millions of folks who are set to have their stimmy checks expire. At least 25 states are ending federal unemployment benefits.The perfect storm of factors (", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 10:15 PM", "title": "More Police Officers Have Retired Or Quit In The Past Year Than Ever Before, New Survey Shows", "text": "Anybody who wasn't living under a rock last summer surely remembers the wave of anti-police sentiment that swept across the US. The end result, , is that thousands of cops from departments across the country have been quitting in droves. Now, a survey of nearly 200 police departments indicates that  and  in ", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 09:45 PM", "title": "Ivermectin: Can A Drug Be \"Right-Wing\"?", "text": "On December 31st of last year, an 80 year-old Buffalo-area woman named Judith Smentkiewicz fell ill with Covid-19. She was rushed by ambulance to Millard Fillmore Suburban Hospital in Williamsville, New York, where she was put on a ventilator. Her son Michael and his wife flew up from Georgia, and were given grim news. Judith, doctors said, had a 20% chance at survival, and even if she made it, she’d be on a ventilator for a month.As December passed into the New Year, Judith’s health declined. Her family members, increasingly desperate, had been doing what people in the Internet age do, Googling in search of potential treatments. They saw stories about the anti-parasitic drug ivermectin, learning among other things that a pulmonologist named Pierre Kory had just  before the Senate that the drug had a “miraculous” impact on Covid-19 patients. The family pressured doctors at the hospital to give Judith the drug. The hospital initially complied, administering one dose on January 2nd. According to her family’s court testimony, a dramatic change in her condition ensued.“In less than 48 hours, my mother was taken off the ventilator, transferred out of the Intensive Care Unit, sitting up on her own and communicating,” the patient’s daughter Michelle Kulbacki told a court.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 10:45 PM", "title": "Losing The Plot On COVID", "text": "That phrase is surely now banned by corporate media, for it reminds us how the supposedly acute health threat of March 2020 was repeatedly re-packaged to keep populations off-balance and out of business not for 15 days, but for 15 months.Outside a few rational locales, almost every nation drank the COVID Kool-Aid, competing to see who could enforce the stupidest rules.Naturally, academia would lead the way:, according to the CDC, representing about 0.16%, or about 1 in 642, of COVID deaths.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 11:45 PM", "title": "The Con Job Of The Century?", "text": "Over the course of the past century, a number of truly awe-inspiring heists have been carried out by con artists, whoseis to exploit human frailties such as credulity, insecurity and greed.is short for, for the con artist must first gain the trust of his targets, after which he persuades them to hand their money over to him. A con job differs from a moral transaction between two willing, fully informed trading partners because one of the partners is deceived, and deception constitutes a form of coercion. ", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 11:15 PM", "title": "​​​​​​​Virginia's First 3D-Printed Home Under Construction Amid \"Hyperinflating\" Housing Market", "text": "Last month, wewhich is precisely what one builder did in Virginia.According to local news", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 07:00 AM", "title": "Out Of Sight, Out Of Mind? UK Moves To Ban Junk Food Advertising", "text": "We havethe Now, starting in 2023, the government of Prime Minister Boris Johnson is moving to ban junk food advertising online and before 9pm on TV — a move that will not only limit speech rights but undermine broadcasters who rely on such revenue.As will come as little surprise to many of this blog, I oppose such moves both as a limitation on speech rights and the freedom of choice.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 08:10 AM", "title": "Rickards: They're Wrong About Inflation", "text": "Other times it simply adds to the confusion. Such was the case with the most recent U.S. employment report released June 4 for the month of May.The report showed job gains of 559,000. That’s a strong number, but it was below expectations. The market was looking for 670,000 jobs or higher. While strong April gains were revised up slightly, the stronger March gains had earlier been revised down by 131,000 jobs over the course of April and May.The overall impact of the March-April-May data was a cooling off in new job creation.The unemployment rate for May declined from 6.1% to 5.8%. That sounds like good news until you notice that the reason for the decline was", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 07:35 AM", "title": "Russia Launches Mediterranean Drills With Hypersonic-Armed Jets At Moment UK Carrier Is In Area", "text": "Tensions between Russia and the UK and its Western allies are still on edge after Wednesday's major Black Sea incident which saw a Russian warship fire warning shots and a warplanedrop bombs in the path of the Royal Navy's HMS Defender. The Kremlin said it chased the British vessel from its territorial waters near Crimea, which resulted in a major diplomatic crisis and for which London  in terms of the speed of escalation.Setting the stage for perhaps another incident, on Friday the Russian military initiated large-scale exercises in the Mediterranean Sea, specifically in the sameeastern vicinity. Russia's Defense Ministry released Friday footage of the drills in action, likely in part as a \"warning\" to UK assets in the region...", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 08:45 AM", "title": "'No Fly Zones' - These Are The Most Dangerous Airspaces To Travel Through", "text": "Ryanair Flight 4978 was subject to a bomb threat in Belarussian airspace on May 23 and it was escorted to Minsk by a MIG-29 fighter jet where opposition activist Roman Protasevich was detained, along with his girlfriend. Condemnation of the episode was swift with EU Commission President Ursula von der Leyen descrbing \"the hijacking of the Ryanair plane byas an attack on democracy\" while U.S. President Joe Biden condemned it \"in the strongest possible terms\". the event Cases of \"air piracy\" have proven rare down through the years but the Ryanair incident has striking similarities to another forced diversion that occurred in July 1971. That involved a BOAC flight carrying two men associated with an abortive coup d’état attempt in Sudan being forced to land in Benghazi, Libya by the Gaddafi regime. The men in question were handed over to Sudan and immediately executed upon orders from the country's new president. More recently, the shootdown of Ukraine International Flight 752 over Tehran in 2020 and the destruction of Malaysia Airlines Flight 17 over Eastern Ukraine in 2014 have shown that", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 09:20 AM", "title": "Happy Birthday, Global Warming: Climate Change At 33", "text": "This month, climate change celebrates its 33rdbirthday. On June 23, 1988, NASA scientist James Hansen testified that the greenhouse effect had been detected. ", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 10:25 AM", "title": "Engineer Warned Of 'Major Structural Damage' Before Miami Condo Tower Collapsed ", "text": "Structural engineering firm Morabito Consultants (MC) completed a field survey report three years ago of the nowChamplain Towers South condominium complex in Surfside, Florida, and found structural damage.The nine-pagefrom October 2018 was first noted by The", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 09:55 AM", "title": "Fidelity Veteran Wins 'Outstanding Portfolio Manager' Award Despite Dumping GameStop Stake", "text": "As it turns out,  isn't the only institutional portfolio manager who believed GameStop was undervalued when its shares were still languishing in single-digit territory. In a story published this week,  revealed that Joel Tillinghast, the longtime manager of Fidelity's Low-Priced Stock Fund, bought GME last year. But, like Burry, Tillinghast and Fidelity dumped their GameStop shares long before they topped $100/share.Despite missing out on what would have been a career-defining slam dunk, Fidelity still awarded Tillinghast with its outstanding portfolio manager award this week. A Morningstar analyst defended Tillinghast by saying he \"doesn't chase fads\". Still, considering that the stock peaked at just shy of $500 a share, we wouldn't be surprised to learn that Tillinghast has some regrets about dumping his entire stake.", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 10:30 AM", "title": "Market Rallies To All-Time Highs As Bulls Dismiss Fed", "text": "Well, that was undoubtedly an exciting bought of volatility., we reviewed our” and the market sell-off.Well, this week, the market not only got off the mat but rallied back to new highs, just barely, as shown below.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 08:45 AM", "title": "Hungary Told To Repeal Law Banning LGBT Promotion To Children \"Or Else Leave EU\"", "text": "EU leadership is now fanatically dictating that Hungary and its 'defiant' prime ministerVickor Orban  or else \"must leave\" the European Union.Quoting Dutch Prime Minister Mark Rutte,  describes massive pushback against a new Hungarian law which seeks to prevent the public promotion ofhomosexuality and transgenderism in front of", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 09:55 AM", "title": "Study Reveals Miami Condo Had Been Sinking As Feds Now Investigate ", "text": "On the day of the horrific condo tower collapse in Surfside, Fla., weShimon Wdowinski, a professor in the Department of Earth and Environment at Florida International University, completed a recent study on the condo building and found it had sunk.The study also revealed other areas inMiami where land was unstableas the federal government declared Friday afternoon it would launch an investigation.Wdowinski's study, titledwas co-authored by Simone Fiaschi and published on", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 11:22 AM", "title": "BofA Crashes The \"Transitory\" Party: Sees Up To 4 Years Of \"Hyperinflation\"", "text": "At the start of May, when observing the avalanche of \"higher inflation\" mentions on Q1 earnings calls, which had quadrupled YoY; and jumped by a record 800% YoY...... BofA chief equity strategist Savita Subramanian : \"\"", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 10:30 AM", "title": "Do You Hear The Bells Ringing?", "text": "The bell, of course, is the signal to sell at the market top. Here we pause to take exception with this adage.Bull markets often give way to manias…where an asset’s intrinsic value becomes less important than the hope that an overpriced asset can be later offloaded at a higher price to a greater fool. Certainly, irrational pricing based on greater fool dynamics is the sound of a ringing bell. Though this can go on for years.The current ratio of total market capitalization to GDP (now over 200 percent) is most definitely the sound of a ringing bell. Another ringing bell is the $500 million batch in junk bonds recently sold by MicroStrategy for the sole purpose of buying bitcoin. These bitcoin junk bonds pay a generous 6.125 percent coupon rate.How will MicroStrategy pay the coupon if bitcoin goes down? Will they sell more junk bonds? Will anyone buy them?", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 11:30 AM", "title": "Microsoft Confirms New Cyberattack By Group Linked To SolarWinds Hack", "text": "Microsoft said on Friday that the hackers behind the notorioushave launched a fresh campaign mostly focusing on U.S. interests that, while mostly unsuccessful, the Microsoft Security Response Center", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 12:25 PM", "title": "Fla. Gov DeSantis Explains 'Sister Building' Of Collapsed Miami Condo Tower Could Be Evacuated", "text": "In the wake of theof Champlain Towers South condominium complex in Surfside, Florida, officials Saturday morning are weighing the option to evacuate its sister building, Champlain Towers North.The Champlain North tower is located about a block away from South Tower, whichearly Thursday morning.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 12:00 PM", "title": "Tesla Recalls Nearly 300,000 Cars In China On Autopilot Issues ", "text": "Tesla plans to recall approximately 300,000 China-made and imported Model 3 and Model Y vehicles to address risks associated with its assisted driving software after an investigation by the country's market regulator.The country's regulator said over-the-air programming would allow Tesla to upgrade the defective vehicles remotely to improve cruise control. For vehicles that cannot be fixed remotely, Tesla plans to upgrade the vehicles for free at service locations.The recall continues to tarnish Tesla's image in the Chinese market, where some consumers have already complained about the quality of the electric car.In mid-April, a", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 12:50 PM", "title": "John McAfee's Widow Says He Was Not Suicidal", "text": "McAfee was found dead on Wednesday hours after a Spanish court ruled that he would be extradited to the U.S., where he faced the rest of his life in jail for tax evasion.Speaking outside the Spanish prison where the anti-virus software tycoon was found dead, Janice McAfee, said:  she added.NEW - Janice McAfee, the widow of Antivirus creator John McAfee blames U.S. authorities for his death, says he was not suicidal.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 09:20 AM", "title": "Bitcoin's Homegrown Hash: Did China Just Make A Deal With The US?", "text": " It sparked a furious sell off earlier in the week which briefly breached recent lows just above $30,000 per coin.But the big question for me, as always, is ?In the case of bitcoin it happened after the FOMC shocked markets the same day Presidents Biden and Putin met in Geneva, signaling a shift in monetary policy which drained markets of a lot of dollars.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 01:45 PM", "title": "Here's Why The Yield Curve Could Re-Steepen, And What That Means For Stocks", "text": "Last week the 10-year to 2-year US Treasury yield curve spread narrowed from 133bps to 119bps in just three trading days. That 14bps curve flattening was a 2 standard deviation event going back to 1990, so it’s safe to say moves like we saw last week are rare. In conjunction with the curve flattening, the cyclical/reflation trade was reversed in its tracks with banks and commodity related businesses selling off while long duration growth stocks caught a bid. Some, but not all of that has been reversed this week.  We wrote last week that that latter seemed more plausible since none of our indicators that point to turns in the economic or rates cycle have budged. In this post we’ll focus more on the bond market and why, if anything, the curve is likely to unwind the flattening action that occurred last week.The composition of the move in the yield curve is significant. 2-year yields rose from 16bps to 25bps while 10-year yield fell more modestly from 149bps to 144bps. Currently, the 2-year sits even higher at 27bps while 10s are also higher at 154bps. The action in the yield curve last wek was the market interpreting the Fed’s monetary policy announcement as a hawkish surprise that will cause shorter-term rates to rise. Rising short rates ultimately slow the economy and tamp down inflation, which is why longer-term yields fell. For that we must turn to the market’s expectations for Fed tightening and see how that lines up with actual Fed policy and Fed speak. The Fed Funds futures market, which is an excellent tool to determine where the market expects the Fed Funds rate to be in the future, now prices the Fed to have raised rates a little more than 25bps by December 2022.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 02:15 PM", "title": "Biden Poised To Lift Trump-Era Sanctions On Iran's Supreme Leader", "text": "The Biden White House appears desperate to complete a restored JCPOA nuclear deal with Iran in Vienna prior to newly elected President-ElectEbrahim Raisi entering office in early August, given his hardline credentials which will made any future deal much more difficult to achieve.That desperation for a rapid conclusion to Vienna is evident in a new NBC report Saturday. The network cites  theBiden administration is The current sanctions onAyatollah Ali Khamenei go back to the Trump administration, imposed in June 2019 at a moment of heightened tensions with Iran-backed militias in Iraq. The actions had banned the Ayatollah from traveling to the US or conducting financial transactions with US companies or holding assets in the US.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 02:36 PM", "title": "UK Lockdown Architect Quits After Breaking Own COVID Rules During Secret Affair With Aide", "text": "And just like that, one day after claiming he won't quit, .Matt Hanock, the minister charged with eradicating Britain’s biggest postwar health crisis, quit on Saturday night in the face of an avalanche of fierce criticism of his whom he put on the public payroll.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 03:15 PM", "title": "'No Substantial Outbreaks' After Researchers Track Sports, Music And Clubbing", "text": "A  out of the UK which studied several types of gatherings with large groups of people in close proximity found  of COVID-19 following the events, according to .", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 01:15 PM", "title": "Long-Awaited US Intelligence 'UFO Report' Cites Over 140 Unexplainable Encounters", "text": "US intelligence has released a much anticipated wide-ranging report on military and government agencies' encounters with UFOs, or what the report callsunidentified aerial phenomena (UAP). The now declassified Office of the Director of National Intelligence (ODNI) which has been sent to Congress was made public late in the day Friday, and reveals the US government has .As ", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 04:15 PM", "title": "Larry Summers Sees 5% Inflation At The End Of 2021", "text": "It may not be quite hyperinflation - loosely defined as pricing rising at a double-digit clip or higher - but if former Treasury Secretary and erstwhile democrat Larry Summers is right, it will be halfway there in about six months.One day after Bank of America warned that the coming \"hyperinflation\" will last at least 2 and as much as 4 years - whether or not one defines that as transitory depends on whether one has a Federal Reserve charge card to fund all purchases in the next 4 years - Larry Summers, who is this close from being excommunicated from the Democrat party, predicted inflation will be running “pretty close” to 5% at the end of this year and that bond yields will rise as a result over the rest of 2021.Considering that consumer prices already jumped 5% in May from the previous year, his forecast is not much of a shock.Speaking on Bloomberg TV, Summers said that “my guess is that at the end of the year inflation will, for this year, come out pretty close to 5%,” adding that “it would surprise me if we had 5% inflation with no effect on inflation expectations.” If he is right, the recent reversal in one-year inflation expectations which dipped from 4.6% to 4.2% according to the latest UMich consumer sentiment survey, is about to surge to new secular highs.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 04:45 PM", "title": "\"Enough Is Enough\": Los Angeles Sheriff Urges State Of Emergency On Homelessness", "text": "In an unusual move, Los Angeles Sheriff Alex Villanueva has sent a letter to the Board of Supervisors urging them to declare a local state of emergency to address the spiraling homelessness crisis in the county, citing an increase in crime, lack of sanitation, and struggling businesses.Villanueva told reporters during a press conference inside the Justice Hall on June 23. “And that is a microcosm of what’s going on throughout the entire county of Los Angeles.” he said.There’s an estimated 200 homeless people on the", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 03:45 PM", "title": "\"Blow Up Republicans\": UNC (Wilmington) Professor Triggers Firestorm With Call For Killing Conservatives", "text": "is an associate professor at the School of Health and Applied Human Sciences at University of North Carolina Wilmington with apparently equal interest in politics and polytechnics. As will come as little surprise to many on this blog, I do not believe Johnson should face discipline for his violent political ideations.objections to the handling of the controversy by the school, which only stated  Johnson took down the posting.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 07:40 PM", "title": "Macleod: The Fed Is Trapped Between A 'Keep Inflating' Rock & A 'Collapsing Dollar Confidence' Hard Place", "text": "It is a common perception that in inflationary times financial and tangible assets afford protection from monetary debasement. Instead of rapidly escalating, so long as the consequences of inflation are contained as they have been since the early 1980s, non-fixed interest investments have been good inflation hedges. But what happens to asset prices if inflation is not contained and escalates?To answer this question, we must first define what we mean by contained inflation. Interest rates normally put a brake on the loss of a currency’s purchasing power, limiting inflation to a cycle of credit. In other words, the market must be prepared to operate and allow interest rates to function as compensation for the consequences of monetary and credit inflation. Clearly, this condition does not apply today because central banks supress interest and bond rates as well as any evidence of the bank credit cycle. Furthermore, both foreign holders of a currency and its domestic users must be satisfied with monetary conditions to broadly retain their exposure to it. In the case of the dollar, which is the currency that really matters to us all, that has been undoubtedly true so far. But in these times of rising monetary inflation, there will come a point when the lack of interest compensation for currency debasement will begin to overtly undermine the dollar’s purchasing power, and in the first instance this matters particularly to foreign holders.It is in this context that a deeper examination of the relationship between assets and the accelerated rate of issuance of state currencies is pertinent. That the rate of monetary expansion has accelerated is no secret; but so far, the probable effects on the purchasing power of the dollar, and also for other currencies aligned with it, have been ignored by investors. Central bankers have been coy on the subject, and by fiddling with the price inflation averages statisticians have buried the evidence. The suppression of the evidence on prices has been an important factor in what is effectively a concerted campaign of disinformation about inflation.While these conditions have built up for decades, so far, non-fixed interest asset values have still afforded protection for investors’ capital. For the middle classes, the values of their homes, often geared through mortgage borrowing, have risen substantially. The values of their portfolios and pension plans have also benefited hugely. For them, these conditions have been extremely beneficial, which is why central banks have latched onto the wealth effect and are now directing new money into stock markets at unprecedented rates through quantitative easing.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 08:00 PM", "title": "Bank Guard In India Shoots Patron For Entering Without Face Mask", "text": "If after the first year of pandemic lockdowns and examples of social distancing extremes across the globe didn't provide enough levels of COVID-induced  and bizarre incidents, here's a new one out of India which appears truly unprecedented: a bank customerwas reportedly in accord with the bank's rules and a nationwide mandate.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 08:20 PM", "title": "Surgeon Fired From College Of Medicine For Voicing Concerns About COVID Shots For Kids", "text": "Therepresents Dr. Francis Christian, .Dr. Christian was called into a meeting today, ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 08:40 PM", "title": "650 Troops To Stay In Afghanistan As US Intelligence Warns Of Taliban Takeover Within 6 Months", "text": "Anyone that's been following US pronouncements on Afghanistan over the last many years should know what to expect by now:. From the start of both Trump's prior pullout efforts (which had during his last year in office been set for May 1st, now come and gone) as well as Biden's current \"out by Sept.11\" final timetable, the Pentagon has simultaneously pronounced it will keep some level of sizeable security and 'counterterror' force on the ground.For example in May defense officials were predicting that it might take a contingency of 600 Marines to permanently secure the sprawling US embassy complex in Kabul - which hardly seems like the full withdrawal being promised. The various \"options\" and their intense discussion have only increased, given this month Western media reports are full of predictions of just how fast Kabul is likely to fall to the Taliban after the US finally exits.According the  this week, US intelligence is ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 08:44 PM", "title": "Kyle Bass Slams Fed, Sees Inflation Everywhere He Looks", "text": "With US stocks back at all-time highs as the market seemingly shrugged off the FOMC's reaction to the latest inflation numbers,  for an interview with the \"Closing Bell\" crew on Thursday, where he offered a dramatically different vision of the present economic scenario vis-a-vis inflation.In  expounded upon his claim that the US is already grappling with real inflation rates above 10%, the billionaire investor proclaimed that \"in every single aspect of life, I see inflation.\"", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 09:00 PM", "title": "Are We Overdosing On \"Hopium\"?", "text": "I am a prepper. I became a prepper in large part because I am aWhy? Because I am one of those people who listens to what the power elite tell us they’re going to do, then take them at their word and prepare for it. Many people have beenthis longer than I. However, I still put 13-plus years of my life into researching and exposing the globalist agenda.Almost none of what happens today is a surprise to me because it’s been bragged about for generations. After many years of learning about their agendas and conspiracies, this is the world as I see it. So take it with as many grains of salt as you wish.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 09:20 PM", "title": "\"I'm Totally Screwed\": Western Digital Tells Customers To Unplug Web-Connected Hard Drives After Data Mysteriously Deleted", "text": "Hard drive manufacturer Western Digital recommended that My Disk external hard drive owners , after a flood of customers complained in a  that , according to ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 09:40 PM", "title": "China's Disturbing Nuclear Buildup", "text": "At the Group of Seven (G-7) forum held in Cornwall, England, in early June, the leading Western economic powers announced a new international infrastructure initiative, intended to draw lower-income nations away from China’s burgeoning Belt and Road Initiative (BRI).This action was quickly followed up by the NATO summit held in Brussels a few days later, which in its official communiqué issued a dark warning about China’s military modernization. For the first time, NATO singled out China for its “assertive behavior,” which it said presented “systemic challenges to the rules-based international order and to areas relevant to Alliance security.” In fact, it is more than just a quantitative and qualitative buildup; it has grave implications for how China is changing its fundamental attitude toward the role of nuclear weapons and under what circumstances it might “go nuclear.” More critically, it is likely that even the Chinese Communist Party (CCP) has not fully thought this out, which could be disastrous for all involved.Beijing detonated its first atomic (fission-type) bomb in 1964, followed by the test of a thermonuclear (fusion-type) device three years later. Given the relatively backwards state of China’s defense science and technology base at the time, these feats, along with the launching of China’s first satellite in 1970, were a source of considerable national pride.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 10:00 PM", "title": "How An Obscure App Turned Millions Into Unwitting Spies For The US Military", "text": "There's a growing cottage industry at the nexus of consumer research and government surveillance.In a report published Friday, the Wall Street Journal explored the world of Premise Data Corp., an innocently-named firm that uses a network of users, many in the developing world, who complete basic tasks for small commissions. Roughly half of the firm's clients are private businesses seeking \"commercial information\" (mostly reporting on competitors' operations), both the US government and foreign governments have hired the firm to do more advanced reconnaissance work while gauging public opinion.According to ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 10:20 PM", "title": "The Road To Dystopia", "text": "George Santayana:\"Those who cannot remember the past are condemned to repeat it.\"It has become passé to quote in any context, especially that it was ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 10:40 PM", "title": "US Navy's Most Advanced Nuclear-Powered Sub Plagued With Problems", "text": "America's nuclear-powered fast-attack submarines are experiencing maintenance bottlenecks as specific components are wearing out decades earlier due to faulty manufacturing. The lack of spare parts has resulted in the Navy cannibalizing submarines in construction so its Virginia-class subs can remain in a state of readiness., citing a new Naval Sea Systems Command and the Congressional Budget Office (CBO) report, says spare parts for the Virginia class, also known as the SSN-774 class, are lacking and has forced shipyards to \"borrow or \"cannibalize\" parts from newly built subs.The good news is that Congress has pushed the Navy to increase construction rates for Virginia class subs from two per year to three.The service declined to define which parts are affected but noted they're for non-propulsion electronic systems.The number of swapped parts has increased over the years - many of the parts are for the submarines which entered service in 2004. By 2013, at least 100 parts were swapped from new subs to older ones. By 2013 that number grew to 171, then 201 in 2018, 452 in 2019, and then declined to 218 in 2020. Expectations this year are around 82.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 11:00 PM", "title": "The Woke Business Complex", "text": "Ostensibly, those two aspects of what was later  defeated the Union of Soviet Social Republics (USSR) circa 1990 and then went in search of other threats, including Islamic extremism.But those threats were never threatening enough to justify the billions sought by defense contractors, Big Pharma, Big Tech, and so forth, so reality often got stretched into outright lies. Remember Colin Powell’s?", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 11:20 PM", "title": "Visualizing 150 Years Of US National Debt", "text": "The total U.S. national debt reached an all-time high of $28 trillion* in March 2021, the largest amount ever recorded.Recent increases to the debt have been fueled by massive fiscal stimulus bills like the($2.2 trillion in March 2020), the($2.3 trillion in December 2020), and most recently, the", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 11:40 PM", "title": "Escobar: A Sovereign Iran Will Move Closer To Russia-China", "text": "In hisas President-Elect with 62% of the votes, Ebrahim Raesi, facing a forest of microphones, came out swinging and leaving nothing to the imagination.On the JCPOA, or Iran nuclear deal, the dossier that completely obsesses the West, Raeisi was clear:the US must immediately return to the JCPOA that Washington unilaterally violated, and lift all sanctions.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 06:11 AM", "title": "Derek Chauvin Sentenced To 22.5 Years For Floyd Killing", "text": "President Biden has released a statement about Chauvin's sentencing, saying that it \"seems appropriate\".Biden said he doesn’t know all the details of the sentencing for former police officer Derek Chauvin for killing Minneapolis's George Floyd (the 22 1/2-year sentence just came down).\nBut it seems appropriate, the president said.\nper ", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 05:15 PM", "title": "'You Were Wrong About A Lot Of Sh*t': Maher Blasts Big Tech, CDC Over Lab-Leak Censorship", "text": "Bill Maher on Friday's episode of his show, \"Real Time with Bill Maher,\" \"I find this outrageous. Facebook banned any post for four months about COVID coming from a lab,\" said Maher, adding \"Now, even the Biden administration is looking into it.\"“Outrageous.” ", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 07:00 AM", "title": "3 Dead, 6 Injured After Attack By \"Knifeman\" In Wurzburg, Germany", "text": "3 people have been killed and 6 injured by a “knifeman” in Wurzburg, Germany, with clips posted to social media showing a crowd chasing the suspect, who is a 24-year-old Somali. reports the Express.Footage shows members of the public attempting to subdue the attacker with sticks, chairs and whatever else is to hand before police arrive.The attacker attempts to flee the scene as bystanders direct a police car in the direction of the killer.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 07:35 AM", "title": "Brothers Abscond With $4 Billion In Crypto Stolen From South African Exchange", "text": "In a story that will sound familiar to anybody , two brothers who ran a South African crypto exchange have absconded with Bitcoin worth $3.6 billion stolen from their clients, demonstrating once again the one glaring security weakness: While hackers are believed to have brought down Mt. Gox, disillusioned insiders with the right kind of access can easily run off with a life-changing amount of wealth. And in many cases, clients who trusted the exchange to safeguard their assets will be left holding the bag.Africrypt Chief Operating Officer Ameer Cajee, the older of the two brothers, reportedly informed clients back in April that the company had been the victim of a hack, but asked them to keep quiet, claiming that involving the authorities could \"slow down the recovery\" of the missing funds. However, the crime has since been reported to the Hawks, South Africa's federal police in charge of disrupting organized criminal enterprises. Ameer Cajee started the company with his brother Raees in 2019 and initially it provided \"bumper returns\" for investors.But that didn't last long. According to Bloomberg, investigators have apparently determined that the brothers likely absconded with some 69K digital tokens worth approximately $4 billion at the April peak.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 05:45 PM", "title": "White House: Afghanistan Is \"Not a Winnable War\"", "text": "Ahead of talks between President Biden and Afghan President Ashraf Ghani, White House Press Secretary Jen Psaki  Afghanistan is in response to hawks calling for the troop drawdown to be reversed.Senate Minority Leader Mitch McConnell (R-KY) met with Ghani and other Afghan leaders on Thursday.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 05:40 PM", "title": "Washington State Forces Nearly Everyone To Buy Long-Term Health Care", "text": "A concerned reader from Washington asked me to discuss a new law in Washington state, the first in the nationto force people to buy long-term care insurance.No matter what your age, your bill is $0.58 per $1,000 gross income with no caps.The state calls this forced setup a \"\"", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 08:10 AM", "title": "Is The West Strategically Reorganizing To Fight Communist China?", "text": "Recently, three major summits in the Western world—those of the G-7 (Group of Seven),, and the U.S.–EU—have been held back-to-back, highlighting a significant strategic shift to confront the systemic threats posed by the Chinese Communist Party (). If 2020 was a year marked by a pandemic ravaging the world and the emergence of a new Cold War between the United States and China, 2021 will be one in which a strategic reorganization is being forged in the West to fight communist China.—by", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 12:33 PM", "title": "Daily Briefing: Raoul Pal: Preparing for the Exponential Age Amid Inflationary Pressure", "text": "Real Vision senior editor Ash Bennington welcomes Raoul Pal to the Daily Briefing to discuss his thoughts on inflation, the strength of the dollar, and winners in an exponential age. The pair will cover potential explanations for flattened personal spending as continued supply constraints push prices higher. Additionally, they will dive into the companies positioned to succeed in an era that emphasizes network effects.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 12:45 PM", "title": "They're \"Damn Near Criminally Incompetent\" - David Stockman Crushes \"Camarilla Of Money-Pumpers\"", "text": "We start with this gem from NY Fed president John Williams. He claims the Fed must keep injecting $120 billion per month of fraudulent credit into Wall Street because, apparently, this quarter’s likely 7% real GDP growth and 5% inflation are not sufficient to meet the Fed’s goals:You can’t say enough bad things about this knucklehead. He’s the very poster boy for the camarilla of academics and Fed lifers who have hijacked the nation’s central bank.For want of doubt, here is William’s career since age 18:1980-1984: A.B. in economics at University of California at Berkeley;", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 01:04 PM", "title": "Russell Bursting With Money-Losing Zombies After Today's Rebalance", "text": "According to , today's annual Russell (1000, 2000 and 3000) rebalance (the final reconstitution is today) is the \".\"While that may be a modest exaggeration (see our ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 01:24 PM", "title": "Mailchimp Suspends The Babylon Bee For \"Harmful Information\"", "text": "On Thursday, the online integrated marketing company Mailchimp suspended The Babylon Bee’s account, claiming that the system detected “harmful information” in the Bee’s emails. After Babylon Bee CEO Seth Dillon shared the news on Twitter, Mailchimp apologized. It was too late, however.Dillon announced on Twitter. Like many other companies, The Babylon Bee uses Mailchimp to send out emails to its broad email list. Without Mailchimp, the Bee could not tell its subscribers that Mailchimp had suspended the satire site.Shortly after Dillon shared the news on Twitter, Mailchimp responded, saying that the company had reinstated the account.:", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 02:05 PM", "title": "Emails Show Biden Campaign Pressured Facebook To Censor Trump Before The Election", "text": "The messages reveal how a concern that seemed to be absent during months of leftists rioting and burning down entire city blocks throughout the summer.After a deluge of public and private complaints by members of Biden’s team and other Democrats, The focus was primarily on the official Team Trump account, with", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 02:39 PM", "title": "Buchanan: The Return Of \"Law And Order\"", "text": " 10 points more than progressive Maya Wiley, who had the endorsement of Rep. Alexandria Ocasio-Cortez.Said The New York Times:Adams built “an old-school political coalition that united Black and Latino voters,” and was “able to persuade working-class people, largely outside Manhattan, that he was the best candidate to make the city safe from crime.”Adams’ anti-crime and pro-cop campaign carried four of New York City’s five boroughs, including Ocasio-Cortez’s congressional district in Queens. He lost only Manhattan, though, under the ranked-voting system New York uses, his victory may not be confirmed for a week.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 03:20 PM", "title": "Portland Police Reassure Antifa That Man Shot By Police Was White To Avoid Riot", "text": "Yes, really.After a man allegedly armed with a screwdriver was shot by cops outside a motel in Northeast Portland, There is erroneous information being circulated on social media regarding in the officer involved shooting in the Lloyd district. We can confirm that the subject involved is an adult white male. No one else was injured. tweeted Portland Police.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 03:00 PM", "title": "\"Learn To Code\" Pays Off: HFT/Quant Fund Earned Over $1 Billion In Chaotic Quarter", "text": "Remember when was racist, mysogynist, sexist, and/or homophobic and ? No seriously, ...", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 03:45 PM", "title": "Below The Market's Calm Surface, Sheer Panic As Skew Soars To All Time High", "text": "With last week's post-Fed tantrum seemingly a distant memory, spoos just hit a new all time high at 4,275 as low realized volatility helped push the VIX near new Covid-era lows...... if not lowest level. Indeed, with the VIX at 16.0, and volatility risk premium elevated, Goldman notes that short-dated hedges are not cheap - especially relative to historically low implied volatility for other key markets (. As a result, Goldman also sees \"heightened potential for realized volatility to approach June’s lows, leaving the VIX with moderate downside.\"", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 04:00 PM", "title": "Stocks & Commodities Jump, Dollar & Bonds Dump This Week As Inflation Hits 30 Year High", "text": "So this happened...Which is of course \"\".And this this happened...", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 04:40 PM", "title": "US Now Says Taiwan Sovereignty \"An Opportunity\" To Counter China", "text": "Under Biden the US Navy has sent warships through the contested Taiwan Strait six times in only five months, suggesting the White House is perpetuating Trump's confrontational China policy, also as high level US delegations - the latest being early this month led by members of the Senate Armed Services Committee who visited Taipei provocatively on  - continue to periodically visit Taiwan.On Thursdaya senior US diplomat in Taiwan revealed crucial context concerning the Democratic administration's long-term policy concerning the ROC, saying that the US has shifted to viewing the contested island's status as .", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 04:20 PM", "title": "America's Social Order Is Unraveling", "text": "a nation that has substituted artifice for realism for far too long, a nation that now depends on illusory phantoms of capital, prosperity and democracy to prop up a crumbling facade of \"wealth\" that the populace now understands is largely in the hands of a few families and corporations, most of which pay little to support the citizenry they dominate politically and financially.has two primary components:, the glue of common purpose and shared sacrifice binding the social order, and", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 05:00 PM", "title": "Greenwald: What is Behind Gen. Mark Milley's Righteous Race Sermon? Look To The New Domestic War On Terror", "text": "American generals have not exactly been defined by adamant public advocacy for left-wing cultural dogma. Yet there appeared to be a great awakening at the Pentagon on Wednesday when Gen. Mark Milley,the highest-ranking military officer in the U.S. as Chairman of the Joint Chiefs of Staff, testified at a House hearing. The Chairman vehemently defended the teaching of critical race theory at West Point and, referencing the January 6 Capitol riot, said, “it is important that we train and we understand ... and I want to understand white rage. And I'm white.\"In response to  that top military officials  on inflammatory and polarizing cultural debates, liberals were ecstatic to have found such an empathetic, racially aware, and humanitarian general sitting atop the U.S. imperial war machine. Overnight, Gen. Milley became a new hero for U.S. liberalism, a noble military leader which — like former FBI Director Robert Mueller before him — no patriotic, decent American would question let alone mock. Some prominent liberal commentators warned that ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 05:20 PM", "title": "\"Unprecedented Event\" - Pacific Northwest Set To Shatter Heat Records This Weekend ", "text": "A \"historic\" heat wave is set to transform the U.S. Pacific Northwest into a furnace this weekend. It has the potential to shatter long-standing temperature records, according to.NWS Portland added: According to", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 06:20 PM", "title": "Biden's Real Crime Against The Economy", "text": "I try to keep politics out of my economic analyses, and my approach is non-partisan. But sometimes I can’t avoid it because political policies can have significant economic impacts. Today is one of those times.One of Joe Biden’s first acts as President was to kill construction of the Keystone XL pipeline. This is a pipeline that would bring oil from the tar sands of Alberta, Canada to the Midwest United States. From there it would be moved through other pipelines or refined and distributed to gas stations and industrial users in America.The immediate impact was to kill about 10,000 high-paying union jobs with benefits in construction, transportation and expert services. The ripple effects were even greater. Once a pipe delivery operation is killed, the trucking company and pipe manufacturer lay off more personnel and those workers stop spending at local restaurants and so on.The decision to end the pipeline is pointless because the oil still moves out of Alberta. In the absence of a pipeline, the oil moves by railroad tanker cars on rail lines owned by Warren Buffett.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 06:00 PM", "title": "Japanese Lawmaker Scolds Toshiba Investors, Says Activists \"Only Think About Selling High\"", "text": "It appears as though Japanese government officials are interested in trying their hand in activist investing.At least, that's the conclusion we drew after one senior member of Japan's ruling party spoke out against activistinvestors in Toshiba, accusing them of looking for short-term profits. The lawmaker, Akira Amari, also called for more regulation to protect investors' \"economic security\" in the case of activists, .It's certainly an interesting target for Amari to defend, as Toshiba has been under fire due to numerous accounting scandals dating all the way back to 2015. The company has also faced \"massive writedowns\" for its U.S. nuclear business and the sale of its semiconductor unit, the report notes.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 06:40 PM", "title": "Nevada Sheriff's Group Says NSA Sitting On 'Every Call, Text, Chat And Banking Transaction' For 'Elite Pedos And Wall Street Criminals'", "text": "Residents and local law enforcement from have decided to become members of a growing movement that believes sheriffs have the final say on the constitutionality of any given law.On Sunday, hundreds gathered in Elko City Park, where the Constitutional Sheriffs and Peace Officers Association (CSPOA)  to mark their membership with the group, according to the ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 02:45 AM", "title": "These Are The Nationalities Supporting Britain's NHS The Most", "text": "Like the country it serves, the .that the most recent figures for NHS England show large numbers of its staff are not UK/British nationals, and have their with almost 26 thousand as of 2020. Filipinos make the second largest group, with over 22 thousand, while staff from Ireland are the third most represented at more than 13 thousand.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 03:30 AM", "title": "Bosch's New Fab And The State Of European Semiconductors", "text": " for what it says about the state of European semiconductor manufacturing:German tech giant Bosch has opened the doors to a new semiconductor manufacturing facility in Dresden, which it hopes will plug the significant hole currently plaguing automotive supply chains.The site – which was estimated to cost the company in excess of €1 billion (AU$1.57 billion) to build – will reportedly begin producing much-needed chips for vehicles by early September this year. It is so far unclear how the product will be distributed, and if German manufacturers – including Volkswagen, BMW, and Mercedes-Benz – will be given priority in the queue.“The new [factory] is the single largest investment in the company’s history. This cannot be stressed too much. Its size and additional production capacity alone are impressive. The very latest methods of data-driven continuous improvement in production make the Dresden plant a smart factory,” said German Chancellor Angela Merkel.", "is_fake": 1},
{"date": "Thursday, Jun 24, 2021 - 09:45 PM", "title": "How Many Cups Of Coffee Do Americans Drink Each Day?", "text": "drinking .The second most common answer – which will make many coffee lovers shake their heads in disbelief – was one cup or no coffee at all. 26 percent said they fell into that category.In fact, ", "is_fake": 1},
{"date": "Thursday, Jun 24, 2021 - 10:25 PM", "title": "\"Defund The Police\" Movement 'Coincided' With Biggest Surge In US Violence Since The '60s, FBI Data Confirms", "text": "Based on preliminary FBI data, America experienced one of its most murderous years in decades. Of course, let's not forget this all happened during a socio-economic collapse thanks to the virus pandemic and resulting public officials who closed the economy, leaving tens of millions of people struggling to put food on the table. At the same time, millions of others raced to their local gun store to purchase guns and ammo as liberal-run cities were transformed into a violent mess.reports US' murder rate likely increased by 25% or more in 2020, but official FBI data won't be published until later this year. The numbers are likely to be historic. \"That amounts to more than 20,000 murders in a year for the first time since 1995, up from about 16,000 in 2019,\" according to crime analyst Jeff Asher.John Roman, a criminal justice expert at NORC at the University of Chicago, told Vox that the 2020 murder surge \"is the largest increase in violence we've seen since the 1960s when we started collecting formal crime statistics.\"Many experts, or at least the ones Vox sourced or interviewed, \"still don't know why murders surged last year.\"", "is_fake": 1},
{"date": "Thursday, Jun 24, 2021 - 10:05 PM", "title": "Does First Transgender Olympian Signal The Death Knell Of Female Sport?", "text": "Laurel Hubbard will go down in the history books at the Tokyo Olympics as the first transgender athlete to compete at the Games.The day may be imminent when natural-born females are no longer represented on the Olympic medal podium as biological males start to make serious inroads into their sports.Laurel Hubbard, 43, is among five weightlifters chosen to represent New Zealand in the Tokyo Olympics to compete in the women’s 87-kilogram category. As an aside, he is also the progeny of Dick Hubbard, the former liberal mayor of Auckland. The criticism and controversy that has greeted the news of the first transgender athlete to participate in the Games does not seem misplaced. It seems ridiculous to have to remind anyone of the obvious anatomical differences between males and females, but such is the state of the current world we live in.", "is_fake": 1},
{"date": "Thursday, Jun 24, 2021 - 10:45 PM", "title": "Why Are Large Numbers Of Birds Suddenly Dropping Dead In Multiple US States?", "text": "As if we didn’t have enough things going on,  all across the eastern half of the country. Before they die, a lot of these birds are  Experts are telling us that in many cases birds are developing “crusty or puffy eyes”, and often they appear to go completely blind. In addition, quite a few of these dying birds lose their ability to stay balanced, and we are being told that some even seem to be having “seizures”. If scientists understood what was causing this to happen, that would be one thing. But at this point they have no idea why this is taking place, and that is quite alarming.", "is_fake": 1},
{"date": "Thursday, Jun 24, 2021 - 11:25 PM", "title": "Footage Of Bats Kept In Wuhan Lab Fuels Scrutiny Over Its Research", "text": "Official Chinese state-approved footage from years ago showing  being kept at the  Institute of Virology has further fueled scrutiny of the research being conducted at the secretive facility.A 2017 promotional video featured on the website of the Chinese Academy of Sciences (CAS),a top Chinese state-run research institute that administers the Wuhan lab, showed live bats held in cages inside the lab. In it, a researcher who wears blue surgical gloves was holding a bat and feeding it with a worm.", "is_fake": 1},
{"date": "Thursday, Jun 24, 2021 - 11:05 PM", "title": "COVID Baby Bust Accelerates Nine Months After Lockdowns", "text": "In a previouslast month, we said one of the biggest deflationary threats looms over the U.S. economy, that is,birth rates have fallen to their lowest level in a generation. Diving deeper into the baby bust, new Centers for Disease Control and Prevention data shows nine months after the virus pandemic was first declared a national emergency, U.S. births plunged 8% in December, according to .CDC data showed an acceleration in birth declines for the second half of 2020. Full-year data shows that the number of babies born countrywide fell 4% to 3.6 million, the most significant decline since 1973, the start of the stagflation of the 1970s.", "is_fake": 1},
{"date": "Thursday, Jun 24, 2021 - 11:45 PM", "title": "Visualizing US Droughts Over The Last 20 Years", "text": "Temperatures from California to the Dakotas are currently hovering aroundabove average - This animated map by reddit user /provides a historical look at droughts in the U.S. since 1999, using data and graphics from the U.S. Drought Monitor (USDM).", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 12:05 AM", "title": "The \"Conspiracy Theory\" Charade", "text": "Biden’sreport last week declared that “enhancing faith in American democracy” requires “finding ways to counter the influence and impact of dangerous conspiracy theories.”. While many allegations have been ludicrously far-fetched, the political establishment and media routinely attach the “conspiracy theory” label to any challenge to their dominance.Reasonable citizens are supposed to presume that government creates trillions of pages of new secrets each year for their own good, not to hide anything from the public.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 04:15 AM", "title": "Russia Warns Britain It Will Bomb Its Ships Next Time", "text": "One day after a reckless maneouver by a UK warship sailing just off the Crimea coast nearly started a hot war,  Additionally, Russia summoned the British ambassador in Moscow for a formal diplomatic scolding after the warship breached what the Kremlin says are its territorial waters but which Britain claims belong to Ukraine.Russia said it chased a British destroyer out of Crimea waters with warning shots and bombs in its path, but Britain rejected Russia's account of the incident ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 02:00 AM", "title": "UK Would Send Warships Though Crimea Waters Again, Minister Says", "text": " a UK cabinet minister said after Russia accused a British destroyer of breaching Russian waters.Russia said on June 23 that itin the path of the UK’s HMSDefendernear Cape Fiolent, a landmark on the southern coast of Crimea near the port of Sevastopol, headquarters of the Russian Navy’s Black Sea fleet.Russian media quoted the defense ministry as saying the shipventured as much as three kilometers (two miles) inside Russian waters before leaving.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 05:00 AM", "title": "UK MP Says \"Important People\" Shouldn't Need To Quarantine Under COVID Rules", "text": "MP John Whittingdale was speaking about  to take part in the Euro 2020 final on July 11.While ordinary Brits cannot even go on holiday to most destinations and have to quarantine on return, the government has changed the rules to enable VIPs with a “Euro 2020 invite” to avoid having to self-isolate or quarantine when they arrive in the country.reports Sky News.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 04:44 AM", "title": "State Of Emergency Declared After Miami Condo Building Collapse; 99 Still Missing", "text": " Search and rescue teams comb through tons of rubble of a collapsed condo building in Surfside, Florida, according to the.Video shows Miami-Dade firefighters working dangerous search-and-rescue effort in basement parking garage at the Surfside building collapse -  ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 05:45 AM", "title": "Bolivia Moves Closer To Gold Confiscation With Latest Law Blocking Bullion Sales/Exports", "text": "Perhaps the 25,000% hyperinflationary evaporation of the peso in the '80s has left a deep scarring on the South American countries lawmakers. The Bolivian Central Bank (BCB) took the administrative measure to  in order to maintain its peg to the dollar.And in doing so, the BCB has been forced to puke away its ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 06:30 AM", "title": "Gamestop In, AMC Out? Which Meme Stocks Will Be Impacted In Today's Russell Rebalance?", "text": ", every June, the Russell Index rebalances by removing stocks that no longer meet their criteria (and incorporating recently improving names)., Each year in June  the FTSE Russell uses a set of", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 07:00 AM", "title": "Toshiba Shareholders Vote To Oust Chairman In Rare Blow To Management", "text": "Rebukes of corporate leaders in Japan are rare, but on Friday, shareholders of Toshiba - one of Japan's most important and most well-known tech giants - voted to oust Chairman of the Board Osamu Nagayama (along with a member of the board's audit committee) after an independent investigation uncovered that the company had wrongly colluded with other insiders to try and influence last year's board selection.The vote comes just months after Toshiba investors backed Singapore-based hedge fund Effissimo Capital Management's call for a probe into the 2020 annual general meeting, in what was also considered a landmark vote.Nagayama’s ouster is a \"hugely shocking result for Japan’s business scene,\" according to Shin Ushijima, the president of Japan Corporate Governance Network.According to ", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 08:14 AM", "title": "UK Lockdown Architect Apologizes For Breaking COVID Rules Over Affair With Aide, Won't Resign", "text": ": And just like that, .* * *: British Health Secretary Matt Hancock said he was", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 07:28 AM", "title": "3 Trillion Reasons To Brace For Today's Record-Breaking Quad Witch Chaos", "text": " we warned of the potential for upheaval in markets that today's near-record-breaking options-expiration (and quad witch) could cause as, in the process eliminating one of the natural downside stock buffers (see \"\").Anyone who 'traded' yesterday's markets knows that is true and today could be even more wild as Goldman points out that ", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 07:59 AM", "title": "Wuhan, Weapons, & Burned Spies: CCP Defector Identified, Gave 'Terabytes' Of Dirt To US Govt.", "text": ",", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 08:30 AM", "title": "Rabo: To Inflate AND Not To Inflate, That Is The Question", "text": "How else does one interpret US-year Treasury yields reversing Wednesday’s 10bp jump to fall below 1.50% again, and 30-year yields plungingintra-day, closing down 12bp? Or the broad DXY dollar index jumping for a second day? Or commodities continuing to tumble, with US corn futures down nearly 7%, soybeans -6.7%, and wheat -3.4%?The mere threat of acting on rates to a minimal degree two and a half years from now --and an unexpected rise in US initial claims-- prompted the bond market to recall that beneath our Covid- and supply-chain distortions still lies the New Normal. That’s a backdrop which as recently as 2019 had everyone worrying about secular stagnation; and it suggests Fed rate hikes into an economy which even their own economic projections show can run ultra-low unemployment rates AND low GDP growth AND low inflation would be a policy error, just like the last US tightening cycles where the yield curve flattened towards inversion.As importantly,", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 08:50 AM", "title": "OnlyFans Seeks To Raise Funding Round At Over $1 Billion Valuation", "text": "OnlyFans, an online site where adult \"entertainers\" and celebrities charge onlookers for access to videos and photos, is now raising funding at a valuation of more than $1 billion.The company is profitable, , who cited people with knowledge of the matter. With new investors, the company is trying to shake off its reputation for pornography and make a pivot to a more mainstream platform.The site is best known for being home to top earners like rapper Bhad Bhabie, Cardi B and former porn star Mia Khalifa. It also hosts celebrities likeprofessional boxer Floyd Mayweather.", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 07:54 AM", "title": "Futures At Record High Ahead Of \"Biggest Trading Event Of The Year\" As Russell Rebalances", "text": "S&P futures traded at record highs, tracking strong gains in Asian markets, as investors braced for the Fed's preferred inflation data following a tentative bipartisan agreement on infrastructure spending, while U.S. lenders rose after clearing stress tests. At 7am ET S&P futures were up 5.75pts or 0.14%, Dow Jones futs were +110 or 0.32% and Nasdaq futs were up 29.25 or +0.2%. On Thursday, the Nasdaq and the S&P 500 indexes closed at record highs, while the Dow jumped almost 1% after Joe Biden embraced the $1.2 trillion bipartisan Senate spending deal and as data showed a labor market recovery was on track, albeit at a slower pace. Major US banks such as Bank of America, JPMorgan Chase and Citigroup were all higher in premarket trading after all Wall Street bankspassedthe Federal Reserve’s stress tests, paving the way for over $140 billion in payouts. Nike surged 12% in premarket trading after sneaker maker forecast fiscal full-year sales ahead of Wall Street estimates prompting several analysts to raise their price projections, and helping Dow futures rise 0.3%. In sympathy, Adidas jumped 5.1% to 17-month high, while electricity producer Iberdrola dropped 2.1% to the lowest since early March. The latest evidence of a labor shortage came from FedEx Corp as the U.S. delivery firm missed 2022 earnings forecast due to hiring difficulties. Its shares shed 3.8%.Here are some of the other big premarket U.S. movers today:“Market response to the hawkish Fed is different to the 2013 taper tantrum,” wrote Barclays Plc strategists led byEmmanuel Cau. “This time, curve flattening has constrained cyclicals and real rates have not risen much, which has preserved equities. The former looks premature to us, but while a spike in real rates seems unlikely for now, it is a key tail-risk for equities.”", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 09:08 AM", "title": "Nomura Nails Today's \"Gamma Unclench\", Highlights \"Big Buying Of Credit Downside\"", "text": ", Nomura's Charlie McElligott warned - amid volatility doldrums and incessantly dip-buying stock gains - that the party could end next Friday (today) as the quad witch combined with realized risk windows shifting would lead to a notable increase in volatility.Given the surge in vol and chaotic trading of the last three days (and more to come today), he nailed it...And now he is warning that \" - with “official taper” pile-on from Fed’s Bullard just now (*BULLARD: CHAIR POWELL OFFICIALLY OPENED TAPER DISCUSSION AT LAST MEETING, MORE IN DEPTH DISCUSSION TO FOLLOW) adding into what we already anticipated to be a potential", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 08:28 AM", "title": "Virgin Galactic Shares Rocket 20% Higher After FAA Approval To Fly Customers Into Space", "text": "Shares of Virgin Galactic \"rocketed\" higher in the pre-market session, up nearly 20%, after the highly shorted company (23% of float is short) got approval from the Federal Aviation Administration (FAA) to fly customers to space, sparking yet another vicious short squeeze.The stock traded at a four month high after the FAA \"updated its current commercial space transportation operator license to mark the first time the FAA has licensed a spaceline to fly customers,\" according to .Virgin Galactic also said its May 22 test flight \"performed well against all flight objectives\".", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 09:21 AM", "title": "The NHTSA Is Still Investigating Two Dozen Tesla Crashes Potentially Involving Autopilot", "text": "While the NHTSA has often been the butt of numerous jokes on this site - namely for failing to see what we believe to be the extraordinary obvious: that Autopilot and Full Self Driving are being beta tested on innocent drivers across major roadways in the U.S. - the agencystill in the midst of investigating Tesla to an extent many might not know.Of the 30 investigations the NHTSA has opened into Tesla since 2016, Tesla's Autopilot has only been absolved of liability in three crashes, .", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 09:40 AM", "title": "You Can't Create Permanent Inflation From Artificial Growth", "text": "Much likedespite the Fed’s best efforts,Currently, depending on whether you areor", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 10:00 AM", "title": "Tokyo Allows Alcohol For Patrons Drinking Alone As Organizers Mull Olympic Games Crowd Limits", "text": "Yesterday, the Japanese PM Yoshihide Suga announced that Japan would relax emergency measures in Tokyo and the country's other prefectures currently affected by a state-of-emergency order, lifting most COVID-19-related restrictions just five weeks before a dramatically scaled-back and already once-delayed Summer Olympics.Meanwhile, the chief of the Olympic Games organizing committee, Seiko Hashimoto, said Friday that she wants to allow up to 10,000 spectators at Olympic events. despite the fact that  that barring spectators would be the safest option. As authorities wait on a final decision, authorities in Tokyo have decided to roll back some of the capital's controversial restrictions on alcohol consumption - but not to the degree that many consumers and business owners had hoped.In what struck us as a conspicuously dystopian headline, Reuters reported Friday that the Tokyo Metropolitan Government plans to allow bars and restaurants to serve alcohol again starting Monday - but there's a catch. Customers who wish to drink have been asked to visit the bar alone - or with at most one other person - and they will only be allowed to stay a maximum of 90 minutes.", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 10:30 AM", "title": "Michigan Senate Passes Legislation To Add Voter ID Requirements: ‘Overwhelmingly Popular’", "text": "Michigan’s Republican-led Senate on June 16 passed several bills that, if signed into law, would implement more voter identification requirements for in-person voters and absentee voters, adding Michigan to a growing list of states pursuing more stringent election measures.Current law stipulates that. More than 11,000 individuals cast ballots this way during the Nov. 3 election, according to election officials.The Senate also voted 19–16 to ", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 06:30 AM", "title": "\"Giant Mistake\" - CDC Delays Emergency Meeting On Post-Vax Heart Inflammation Due To Juneteenth", "text": "TheCenters for Disease Control and Prevention () has pushed back an emergency meeting on post-vaccination heart inflammation seen in Americans, primarily young people, because of a new federal holiday.A federal office said Thursday that because June 19 falls on a Saturday this year, the observation will take place on Friday.The agency did not immediately respond to a request for comment.", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 08:20 PM", "title": "\"Divine Vessel\" Rockets Chinese Astronauts To New Space Station", "text": "In the last month and a half, China has launched the  of the new Tiangong space station and . On Thursday, three astronauts were catapulted into low Earth orbit and successfully docked with the new space stationlaunchedin April, according to .", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 07:00 AM", "title": "Tropical Storm Claudette Expected To Form Imminently, Takes Aim At US Gulf States", "text": "Tropical Storm Claudette is likelyto form Friday and impact the Gulf Coast of the US this weekend while much of the Western half of the US is plagued with once-in-a-generation megadrought and scorching temperatures.The National Hurricane Center (NHC) issued tropical storm warnings for the central Gulf Coast with impacts expected to begin tonight. meteorologist Robert Shackelford said the storm might develop into a Tropical Cyclone 3, which is forecasted to create flash flood risks for Louisiana, Mississippi, Alabama, and the Florida Panhandle starting Friday evening and through the weekend.NHC says the storm could dump heavy rains from New Orleans to Mobile.", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 08:40 PM", "title": "20 Tons Of Coke = 40 Years In Prison For MSC Container-Ship Crew", "text": "Bosko Markovic began working for ocean carrier Mediterranean Shipping Co. (MSC) in 2008. Over the next 11 years, the Montenegrin worked his way up to the position of chief mate, second in command behind the master, with an annual salary of $108,000.That wasn’t enough money for him, according to prosecutors from the U.S Department of Justice.“” they said, Markovic attempted to use his management role aboard the container ship MSC Gayane to help pull off one of the largest and most audacious drug-smuggling operations in history.", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 09:00 PM", "title": "Texas Gov. Abbott Hails \"Biggest & Best\" Gun Law As He Signs 'Constitutional Carry' Into Effect", "text": "Starting September 1st, Texans will be able to carry handguns in public without a license after on Wednesday the controversial bill dubbed \"constitutional carry\" was singed into law by Governor Greg Abbott.He later presided over a ceremonial signing on Thursday morning where the governor hailed it asthe  this session. Standing alongsideNational Rifle Association leader Wayne LaPierre in San Antonio, where he signed the bill, , \"Surely there’s no state in America that’s ever done as much protecting gun rights.\"", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 09:20 PM", "title": "Supreme Court Rules Foster Agencies Can Deny Certification To Same-Sex Couples On Religious Grounds", "text": "The U.S. Supreme Court unanimously ruled on Thursday that a Catholic foster agency in Philadelphia was free to turn away same-sex couples as foster parents on grounds of religious freedom.The decision () comes in the caseof Fulton v City of Philadelphia, in which Catholic Social Services (CSS) sued the city after being ordered not to exclude same-sex couples from certification.In a 9–0 ruling, ", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 09:40 PM", "title": "Hong Kong Pays Off 3 Patients Who Suffered \"Adverse\" Reaction To COVID Vaccines", "text": "For the first time since its mass-vaccination campaign kicked off three months ago, Hong Kong's vaccination indemnity fund has paid out a total of HK$450,000 ($58,000) as compensation for patients who suffered particularly severe reactions to inoculation against COVID.Out of more than 3MM doses of vaccines that have been administered in the city-state since February, HK's Food and Health Bureau said it had received 74 applications for compensation as of June 10, 58 of which were still being processed. As of Sunday, 3,605 people had reported an adverse reaction to their jabs, roughly 0.12% of all vaccination recipients. Only 1.2MM, or 16.3% of the city's population, has been fully vaccinated.Awards were given to patients whose reactions were deemed especially severe.\"The principles of severity assessment include fairness to applicants, prudent use of public funding, transparency to the public, and based on medical science,\" the bureau said in a statement. \"Severity of individual cases is subject to case-by-case assessment according to their circumstances.\"", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 10:00 PM", "title": "Lois Lerner Of 2021: IRS Political Corruption Unchanged With Billionaires' Tax Returns ", "text": "When the private tax returns of billionaires were leaked to a left-wing group, liberals and conservatives reacted very differently. Liberals fell for the political trick and immediately said that the tax code was unfair and the rich should get a tax hike. Conservatives saw through the conspiracy and wanted answers on how the Deep State at the IRS could,once again, have so much unchecked power for political purposes. When it comes to outrage, liberals always protest louder, so conservatives have to respond better.The billionaires' actual tax returns were “provided” to the leftist activist group called ProPublica. It says it has “a vast trove of Internal Revenue Service data on the tax returns of thousands of the nation’s wealthiest people, covering more than 15 years.” It alleges that:ProPublica never explains that whoever gave them these documents broke multiple federal laws. The end justifies the means in their worldview.The FBI is investigating the leak. House Republicans have demanded IRS Commissioner Charles Retting keep Congress informed on the investigation and have hearings into any “evidence of political influence or motivations.”", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 10:20 PM", "title": "Mashed Potato: Brian Stelter's CNN Show Loses 72% Of Viewers In 2021", "text": "Ratings for Brian Stelter's \"Reliable Sources\"  - as the  host has lost 72% of his viewers since hitting its highest level of the year on January 10.Stelter, who just last week groveled at the feet of White House Press Secretary Jen Psaki - asking how the media can better cover President Biden - has failed to attract at least one million viewers for ", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 10:40 PM", "title": "China's Plan To Dominate 'Near-Earth' Space", "text": "Communist China's space program is demonstrating that it is on a trajectory possibly to surpass the US in the military and scientific exploration in our solar system. China is planning a space spectacular to celebrate the 100thanniversary of theof the Chinese Communist Party on July 23, 1921. Today, June 17, China launched acrew who will inhabit the command module of its soon-to-be-completed Tianhe Chinese Space Station. This planned human launch follows the June 10 multiple satellite deployment from Northern China's Taiyuan Satellite Launch Center. Following that declaration, China aggressively began to compete with both the former Soviet Union and the United States in space -- an ambition seemingly energized by China's desire to develop a nuclear bomb and the means to deliver it. China's Space Program, called the \"", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 11:20 PM", "title": "Vaccine Passports: Are Business Rights More Important Than Personal Freedom?", "text": " But beyond that, tyrants will also exploit the ideals of the target population and use these principles against them. Like weaknesses in the armor of a free society, our ideals of freedom are not necessarily universally applicable at all times and in all circumstances; we have to place some limits in order to prevent oligarchy from using liberalism as a tool to gain a foothold.This battle for balance is the defining drama of all societies that endeavor to be free. It might sound hypocritical, and your typical anarchist and some libertarians will completely dismiss the notion that there should be any limits to what people (or companies) can do, especially when it comes to their private property. But at what point do private property rights encroach on the rights of others? Is it simply black and white? Does anything go? The bottom line is, in the wake of covid controls and mass online censorship, it is time for those of us in the liberty movement to have a frank discussion about where the line is for the rights of businesses.Here’s the thing: If we are talking about smaller websites run by private individuals, then yes, I would argue in defense of their right to remove anyone from their site for almost any reason. Their website is their property, and much like their home they can do whatever they want within it. Denial of access to an average website is not going to damage the ability of a person to live their normal lives, nor will it fundamentally restrict their ability to share information with others. There are always other websites.And, what if a host of small businesses in a given place decide they are going to implement freedom crushing mandates along with major corporations? What if they are all manipulated by government incentives or pressure?", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 11:00 PM", "title": "\"We Were Busy!\" - NYC Strip Clubs \"Packed\" As COVID Restrictions Lifted", "text": "Now that Gov. Andrew Cuomo  returning the area to near-normalcy,  that NYC's strip clubs were mobbed by patrons during their first nights of having dancers return to the stages.The paper reports that strip clubs across the city have been packed this week after Cuomo's announcement that he was lifting COVID restrictions in commercial and social settings. The Post even sent out a reporter, who confirmed that all three locations of the club Sapphire were \"packed\" as the clubs returned to full capacity for the first time in more than a year. It's a triumph for the NYC clubs, many of which opted to file a joint lawsuit against Gov. Cuomo and the state's liquor authority for ordering them to stay closed while bars started to reopen.", "is_fake": 1},
{"date": "Thursday, Jun 17, 2021 - 11:40 PM", "title": "Visualizing The Rise And Fall Of Ammo Prices ", "text": "Ammo prices across all calibers are coming down in price since April but remain well above their pre-COVID levels, according to Redditor \",\" sourcing data from .Readers are pretty familiar with the massive grab for guns and ammo during the virus pandemic and social unrest of the 2020s. The result of unprecedented demand resulted in gun and ammo prices reaching historic levels. At some points, there were even ", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 10:13 AM", "title": "2Y Treasury Yields Are Exploding Higher, Yield Curve Collapse Crushes Banks", "text": "2Y Yields are up for the 6th straight day with the biggest daily surge in yields since Feb 2020. At the same, the long-end of the curve is seeing demand (as yields drop)...This surge in yields at the short-end has pushed 2Y to the highest since April 2020...Collapsing the yield curve...And dragging financials lower...", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 12:00 AM", "title": "Escobar: The Real B3W-NATO Agenda", "text": "- Jim Morrison,For those spared the ordeal of sifting through the, here’s the concise low down: NATO, of course, are just a bunch of innocent kids building castles in a sandbox.", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 03:30 AM", "title": "Manchester Arena Bombing Inquiry Finds Security Guards' Fears Of Being Called \"Racist\" Prevented Jihadist Capture", "text": "Yes, really.“Sir John Saunders, who is chairing the probe into the 2017 terror attack, saidoutside an Ariana Grande concert, killing 22 innocent people and injuring hundreds more,” reports.", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 02:00 AM", "title": "Beijing Retaliates After EU Excludes China-Made Vaccines From Digital COVID 'Passport'", "text": "The European Union will start its “EU Digital Covid Certificate” program on July 1, after the tool to streamline information about a traveler’s COVID-19 status was approved by the EU Parliament on June 9. China-made vaccines are not recognized by the program, as is the case with the Russia-made vaccines.All EU member countries, as well as Iceland, Liechtenstein, Norway, and Switzerland, are included in the scheme that will streamline information about the COVID-19 health status of travelers likeCOVID-19 test results, recovery status, or vaccination status, to help them move more efficiently around EU countries, which all still have different entry requirements. The digital certificates contain a QR code and are issued by individual EU countries. All EU countries are required to recognize the certificates issued by other EU countries. However, some EU member states, such as Greece, Cyprus, Hungary and Serbia, have individually accepted Chinese vaccines.In line with the EU’s decision,", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 02:45 AM", "title": "Buy In Scotland, Rent In London: Britain's Post-COVID Housing Market", "text": "One of the biggest life questions facing this generation is  for themselves and their family.,  in the country and as a new analysis from estate agent Hamptons shows, ", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 03:44 AM", "title": "What If The Mainstream Media Had Told The Truth?", "text": "Remember that time when the mainstream media lied about former President Donald J. Trump, only to have Trump proven correct afterwards?“Can you be more specific,” you ask?Good point.There are so many to mention, we need to be more precise, so let’s narrow the list down to five, and let’s consider the true impact of their dishonesty.", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 05:00 AM", "title": "Jeff Bezos-Backed Company To Build Fusion Plant In UK", "text": "Canadian General Fusion, a company backed by Amazon, is  the BBC reports, adding the facility will be 70 percent the size of a commercial reactor.Nuclear fusion has been garnering growing attention amid government efforts to pursue an energy transition away from fossil fuels and towards renewable sources of energy.To date, the biggest project aiming to recreate the process by which the Sun generates energy is ITER in France, which is planned to begin operation in 2035, after a series of delays.", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 04:15 AM", "title": "Finding New Ways To Cool Data Centers Is Big Tech's Newest Arms Race", "text": "The debate over bitcoin's environmental footprint has shaken its price, and prompted a public discussion about the environmental footprints of various industries, from oil & gas to tech to Wall Street. In a gauge of the public's interest in the environmental footprint of various industries vs. crypto, one chart that sought to offer some context for the bitcoin network's energy usage went viral.Still, as  concedes, all those emails, memes, videos, PDFs and photos need to be stored somewhere. And with most companies increasingly reliant on cloud providers like AWS and Microsoft Azure, these companies are building data centers like crazy just to keep up with the demand. Right now, data centers consume between 2% and 4% of the world's electricity. However, engineers are scrambling to suppress costs as much as possible by finding new and innovative ways to cool the processors in their data centers (since cooling often accounts for half, or more, of a data center's energy usage).The race to find new cooling strategies has apparently become so competitive, that a handful of startups have decided to take on Microsoft and Amazon as everybody races to develop increasingly effective solutions.", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 10:50 AM", "title": "\"They're Not Going Away\" - Retail Trading Continued To Surge During First Half Of 2021", "text": "Last week,  some new research from Goldman Sachs that confirmed what many had observed over the past year: the flood of newly-minted retail traders seen over the past year and a half has transformed retail trading activity from a contrarian to a leading indicator.In fact, the newfound dominance of retail traders has taken an old market dynamic and flipped it on its head: in contemporary markets, it's retail traders who generate buzz in a stock by driving it higher, drawing the attention of institutional traders, before the \"dumb\" money rotates out, leaving the \"smart\" money holding the bag. The dynamic has been perhaps the most pronounced with GME.Institutional traders have taken notice of this newfound retail \"edge\", which is why firms ", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 05:45 AM", "title": "Hospitals See Surge In Double-Lung Transplants As COVID \"Honeycombs\" Organs", "text": "As scientists start to assess the impact that COVID-19 has had on patients and the American medical system more broadly,  that hospitals across the US have seen a surge in patients receiving single- and double-lung transplants.Transplants are necessary for only the most serious COVID-19 cases. In these patients - pretty much always patients with comorbidities - COVID-19 ravages the lung tissue, leaving nodules in the lungs incapable of absorbing oxygen from the air and transmitting it to the blood stream. For many patients, the grueling procedure may be the only solution after experiencing the worst lung damage caused by the virus - when the body fails to properly respond to, and heal from, the hyper-inflammatory response provoked by COVID-19.John Micklus’s battle with Covid-19 began last Christmas and ended five weeks later with lungs so irreversibly damaged that doctors said there was nothing they could do to save him.", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 05:56 AM", "title": "Coiled Futures Set To Pounce During Today's Massive Op-Ex", "text": "With traders on edge ahead of today' massive quad (or triple for the anal purists) witching opex, in trillion in index option gamma is set to expire potentially unleashing a burst of volatility across risk assets...... worlds stocks were stuck just below record highs on Friday, with investors left looking for direction after digesting the U.S. Federal Reserve’s more hawkish stance (which has since been re-evaluated as bullish), which saw the unwind of reflation trades resulting in a huge divergence between soaring growth (QQQ) and sliding value (IWM) stocks as markets repriced inflation expectations and as yields tumbled following Wednesday' hawkish shock.", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 10:20 AM", "title": "Fed's Bullard Spooks Markets With Taper Talk, Fears \"Froth\"", "text": "US equity futures were already sliding this morning as option expirations loomed, but when St.Louis Fed Chair Jim Bullard appeared on CNBC and admitted that  losses accelerated...Treasury yields are also spiking, especially 2Y..And the dollar is extending gains...", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 11:10 AM", "title": "The McCloskeys Plead Guilty To Minor Misdemeanors In Conclusion Of St. Louis Protest Case", "text": "A year ago,the charges against Mark and Patricia McCloskey of St. Louis after their armed standoff with protesters. I was  brought by Circuit Attorney Kim Gardner, who was .", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 11:53 AM", "title": "Fragile Order Failing - Do You Hear Me Now, Butterfly?", "text": "is an amazing movie. Even if the quality of the second half of film is a bit lower in my opinion, the first half is a masterpiece. Quentin Tarantino managed to a write a story that gradually and subtly become intriguing before destroying everything with one of the most brutal and violent car crashes ever filmed.Somehow, one could regard that scenario and its epilogue as a metaphor for 2021 capital markets, as the mother of all crashes is likely to be the conclusion of one the largest speculative bubbles in all human history.Many technical analysts keep claiming that they will be able to identify the top and to reverse their positions when we reach that moment. Besides, stop-loss orders are seen as a protection against any bad surprise such as a black swan event.Inspired by Mandelbrot’s works on fractal geometry, asset manager Edgard Peters put forward the “fractal markets hypothesis” at the beginning of the 1990s. According to him, the price of an asset can evolve by random walk, a persistent trend or mean reverts. When there is a persistent trend, the bull run is fueled by investors who have the longest time horizon. In other words, each sell-off will be bought, even if participants with a shorter time horizon might occasionally become net seller. In such a BTD environment, the trend is definitely “your friend.”", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 11:35 AM", "title": "White House Says It's Considering Talks Between Biden & China's Xi", "text": "Coming off the Biden-Putin summit this week, the White House says it's , according to a statement byNational Security Advisor Jake Sullivanon Thursday.\"What the President said about there being no substitute for leader-level dialogue as a central part of why he held the summit with Putin yesterday,\"", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 12:58 PM", "title": "White House Officials Brush Off Questions On Whether US Will Meet Biden's Vaccine Goal", "text": "White House officials on Thursday brushed off questions about President’s July 4 vaccine goal, which appears to be in jeopardy due to the current vaccination rate.Asked about the goal during a virtual briefing on Thursday, White House coronavirus coordinator Jeff Zients did not say whether the goal could still be met.“", "is_fake": 1},
{"date": "Friday, Jun 18, 2021 - 12:10 PM", "title": "\"Thermal Shutdown\" - Heat Wave Knocks Beta Starlink Users Offline", "text": "While a massive heat wave and megadrought plague tens of millions of Americans, beta users of SpaceX's broadband service called Starlink are reporting their dishes are overheating, which knocks them offline.Earlier this week, aposted an error message that reads \"Offline Thermal Shutdown.\" The dish \"overheated\" and \"Starlink will reconnect after cooling down,\" the error message continued.According to", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 07:00 PM", "title": "Parents Sue LA School District Over COVID Mandates For Children", "text": "TheUnified School District (LAUSD) is being for the coming school year.The", "is_fake": 1},
{"date": "Friday, Jun 25, 2021 - 07:20 PM", "title": "Senators Tell Biden Hong Kong Newspaper's Forced Closure Requires Mandatory Sanctions", "text": "Following  against Hong Kong media, specifically the forced permanentclosure ofHong Kong's 26-year long running newspaperunder the far-reaching China-backed 'national security law', in response to the crackdown.", "is_fake": 1},
{"date": "Saturday, Jun 26, 2021 - 06:15 PM", "title": "Japan Trails The World In Vaccination Race As Olympics Loom", "text": "As the UEFA Euros are underway across Europe, showcasing the return of spectator sports on the world stage, Japan is preparing to host an even bigger event in less than a month. With COVID cases down and the state of emergency freshly lifted in most of the country, it may look like the timing could hardly be better for the Olympics to come to Tokyo, at least under the given circumstances. However,  And while roughly ahead of the Games, as the organizers recently announced, the", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 11:00 AM", "title": "\"They're Everywhere\" - Megadrought Sparks Grasshopper Plague In Western US ", "text": "By now, it's become quite evident that the western half of the U.S. is facing one of the. We've spoken aboutand drying up, but the question remains what happens next?", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 10:55 PM", "title": "\"America Is Not America Any Longer\" - Giuliani Rages After Law License Suspension", "text": ", who served as the personal attorney for former President Donald Trump, on June 24 harshly criticized the decision by the New York State Bar to revoke his law license.Giuliani said on.“We live in a state that’s controlled by the Democrat Party, by [Gov. Andrew] Cuomo, by [New York City Mayor Bill] de Blasio, and the Democrats.”", "is_fake": 1},
{"date": "Monday, Jun 28, 2021 - 04:01 PM", "title": "Dow Dumps, Nasdaq Jumps As Bonds & Bitcoin Bounce-Back", "text": "After Friday's last-second chaotic moves in Russell 2000 and 1000 on the rebalance, today was clear: And that meant dump The Dow and Small Caps and BTFD in Nasdaq. S&P ended marginally higher (helped by tech)...Never mind the chaos under the surface (and the weaker macro data surprises), \"all is well\"...Today was the 2nd biggest daily spread between Nasdaq and Small Caps in 4 months, and leaves the pair at a critical support level...", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 02:41 PM", "title": "HFT Giant To Challenge Citadel's Dominance Of Retail Stock Trading", "text": "By now it's common knowledge that the golden goose that powers the  of HFT giant Citadel, which resulted in record EBITDA of $4 billion last year, more than doubling the prior year results...... not to mention the driving force behind Ken Griffen's mansion and artwork collection, is Citadel's near monopoly when it comes to controlling retail orderflow in the US: Citadel Securities estimates that it commands 27% of equity volume market share in the U.S., up from 21% in 2017 a ; the company is especially dominant in retail order flow, with 46% of the market.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 07:40 PM", "title": "Half A Million Illegals Crossed Since Harris Named Border \"Czar\"", "text": ".reported the findings, noting that only three months has passed since Harris took on the responsibility, and that the half a million figure is just those that have been apprehended.around 180,000 immigrants are being caught per month. In April agents arrested 178,854 illegal immigrants, the highest monthly figure for 21 years. That figure was then surpassed in May as agents apprehended 180,034 illegals.By the time June’s figures are reported in the coming days, the combined number is expected to be over half a million, more than the entire population of Miami, Florida or Cleveland, Ohio.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 08:00 PM", "title": "Restaurants Have No Choice But To Raise Menu Prices Amid Inflationary Pressures ", "text": "All vaxxed up (or maybe some have the COVID antibodies), many Americans are ditching their on-demand food delivery apps this summer and are supporting local restaurants with an in-dining experience but have been sticker shocked by the rise ofmenu prices.Restaurants, big and small, are passing along the increasing costs of basic commodities and labor. For instance, theof vegetable oils, cereals, dairy, meat, and sugar has been erupting since the beginning of the pandemic. Compound this with labor costs, along with the cost of everything soaring, and restaurants already suffering from a lost year in 2020, are raising menu prices at a much faster pace than historical rates, according to .", "is_fake": 1},
{"date": "Sunday, Jun 27, 2021 - 11:45 PM", "title": "Politics, Profit, & Poppies: How The CIA Turned Afghanistan Into A Failed Narco-State", "text": "The COVID-19 pandemic has been a death knell to so many industries in Afghanistan. Charities and aid agencies have eventhat the economic dislocation could spark widespread famine. But one sector is still booming: the illicit opium trade. Last year saw Afghan opium poppy cultivationby over a third while counter-narcotics operations dropped off a cliff. . More land is under cultivation for opium in Afghanistan than is used for coca production across all of Latin America, with the creation of the drug said to directly employ around half a million people.", "is_fake": 1},
{"date": "Wednesday, Jun 30, 2021 - 08:05 PM", "title": "Charges Filed Against Trump Org And CFO Alan Weisselberg", "text": "A Manhattan grand jury has filed the anticipated indictments against Trump Org and longtime CFO, Alan Weisselberg, who will reportedly turn himself in tomorrow, according to the . The indictments containing the specific charges will be unsealed on Thursday afternoon, however people familiar with the case say the charges are related to allegations of unpaid taxes on benefits enjoyed by Trump Organization executives.Not exactly money laundering for Russian mobsters, as the Rachel Maddows of the world have been hinting at for over four years.NEW: A Manhattan grand jury has filed indictments against President Trump's company and its longtime CFO, Allen Weisselberg.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 12:26 PM", "title": "Rescue Operations Halted At Collapsed Surfside Condo Building; Biden Pledges Full-Support  ", "text": "One week after the Champlain Towers South building, search-and-rescue efforts at the condominium site in Surfside, Fla., were halted around 0200 ET Thursday amid concerns the remaining structure could topple, according to .The pause is a massive blow for search-and-rescue teams - at least 18 residents are dead and 145 still missing. There were no new confirmed victims today.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 12:30 PM", "title": "Ireland One Of 9 Holdouts Who Refused To Sign OECD Global Corporate Tax Reform Package", "text": " In a rare scoop, the Irish Times just reported that Ireland was one of nine countries that didn't sign on to the global corporate tax deal that was reportedly struck Thursday afternoon in Paris following weeks of negotiations. Ultimately, 130 countries signed on, while the remaining nine countries - including Ireland - refused (the OECD has 139 members in total).As , the Irish government has long been wary of the new framework. The Irish Department of Finance even calculated that agreeing to it would cost the country some €2 billion in annual tax revenue as it would lose its advantageous 12.5% minimum corporate rate.With the lowest corporate tax rate in Western Europe, Ireland's participation in the deal is critical. If Dublin refuses to lower its corporate rate, it could create serious problems for the countries that agree to its terms, since Ireland won't be bound by the 15% minimum rate that's reportedly part of the deal.", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 06:44 AM", "title": "Kamala Harris Staffers Are Leaking -- And Her Office Is A 'Dysfunctional' Mess", "text": "Vice President Kamala Harris' office is a toxic, 'abusive' environment where \"people are thrown under the bus from the very top,' according to 22 current and former staffers, administration officials and associates of Harris and President Biden.In a  exposé reminiscent of a Feb. 2019  in which ", "is_fake": 1},
{"date": "Thursday, Jul 01, 2021 - 12:41 PM", "title": "\"It Won't End Well\": Self-Proclaimed \"Fully Invested Bear\" Leon Cooperman Says Market Has Him \"Nervous\"", "text": "Speaking at CNBC's Financial Advisor summit this week, Leon Cooperman - who has a track record of speaking critically about the market while it's dropping - actually went on record and criticized the market \"I have a strong feeling the cycle we're going through won't end well but I have no idea where it ends,\" he told Becky Quick on Wednesday.\"I have a strong feeling the cycle we're going through won't end well but I have no idea where it ends,\" hear the full details of what Lee Cooperman told  at yesterday's ", "is_fake": 1}
]